{
  "name": "Akureyri Airport - North Iceland Aviation Hub",
  "description": "Akureyri Airport establishes northern Iceland's primary aviation gateway serving region's largest town 19,000 population providing essential connectivity Reykjavík capital 45-minute flight year-round daily services alongside emerging international routes positioning airport critical infrastructure supporting north Iceland tourism economic development regional accessibility. December 2024 terminal expansion added 1,100 square meters separating international domestic traffic accommodating growing passenger volumes improved facilities reflecting Akureyri's ascending tourism profile gateway Diamond Circle attractions Mývatn geothermal areas Húsavík whale watching Dettifoss waterfall northern highlands wilderness experiences. Icelandair operates dominant domestic carrier providing multiple daily Reykjavík connections transporting travelers avoiding six-hour Ring Road drive enabling efficient northern exploration time-constrained itineraries while Norlandair serves regional routes Grímsey arctic island Vopnafjörður Þórshöfn connecting remote communities maintaining essential lifelines isolated populations. June 2026 launches Edelweiss Air weekly Zurich service through August establishing direct European connectivity bypassing Keflavík transfers reducing northern Iceland access barriers encouraging international visitors exploring beyond traditional south coast circuits discovering north's unique attractions lessened tourist densities authentic experiences.",
  "address": "Akureyri Airport (AEY), 600 Akureyri, North Iceland",
  "coordinates": {
    "longitude": -18.0731,
    "latitude": 65.66,
    "altitude": 2.0
  },
  "rating": 4.5,
  "reviews_count": 4820,
  "category": "Domestic & International Airport",
  "website": "https://www.innanlandsflugvellir.is/en/akureyri-airport",
  "phone": "+354 424 4000",
  "images": [
    "https://www.visitakureyri.is/images/akureyri-airport.jpg"
  ],
  "opening_hours": {
    "operation": "Year-round daily flights",
    "domestic": "Icelandair multiple daily to Reykjavík (45 minutes)",
    "regional": "Norlandair: Grímsey, Vopnafjörður, Þórshöfn",
    "international_2026": "Edelweiss Air: Zurich (June-August weekly)",
    "terminal": "Expanded Dec 2024: +1,100m², separate int'l/domestic",
    "bus_service": "Strætó intercity routes from 2026",
    "serves": "Akureyri, Siglufjörður, Ólafsfjörður, Dalvík, Húsavík, Mývatn region",
    "nearby_attractions": "Goðafoss 40min, Mývatn 90min, Diamond Circle access"
  }
}