{
  "name": "Alþingishúsið (Parliament House)",
  "description": "Alþingishúsið, the Parliament House of Iceland, stands as the symbolic heart of Icelandic democracy in downtown Reykjavík. This distinguished gray basalt building, constructed between 1881 and 1881, houses the Alþingi (Althing), one of the world's oldest existing parliaments, with roots dating back to 930 AD at Þingvellir. The building was designed by Danish architect Ferdinand Meldahl in a neoclassical style that reflects 19th-century Nordic architectural traditions. Its modest scale and unpretentious design reflect Icelandic values of egalitarianism and accessibility—there are no imposing gates or extensive security barriers separating legislators from citizens, embodying the close relationship between Iceland's government and its people.\n\nThe Parliament House faces Austurvöllur square and is flanked by Reykjavík Cathedral and other historic buildings, creating a compact civic center that has witnessed Iceland's journey from Danish dependency to full independence. The building's interior features elegant meeting chambers where Iceland's 63 parliamentarians debate and create legislation. Historical artifacts and portraits of significant political figures line the halls, creating a living museum of Icelandic democratic tradition. The building underwent significant renovation and expansion in the early 21st century to modernize facilities while preserving its historic character. The parliamentary chambers retain their traditional arrangement, and the debating chamber features a distinctive gallery where citizens can observe proceedings, maintaining transparency in government.\n\nWhile the building primarily serves as a working parliament, guided tours are available when parliament is not in session, offering visitors insight into Icelandic governance and political history. The exterior is always accessible for viewing and photography, and the building becomes a focal point during national celebrations, protests, and political demonstrations. The square in front regularly hosts gatherings ranging from New Year's Eve celebrations to protests about government policies, demonstrating Iceland's vibrant democratic culture. The Parliament House's location in the heart of Reykjavík makes it easily accessible to visitors exploring the city center, and its historical and political significance makes it an essential stop for those interested in understanding Icelandic society, governance, and the nation's journey to independence and prosperity.",
  "category": "Historic Site",
  "coordinates": {
    "latitude": 64.146582,
    "longitude": -21.939838,
    "altitude": 12.0
  },
  "rating": 4.4,
  "reviews_count": 892,
  "opening_hours": "Exterior always accessible; guided tours available by appointment when parliament not in session. Check official website for tour schedules."
}
