{
  "name": "Arctic Fox Center (Melrakkasetur Íslands)",
  "description": "The Arctic Fox Center in the remote Westfjords village of Súðavík serves as Iceland's only dedicated research, conservation, and exhibition facility focused on the Arctic fox (Vulpes lagopus), the sole native terrestrial mammal to Iceland and one of the world's most remarkable Arctic survivors. Established as a non-profit organization committed to Arctic fox research, public education, and wildlife rescue, the center occupies a unique niche in Icelandic conservation, combining active scientific research programs with engaging museum exhibits and a rescue enclosure for foxes that cannot be returned to the wild. The Arctic fox's presence in Iceland dates back approximately 10,000-15,000 years when these remarkable animals walked across frozen seas during the last Ice Age, becoming isolated on Iceland when sea ice retreated and evolving into a distinct population adapted to the island's specific conditions. These small, extraordinarily resilient carnivores survive Iceland's brutal Arctic environment through remarkable physiological adaptations: the densest fur of any mammal providing insulation down to -70°C, the ability to reduce metabolic rate during extreme cold, seasonal coat color changes from white winter camouflage to brown summer pelage, and opportunistic omnivorous feeding that allows survival on everything from seabirds and eggs to carrion, berries, and marine resources.",
  "address": "Eyrardalur, 420 Súðavík, Westfjords, Iceland",
  "coordinates": {
    "longitude": -22.95,
    "latitude": 66.0417,
    "altitude": 15.0
  },
  "rating": 4.7,
  "reviews_count": 1450,
  "category": "Museum",
  "website": "https://www.melrakki.is",
  "phone": null,
  "images": [
    "https://www.melrakki.is/images/arctic-fox-enclosure.jpg"
  ],
  "opening_hours": {
    "may_september": "Open May 1 - September 30",
    "september": "9:00 AM - 4:00 PM, weekdays only",
    "winter": "November - March closed (visit by arrangement via email)",
    "april_october": "Closed in April and October",
    "contact": "melraki@melraki.is (advance email for off-season visits)",
    "admission": "Contact center for current pricing",
    "live_enclosure": "Rescued Arctic foxes unable to return to wild",
    "research": "Year-round scientific studies on Arctic fox ecology",
    "distance_from_isafjordur": "20 minutes drive",
    "only_native_mammal": "Arctic fox is Iceland's sole indigenous land mammal",
    "conservation_status": "Non-profit, 1% for the Planet partner, Wild North member"
  }
}