{
  "name": "Aurora Reykjavík - The Northern Lights Center",
  "description": "Aurora Reykjavík serves as Iceland's premier Northern Lights education and experience center, offering visitors who may have missed seeing the aurora borealis in nature—or who want to understand the scientific and cultural significance of this phenomenon before aurora hunting—a comprehensive immersion into one of Earth's most spectacular natural displays. Located in central Reykjavík and open year-round regardless of season or weather conditions, the center provides a guaranteed aurora encounter through cutting-edge audiovisual technology, interactive exhibits, and educational content that transforms abstract scientific concepts into accessible, engaging experiences for all ages. The centerpiece attraction is a stunning 30-minute 4K timelapse film projected on a massive 7-meter-wide screen, showcasing dazzling aurora borealis displays captured across Iceland over multiple seasons and years. These meticulously filmed sequences condense hours of real-time aurora activity into dynamic, mesmerizing presentations that reveal the full range of auroral displays: from subtle green glows on the horizon to explosive multicolored curtains dancing across the entire sky; from delicate arcs and bands to violent magnetic storms that create pulsating, swirling patterns; and from the common green emissions caused by oxygen molecules to the rare red, purple, and blue hues that appear during the most intense solar activity. The timelapse format allows viewers to appreciate auroral movement and evolution in ways impossible during actual aurora viewing.",
  "address": "Grandagarður 2, 101 Reykjavík, Iceland (Grandi harbor area)",
  "coordinates": {
    "longitude": -21.9558,
    "latitude": 64.15,
    "altitude": 0.0
  },
  "rating": 4.4,
  "reviews_count": 2280,
  "category": "Museum",
  "website": "https://aurorareykjavik.is",
  "phone": "+354 780 4500",
  "images": [
    "https://aurorareykjavik.is/images/aurora-display-screen.jpg"
  ],
  "opening_hours": {
    "daily": "9:00 AM - 9:00 PM",
    "last_admission": "30 minutes before closing",
    "typical_visit": "45-60 minutes",
    "admission_adults": "3,900 ISK",
    "admission_children": "1,900 ISK (ages 6-18)",
    "admission_under_6": "Free",
    "main_film": "30-minute 4K timelapse on 7-meter screen",
    "vr_experience": "360-degree virtual reality aurora simulation",
    "open_year_round": "Summer and winter (when actual auroras aren't visible)"
  }
}