{
  "name": "Austurvöllur Square",
  "description": "Austurvöllur is Reykjavík's historic central square and the symbolic heart of Iceland's capital city. This compact public plaza has served as the city's main gathering place since Reykjavík's early development in the 18th and 19th centuries. The square is surrounded by some of Iceland's most significant buildings, including the Alþingishúsið (Parliament House), Dómkirkjan (Reykjavík Cathedral), and Hotel Borg, one of the city's oldest hotels. At the center of the square stands a statue of Jón Sigurðsson, leader of Iceland's 19th-century independence movement, gazing toward the parliament building as if watching over the democratic institution he fought to establish. The square's name literally means \"Eastern Field,\" referencing its location relative to Reykjavík's original settlement core.\n\nThroughout Iceland's modern history, Austurvöllur has been the primary venue for public demonstrations, celebrations, and national gatherings. During the 2008-2009 financial crisis, the square became famous internationally as the site of the \"Pots and Pans Revolution,\" where thousands of Icelanders protested government handling of the banking collapse. The square has also hosted celebrations of Iceland's football team's unexpected success in international tournaments, bringing together tens of thousands of jubilant Icelanders. On New Year's Eve, it serves as one of the main gathering points for celebrations, and during Reykjavík's annual Culture Night, it becomes a hub for performances and festivities. This small square thus holds outsized importance in Iceland's civic life, serving as a stage for both joyous celebrations and serious political discourse.\n\nFor visitors, Austurvöllur offers an excellent introduction to Reykjavík's history and contemporary culture. The square is surrounded by cafés and restaurants where locals and tourists mingle, making it an ideal spot for people-watching and experiencing everyday Icelandic life. The grassy center of the square is popular with office workers during lunch hours in summer, when Reykjavík's extended daylight encourages outdoor dining and relaxation. The square's compact size and central location make it a natural meeting point and a frequent stop on walking tours of downtown Reykjavík. Its proximity to major attractions, shopping streets, and cultural institutions means most visitors will pass through multiple times during a Reykjavík visit, experiencing different aspects of the square's character throughout the day and evening.",
  "category": "Historic Site",
  "coordinates": {
    "latitude": 64.146944,
    "longitude": -21.940278,
    "altitude": 10.0
  },
  "rating": 4.5,
  "reviews_count": 1567,
  "opening_hours": "Public square accessible 24/7 year-round. Surrounding cafés and businesses have varying hours."
}
