{
  "name": "Bæjarfoss - The Town Waterfall of Ólafsvík",
  "description": "Bæjarfoss, translating literally to \"Town Falls,\" is a charming 35-meter waterfall that tumbles dramatically down the mountainside directly behind the picturesque fishing town of Ólafsvík on Iceland's Snæfellsnes Peninsula, creating an unusual and delightful situation where residents and visitors can enjoy a substantial waterfall as part of the everyday town landscape. Located in West Iceland on the northern coast of the Snæfellsnes Peninsula (often called \"Iceland in Miniature\" for its concentration of diverse landscapes), Bæjarfoss represents a rare example of a waterfall integrated into a settled area rather than requiring travel into wilderness—you can literally walk from Ólafsvík's town center, harbor, and services directly to the base of a multi-tier cascade in just minutes. The waterfall descends in several distinct steps and channels as its source stream navigates the steep slope behind town, with water spreading across dark volcanic rock ledges, creating white veils against the mountain backdrop. The accessibility and town setting make Bæjarfoss particularly family-friendly and convenient for travelers who want to experience an Icelandic waterfall without lengthy hikes or challenging drives, ideal for those with limited time, mobility constraints, or families with young children. The walk to the waterfall from Ólafsvík's center takes approximately 10-15 minutes via residential streets and then a short trail, offering glimpses of local life and architecture along the way before reaching the more natural setting at the falls' base.",
  "address": "Ólafsvík, 355 Snæfellsbær, Snæfellsnes Peninsula, West Iceland",
  "coordinates": {
    "longitude": -23.7133,
    "latitude": 64.8944,
    "altitude": 20.0
  },
  "rating": 4.4,
  "reviews_count": 980,
  "category": "Waterfall",
  "website": "https://www.west.is/en/baejarfoss",
  "phone": null,
  "images": [
    "https://www.west.is/images/baejarfoss-olafsvik.jpg"
  ],
  "opening_hours": {
    "access": "Year-round (in town - walk from center)",
    "walk_from_town": "10-15 minutes from Ólafsvík center",
    "parking": "Street parking in Ólafsvík",
    "admission": "Free",
    "height": "35 meters (multi-tier cascade)",
    "town_population": "Approximately 1,000 residents",
    "services_in_olafsvik": "Accommodations, restaurants, grocery, fuel",
    "nearby_attractions": "Snæfellsjökull glacier, Rauðfeldsgjá, Lóndrangar sea stacks"
  }
}