{
  "name": "Bolungarvík - Iceland's Northernmost Fishing Village",
  "description": "Bolungarvík is a resilient fishing village of approximately 1,022 residents (as of August 2024) located in Iceland's remote Westfjords region, serving as the second-largest settlement in this sparsely populated area and one of Iceland's northernmost year-round communities. Situated at the northern tip of the Westfjords peninsula, this historic village has been used as a fishing outpost since the 17th century, making it one of the earliest fishing stations in Iceland, and fishing remains the economic foundation of the community today. The town occupies a dramatic position wedged between towering mountains and the North Atlantic Ocean, a geography that has presented both opportunities and challenges throughout its history. The threat of avalanches from the steep mountains looming directly above the village prompted construction of Iceland's largest avalanche protection barriers—massive concrete and earthen structures designed to deflect snow and rockslides away from homes and buildings. Until 2010, reaching Bolungarvík required navigating an exposed and dangerous coastal road around Óshlíð mountain that was frequently blocked by snow, avalanches, or severe weather, effectively cutting off the village from the outside world for extended periods during winter. The completion of the Óshlíðargöng tunnel in 2010 revolutionized access, providing safe year-round connection to Ísafjörður just 15 kilometers away and contributing to renewed growth and optimism in the community.",
  "address": "Bolungarvík, 415 Bolungarvíkurkaupstaður, Iceland",
  "coordinates": {
    "longitude": -23.2558,
    "latitude": 66.1539,
    "altitude": 5.0
  },
  "rating": 4.3,
  "reviews_count": 980,
  "category": "Fishing Village",
  "website": "https://www.bolungarvik.is",
  "phone": "+354 450 7000",
  "images": [
    "https://www.westfjords.is/images/bolungarvik-mountain-view.jpg"
  ],
  "opening_hours": {
    "natural_history_museum": "Summer daily 10:00 AM - 5:00 PM (check locally; was closed for renovations 2021)",
    "osvor_maritime_museum": "June-August, daily tours available",
    "tunnel_to_isafjordur": "15 km, safe year-round access",
    "avalanche_barriers": "Visible throughout town (Iceland's largest protection system)",
    "population": "1,022 residents (August 2024), growing since 2020",
    "fishing_heritage": "Active since 17th century, one of Iceland's oldest fishing stations"
  }
}