{
  "name": "Breiðholtslaug - Modern Pool Complex in South Reykjavík",
  "description": "Breiðholtslaug serves the Breiðholt neighborhood in southern Reykjavík with a modern, well-equipped swimming facility that exemplifies contemporary Icelandic pool design, balancing serious athletic training opportunities with family recreation and the social hot tub culture that makes swimming pools Iceland's most democratic gathering places. Located in Breiðholt—one of Reykjavík's largest residential districts, developed primarily in the 1970s-1980s as planned suburban expansion housing working and middle-class families—the pool functions as a vital community hub where neighbors encounter each other regularly, children learn swimming through school programs and family visits, and residents of all ages maintain health through aquatic exercise in heated pools that make year-round swimming comfortable regardless of Iceland's challenging weather. The facility features both outdoor and indoor pools that provide options for different preferences and weather conditions: the outdoor 25 x 12.5 meter pool with five lanes accommodates lap swimmers training for competition or fitness while maintaining comfortable 29°C (84°F) temperature; the smaller indoor pool measuring 12.5 x 8 meters at slightly warmer 30°C (86°F) offers sheltered swimming preferred by those sensitive to cold air or wind. Dedicated children's pools—both outdoor and indoor versions—provide safe, age-appropriate environments where young swimmers build confidence and skills. Two waterslides deliver the excitement that transforms swimming from exercise into entertainment for children (and adults who retain playful spirits), with a smaller children's slide scaled for youngest users. The facility's two hot tubs provide traditional Icelandic soaking and conversation opportunities where pot chat flourishes—those relaxed discussions about everything from local politics to weather to family matters that constitute Iceland's most egalitarian social practice. A sauna offers dry heat for those who prefer traditional Finnish-style steam and the cleansing, detoxifying sensation of sweating in wooden warmth. A steam bath provides humid alternative for respiratory benefits and skin hydration. The bracing cold plunge pool allows contrast bathing enthusiasts to alternate between hot and cold immersion for circulation benefits and invigorating sensation. Accessibility features prominently in Breiðholtslaug's design with a wheelchair elevator providing access to the pool, and the sauna specifically designed for wheelchair accessibility—reflecting Iceland's commitment to inclusive design that makes swimming culture available to all regardless of physical limitations. The pool offers free group swimming on the third Wednesday of each month from 8:30-9:30 PM during winter, creating special community events that bring neighbors together.",
  "address": "Austurberg 3, 111 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.8764,
    "latitude": 64.1108,
    "altitude": 35.0
  },
  "rating": 4.5,
  "reviews_count": 1280,
  "category": "Swimming Pool",
  "website": "https://reykjavik.is/en/breidholtslaug-pool",
  "phone": "+354 411 5250",
  "images": [
    "https://reykjavik.is/sites/default/files/breidholtslaug-pool.jpg"
  ],
  "opening_hours": {
    "weekdays": "Monday-Friday 6:30 AM - 10:00 PM",
    "weekends": "Saturday-Sunday 9:00 AM - 9:00 PM",
    "outdoor_pool": "25 x 12.5m, 5 lanes, 29°C (84°F)",
    "indoor_pool": "12.5 x 8m, 30°C (86°F)",
    "hot_tubs": "2 hot tubs",
    "cold_plunge": "Cold tub for contrast bathing",
    "waterslides": "2 waterslides + small children's slide",
    "features": "Children's pools (indoor & outdoor), sauna, steam bath",
    "accessibility": "Wheelchair elevator to pool, wheelchair-accessible sauna",
    "special_events": "Free group swimming 3rd Wednesday monthly 8:30-9:30 PM (winter)",
    "neighborhood": "Breiðholt, South Reykjavík suburban district",
    "character": "Modern community pool with strong neighborhood atmosphere"
  }
}
