{
  "name": "Búri",
  "description": "Búri is an impressive explosion crater located in the Mývatn volcanic system in North Iceland, formed during the Krafla Fires volcanic episode between 1975 and 1984. This relatively young volcanic feature is characterized by its near-perfect circular shape and steep walls that descend approximately 70-80 meters to a flat crater floor. The crater's name means 'store' or 'pantry' in Icelandic, though the origin of this name is unclear. Búri represents one of the most recent examples of volcanic crater formation in Iceland, making it particularly valuable for geological study and education.\n\nThe crater was formed through phreatomagmatic explosions, which occur when rising magma encounters groundwater, creating violent steam-driven eruptions. The resulting crater showcases textbook examples of volcanic stratigraphy, with multiple layers of different colored volcanic materials visible in the crater walls. These layers tell the story of repeated volcanic episodes and varying eruption styles over time. The rim of the crater offers spectacular 360-degree views of the surrounding Krafla volcanic system, including the Krafla caldera, Leirhnjúkur lava fields, and Lake Mývatn in the distance. The contrast between the dark volcanic rock and bright mineral deposits creates a dramatic and photogenic landscape.\n\nBúri is accessible via well-marked hiking trails from the Krafla area parking lot. The hike to the crater rim takes approximately 20-30 minutes and involves moderate climbing over volcanic terrain. The trail is well-maintained but requires sturdy hiking boots due to sharp volcanic rock. Descending into the crater is possible but requires caution and good physical condition. The site offers excellent opportunities for photography, geology enthusiasts, and those interested in recent volcanic activity. Summer months (June-September) provide the best visiting conditions, though the site is accessible year-round for experienced hikers. Nearby attractions include the Krafla Power Station, Víti crater, and Leirhnjúkur geothermal area, all within a 5-kilometer radius.",
  "category": "Volcano",
  "coordinates": {
    "latitude": 65.713889,
    "longitude": -16.763889,
    "altitude": 540.0
  },
  "rating": 4.6,
  "reviews_count": 380,
  "opening_hours": "Open 24/7 (hiking trail, summer access recommended)"
}
