{
  "name": "Jólahúsið (Christmas House)",
  "description": "Jólahúsið, the enchanting Christmas House, is a year-round celebration of Icelandic holiday traditions and festive spirit located along Route 821 approximately 12 kilometers south of Akureyri in the scenic Eyjafjörður valley. This charming attraction has become a beloved destination for visitors seeking to experience the magic of an Icelandic Christmas regardless of the season, offering a delightful escape into a winter wonderland even during the bright midnight sun of summer. The Christmas House occupies a distinctive red building that immediately evokes holiday cheer, and inside, two floors overflow with an extraordinary collection of Christmas decorations, ornaments, gifts, homeware, music, books, and festive artwork sourced from Iceland and around the world. The carefully curated selection includes handcrafted Icelandic ornaments made by local artisans using traditional techniques and materials such as wool, wood, and lava stone; imported European glass ornaments in every imaginable color and design; traditional Icelandic holiday treats including the distinctive leaf bread (laufabrauð) cutters and recipe books; unique Nordic Christmas decorations featuring trolls, elves, and the mischievous Yule Lads (Jólasveinar) who are central to Icelandic Christmas folklore; festive homeware and textiles perfect for creating a cozy Icelandic holiday atmosphere; Christmas music ranging from traditional carols to Icelandic holiday recordings; and specialty food items associated with Icelandic Christmas celebrations.",
  "address": "Route 821, 601 Akureyri, Iceland",
  "coordinates": {
    "longitude": -18.1223,
    "latitude": 65.6145,
    "altitude": 15.0
  },
  "rating": 4.4,
  "reviews_count": 2100,
  "category": "Specialty Shop",
  "website": "https://www.jolahusid.is",
  "phone": "+354 463 1433",
  "images": [
    "https://www.jolahusid.is/images/exterior-red-house.jpg"
  ],
  "opening_hours": {
    "summer": "June - August, daily 10:00 AM - 6:00 PM",
    "autumn": "September - December, daily 12:00 PM - 6:00 PM",
    "winter_spring": "January - May, daily 2:00 PM - 6:00 PM",
    "admission": "Free entry (shopping venue)",
    "apple_shed": "Eplakofinn adjacent (candy apples & waffles)",
    "location": "12 km south of Akureyri on Route 821"
  }
}