{
  "name": "Dalvík Swimming Pool - Sports Centre Complex",
  "description": "Dalvík Swimming Pool serves this charming fishing town of approximately 1,400 residents on the western shore of Eyjafjörður fjord in North Iceland with a comprehensive aquatic and fitness facility featuring pools, hot tubs, waterslide, sauna, and integrated gym, all with spectacular views across Svarfaðardalur valley and surrounding mountains that make swimming here a particularly scenic experience. Dalvík is known for its fishing industry heritage, annual Great Fish Day festival (Fiskidagurinn Mikli) where the entire town celebrates with free fish soup and fish dishes served to thousands of visitors, and as the departure point for ferry service to Grímsey island on the Arctic Circle. The town's location provides stunning natural beauty with the dramatic peaks of Tröllaskagi peninsula rising directly behind town and Eyjafjörður's waters stretching north toward the Arctic Ocean. The swimming pool occupies the town's sports center (íþróttahús), creating an integrated wellness complex where aquatic facilities combine with gym equipment for comprehensive fitness options. The main pool accommodates lap swimming, recreational bathing, and the year-round outdoor swimming that remains popular in North Iceland despite—or perhaps because of—the bracing contrast between warm geothermal water and cold northern air. Multiple hot tubs provide essential soaking and pot chat opportunities where Dalvík's close-knit community gathers for relaxed conversations that constitute Iceland's most democratic social practice—in a small town like Dalvík.",
  "address": "Íþróttahús, 620 Dalvík, North Iceland",
  "coordinates": {
    "longitude": -18.5294,
    "latitude": 65.9703,
    "altitude": 5.0
  },
  "rating": 4.6,
  "reviews_count": 720,
  "category": "Swimming Pool",
  "website": "https://www.northiceland.is/en/service/dalvik-swimming-pool",
  "phone": "+354 460 4900",
  "images": [
    "https://www.northiceland.is/images/dalvik-pool-mountain-view.jpg"
  ],
  "opening_hours": {
    "monday_thursday": "6:15 AM - 8:00 PM",
    "friday": "6:15 AM - 7:00 PM",
    "weekends": "9:00 AM - 5:00 PM",
    "pool_features": "Swimming pool, children's pool, waterslide",
    "hot_tubs": "Hot tubs",
    "wellness": "Sauna",
    "sports_center": "Integrated gym with equipment",
    "views": "Spectacular views across Svarfaðardalur valley",
    "town": "Dalvík (pop. ~1,400), fishing town on Eyjafjörður",
    "location": "Ring Road (Route 1), 40km north of Akureyri",
    "annual_event": "Great Fish Day (Fiskidagurinn Mikli) festival",
    "ferry": "Departure point for Grímsey island ferry (Arctic Circle)",
    "character": "Small-town community pool with stunning fjord and mountain setting"
  }
}