{
  "name": "Dettifoss - Europe's Most Powerful Waterfall",
  "description": "Dettifoss establishes Europe's most powerful waterfall where 45-meter cascade 100-meter width unleashes 193-500 cubic meters per second creating thunderous spectacle raw natural power positioned Jökulsá á Fjöllum glacial river Vatnajökull National Park demonstrating Iceland's extreme hydrological forces attracting visitors worldwide seeking witness nature's overwhelming might establishing premier waterfall destination though requiring significant travel commitment accessing remote northeastern highlands. Glacial silt-laden waters create distinctive grey-brown coloring contrasting clear-water cascades elsewhere where sediment loads transported Vatnajökull glacier create unique aesthetic though diminishing photographic appeal compared crystal-clear falls nevertheless demonstrating authentic glacial river characteristics educating visitors geological processes sediment transportation erosion dynamics. Eastern western viewing platforms provide different perspectives where eastern Route 864 paved road enables easier access family-friendly viewing though western Route 862 rough gravel road rewards adventurous travelers dramatic closer viewpoints though requiring 4x4 vehicles confident driving skills accepting challenging conditions. Prometheus filming location Ridley Scott 2012 science fiction film established global recognition where opening sequence spectacular waterfall imagery introduced millions viewers Icelandic landscapes creating cinema-tourism phenomenon attracting film enthusiasts seeking iconic locations establishing unexpected pop-culture dimension supplementing purely natural tourism appeals.",
  "address": "Dettifoss, Jökulsá á Fjöllum, Vatnajökull National Park",
  "coordinates": {
    "longitude": -16.3833,
    "latitude": 65.8167,
    "altitude": 220.0
  },
  "rating": 4.8,
  "reviews_count": 18920,
  "category": "Waterfall",
  "website": "https://www.vjp.is",
  "phone": null,
  "images": [
    "https://www.vjp.is/images/dettifoss.jpg"
  ],
  "opening_hours": {
    "access": "Summer (June-Sept), winter challenging/closed",
    "height": "45 meters",
    "width": "100 meters",
    "flow": "193-500 m³/s (Europe's most powerful)",
    "routes": "East Route 864 paved, West Route 862 gravel (4x4)",
    "prometheus": "2012 Ridley Scott film location",
    "character": "Europe's most powerful waterfall, glacial river, remote highlands"
  }
}
