{
  "name": "Dimmuborgir - Dark Castles Lava Formations",
  "description": "Dimmuborgir establishes extraordinary lava formation landscape eastern Lake Myvatn where dramatic basaltic pillars arches caves create otherworldly terrain resembling ancient fortress ruins where 2,300-year-old volcanic eruption created steam explosions fragmenting cooling lava forming bizarre geological structures rising 20 meters creating labyrinthine dark castle landscape establishing prime Diamond Circle attraction North Iceland. Geological formation process occurred massive lava lake formed over marshy wetland where superheated water converted steam creating violent explosions fragmenting solidifying lava establishing unique rootless vent landscape creating pillars where lava solidified around burning trees leaving hollow vertical tunnels establishing extraordinary volcanic remnant landscape. Icelandic folklore mythology adds mystical significance describing Dimmuborgir location Satan landed cast heaven establishing home Iceland 13 Yule Lads mischievous Christmas trolls visiting children December nights creating cultural narrative beyond purely geological interest establishing dual natural-cultural tourism appeal. Game of Thrones filming location features HBO series Season 3 where dramatic formations served Wildling encampment north Wall Mance Rayder gathering Free Folk creating international fame attracting pop culture tourism supplementing geological interest establishing multifaceted visitor appeal combining nature mythology entertainment tourism establishing diverse audience attraction. Multiple marked hiking trails varying lengths difficulties enable exploration where short 20-30 minute family-friendly circuits longer hour loops comprehensive formation viewing enable diverse visitor accommodations fitness levels timeframes establishing accessible tourism infrastructure supporting mass visitation managing environmental impacts protecting fragile formations.",
  "address": "Dimmuborgir, 660 Myvatn, North Iceland",
  "coordinates": {
    "longitude": -16.9127,
    "latitude": 65.5899,
    "altitude": 30.0
  },
  "rating": 4.8,
  "reviews_count": 12500,
  "category": "Lava Formation",
  "website": "https://www.north.is/dimmuborgir",
  "phone": null,
  "images": [
    "https://www.north.is/images/dimmuborgir.jpg"
  ],
  "opening_hours": {
    "access": "Year-round, 24/7",
    "trails": "Multiple marked trails (20 min - 1 hour)",
    "parking": "Parking fees may apply",
    "facilities": "Summer cafe and restrooms",
    "diamond_circle": "Major Diamond Circle attraction",
    "character": "Volcanic lava formations, Game of Thrones filming location"
  }
}
