{
  "name": "Djúpivogur - The Village of Eggs",
  "description": "Djúpivogur is a peaceful fishing village of approximately 450 residents located on the Búlandsnes Peninsula in East Iceland, offering visitors an authentic glimpse of traditional Icelandic coastal life away from the bustle of larger tourist destinations. This historic settlement, one of the oldest trading posts in East Iceland, maintains its economic foundation in fishing, fish processing, and increasingly, tourism drawn by the area's unique combination of natural beauty, wildlife, and public art. The village's most distinctive landmark is the visual art installation \"Eggin í Gleðivík\" (The Eggs of Merry Bay), a remarkable outdoor sculpture by celebrated Icelandic artist Sigurður Guðmundsson unveiled in August 2009. This permanent installation consists of 34 enormous granite eggs, each precisely carved to represent the actual size and shape of eggs laid by the different bird species that nest in the Djúpivogur area. The eggs, crafted from granite in China and installed along the shoreline of Gleðivík bay, range from tiny eggs representing small songbirds to massive eggs for swans and geese, creating an unusual and thought-provoking meditation on biodiversity and the relationship between art and nature. Visitors can walk among these monumental stone eggs, each labeled with the Icelandic name of the bird species it represents, while enjoying views across the bay to the distinctive pyramid-shaped mountain Búlandstindur, which legend says can grant wishes if you look at it without blinking while the sun rises on the summer solstice.",
  "address": "Djúpivogur, 765 Djúpavogshreppur, Iceland",
  "coordinates": {
    "longitude": -14.2833,
    "latitude": 64.65,
    "altitude": 3.0
  },
  "rating": 4.5,
  "reviews_count": 1650,
  "category": "Village",
  "website": "https://www.east.is/en/destinations/communities/djupivogur",
  "phone": "+354 478 8220",
  "images": [
    "https://www.east.is/images/djupivogur-eggs-sculpture.jpg"
  ],
  "opening_hours": {
    "eggin_sculptures": "Accessible 24/7 (outdoor installation)",
    "langabud_museum": "June-August, daily 10:00 AM - 6:00 PM; other times by arrangement",
    "museum_admission": "Adults 1,000 ISK, children free",
    "langabud_cafe": "Summer season (June-August)",
    "bulandstindur_summer_solstice": "June 21 (wish-granting legend)",
    "population": "Approximately 450 residents"
  }
}