{
  "name": "Dynjandi",
  "description": "Dynjandi (also called Fjallfoss) is the most magnificent waterfall in the Westfjords, cascading a total of 100 meters down a mountainside in a spectacular series of cascades. The main waterfall features a unique fan-shape formation, widening from 30 meters at the top to 60 meters at the base, resembling a bridal veil or pyramid of water. This distinctive wedge shape makes Dynjandi instantly recognizable and one of Iceland's most photographed waterfalls. The name \"Dynjandi\" translates to \"thunderous\" or \"resounding,\" referring to the powerful roar of water echoing through the valley. The waterfall is fed by the lake Dynjandisvatn above, with water cascading through seven distinct tiers, each with its own name: Dynjandi (the main fall), followed downstream by Háifoss, Strompgljúfrafoss, Göngumannafoss, Hrísvaðsfoss, Sjóarfoss, and finally Bæjarfoss at the base. Dynjandi serves as the crown jewel of the Westfjords and holds special cultural significance for the region. The waterfall appears on the municipal coat of arms for Ísafjarðarbær and symbolizes Westfjords identity. The seven-tiered cascade system creates a spectacular natural amphitheater with each falls contributing to the overall composition. The main Dynjandi falls drops approximately 60 meters with its characteristic fan shape, while the combined height of all seven tiers reaches 100 meters. The waterfall maintains impressive flow year-round, though peak flow occurs during spring and early summer when snowmelt swells the volume.",
  "address": "Route 60, Westfjords, Iceland",
  "coordinates": {
    "longitude": -23.2,
    "latitude": 65.73,
    "altitude": 100.0
  },
  "rating": 4.9,
  "reviews_count": 3600,
  "category": "Waterfall",
  "website": "https://www.westfjords.is/en/place/dynjandi",
  "phone": null,
  "images": [
    {
      "source": "Wikimedia Commons",
      "url": "https://commons.wikimedia.org/wiki/File:Dynjandi_waterfall.jpg"
    },
    {
      "source": "Westfjords",
      "url": "https://www.westfjords.is/en/place/dynjandi"
    }
  ],
  "opening_hours": {
    "site": "Accessible June-September (winter access very difficult)",
    "trail": "15-20 minute hike to main falls, 100m elevation gain",
    "parking": "Free parking at base, basic facilities available",
    "cascades": "Seven tiers total, viewing platforms at each level",
    "notes": "Remote Westfjords location, unpaved access road"
  }
}