{
  "name": "Eldhraun - World's Largest Moss-Covered Lava Field",
  "description": "Eldhraun represents Earth's largest lava field created during single eruption event, covering approximately 565 square kilometers (220 square miles) of South Iceland landscape where catastrophic 1783-1784 Laki volcanic eruption produced 14 cubic kilometers (42 billion tonnes) of basaltic lava flows over eight-month period from June 1783 to February 1784, creating apocalyptic environmental disaster that transformed Icelandic society, caused global climate anomalies, contributed to French Revolution conditions through agricultural failures, and demonstrated volcanic eruptions' capacity to affect entire Northern Hemisphere through atmospheric aerosol injection. The Laki fissure eruption released 120 million tonnes of sulfur dioxide into atmosphere along with massive hydrofluoric acid clouds that poisoned Iceland's grasslands, killing approximately 50-80% of Iceland's livestock (including 50% of cattle, 80% of sheep) through fluorine poisoning as animals ingested contaminated vegetation, leading to famine killing roughly 20% of Iceland's human population (approximately 10,000 people from 50,000 total) in catastrophe remembered as Móðuharðindin (Mist Hardships) that nearly ended Icelandic settlement and prompted Danish government to consider evacuating surviving population to Danish territories. The global climate impacts created 'year without summer' conditions across Northern Hemisphere where sulfate aerosols formed stratospheric veil reducing solar radiation reaching Earth's surface.",
  "address": "Eldhraun, between Kirkjubæjarklaustur and Vík, South Iceland (along Route 1)",
  "coordinates": {
    "longitude": -18.2167,
    "latitude": 63.7667,
    "altitude": 250.0
  },
  "rating": 4.7,
  "reviews_count": 4120,
  "category": "Lava Field",
  "website": "https://www.south.is/en/inspiration/places/eldhraun",
  "phone": "+354 487 4620",
  "images": [
    "https://www.south.is/static/eldhraun-moss.jpg"
  ],
  "opening_hours": {
    "area_size": "565 km² (220 square miles) - world's largest single-eruption lava field",
    "eruption_period": "June 1783 - February 1784 (8 months)",
    "laki_fissure": "25 km long with multiple eruptive segments",
    "lava_volume": "14 km³ or 42 billion tonnes of basaltic lava",
    "sulfur_dioxide": "120 million tonnes released into stratosphere",
    "hydrofluoric_acid": "Poisonous clouds contaminated vegetation",
    "livestock_death": "50-80% killed (50% cattle, 80% sheep from fluorine poisoning)",
    "human_death": "~20% of population (~10,000 of 50,000) in famine",
    "icelandic_name": "Móðuharðindin (Mist Hardships)",
    "near_extinction": "Nearly ended Icelandic settlement, evacuation considered",
    "global_cooling": "'Year without summer' - stratospheric sulfate veil",
    "europe_impacts": "Crop failures, bread shortages contributed to French Revolution",
    "africa_india": "Droughts, disrupted monsoons",
    "worldwide_reach": "Temperature drops in North America and Japan",
    "moss_type": "Woolly fringe moss (Racomitrium lanuginosum)",
    "moss_growth": "Nearly century to reach current thickness",
    "regeneration_time": "Decades to recover from trampling damage",
    "color_transformation": "Black volcanic rock covered by emerald-green carpet",
    "ecological_functions": "Water retention, nitrogen fixation, habitat, soil formation",
    "succession_role": "Enables vascular plant colonization of sterile lava",
    "access": "Ring Road traverses western edge",
    "parking": "Small free areas between Kirkjubæjarklaustur and Vík",
    "trail_rules": "Designated paths only - no off-trail travel",
    "name_meaning": "Eldhraun = 'Fire Lava'",
    "fire_sermon": "July 20, 1783 - Rev. Jón Steingrímsson's famous sermon",
    "miracle_story": "Lava stopped at Kirkjubæjarklaustur parish boundaries during service",
    "fissure_eruption": "Linear crack eruption, not central volcano",
    "eruption_features": "Lava fountains, spatter cones, flowing rivers of molten rock",
    "historical_record": "Unprecedented lava volume in Iceland's written history",
    "current_status": "Dormant lava field, ongoing moss ecosystem",
    "protection_need": "Fragile moss requires visitor discipline"
  }
}