{
  "name": "Esjan",
  "description": "Esjan (also spelled Esja) is a 914-meter high volcanic mountain range dominating the skyline north of Reykjavík across Kollafjörður bay, visible from most of the capital area. The mountain is actually part of an ancient extinct volcano, with its distinctive flat-topped profile and stratified cliffs showing layers of volcanic rock from eruptions spanning millions of years. Esjan is Reykjavík residents' favorite hiking destination, offering accessible trails, spectacular panoramic views of the capital region, and a quick escape into nature just 16 kilometers from downtown. The mountain's prominence makes it a constant backdrop to daily life in Reykjavík - locals check Esjan's appearance to gauge weather conditions, with the saying \"Ef Esjan sést, þá rignir síðar\" (If you can see Esjan, it will rain later). The mountain's geology reveals approximately 3-4 million years of volcanic history through its layered cliffs of basalt, tuff, and rhyolite. The characteristic flat top (called Hábunga) and steep southern face create dramatic topography that has resisted erosion while surrounding areas have worn away. The mountain supports diverse flora including Arctic birch woodlands at lower elevations and alpine vegetation higher up. Wildlife includes Arctic foxes, ptarmigans, and various seabirds. The southern face features multiple hiking trails of varying difficulty, with the most popular route leading to Þverfellshorn (780m) taking 2-3 hours round trip.",
  "address": "Route 1, north of Reykjavík, accessed via Esjustofa parking",
  "coordinates": {
    "longitude": -21.65,
    "latitude": 64.27,
    "altitude": 914.0
  },
  "rating": 4.7,
  "reviews_count": 3400,
  "category": "Mountain",
  "website": "https://www.visitreykjavik.is/mount-esja",
  "phone": null,
  "images": [
    {
      "source": "Wikimedia Commons",
      "url": "https://commons.wikimedia.org/wiki/File:Mount_Esjan.jpg"
    },
    {
      "source": "Visit Reykjavík",
      "url": "https://www.visitreykjavik.is/mount-esja"
    }
  ],
  "opening_hours": {
    "site": "Accessible year-round",
    "main_trail": "To Þverfellshorn (780m), 2-3 hours round trip",
    "parking": "Esjustofa parking area off Route 1, pay station present",
    "difficulty": "Moderate to challenging, chains on steep sections",
    "safety": "Rapidly changing weather, proper equipment essential, many rescues annually"
  }
}