{
  "name": "Eyjafjallajökull",
  "description": "Eyjafjallajökull is one of Iceland's most famous stratovolcanoes, capped by a retreating ice glacier that covered 66 square kilometers in 2019, down from over 80 square kilometers previously. Located in southern Iceland north of Skógar and west of the larger Mýrdalsjökull glacier, the ice-covered volcano rises to a summit elevation of 1,651 meters. The volcano is characterized by its conical shape formed from layers of hardened basalt and andesite lavas, pumice, and tephra accumulated over millennia. The main outlet glaciers flow northward: Gígjökull into Lónið lake and Steinsholtsjökull into Steinsholtslón lagoon. Eyjafjallajökull gained worldwide attention in 2010 when a series of eruptions between March and June caused unprecedented disruption to air travel across Western Europe. On March 21, fountains of lava began erupting through a 500-meter-long vent in the ice-free Fimmvörðuháls Pass separating Eyjafjallajökull from Mýrdalsjökull. A more explosive phase began on April 14 when new craters opened under the ice-covered central summit caldera, producing very fine-grained tephra that rose high into the atmosphere. The ash cloud grounded flights across Europe for weeks, affecting over 10 million travelers and costing the aviation industry an estimated $1.7 billion. The eruption was officially declared over in October 2010 after three months of inactivity, when snow on the glacier no longer melted from volcanic heat. The nearby LAVA Centre in Hvolsvöllur, opened in 2017, serves as the primary interpretive museum for Eyjafjallajökull and the surrounding volcanic region.",
  "address": "Eyjafjallajökull, 861 Hvolsvöllur, Iceland",
  "coordinates": {
    "longitude": -19.6083,
    "latitude": 63.6314,
    "altitude": 1651.0
  },
  "rating": 4.7,
  "reviews_count": 9800,
  "category": "Volcano",
  "website": "https://www.south.is/en/destinations/travel-routes/the-volcanic-way/eyjafjallajokull",
  "phone": null,
  "images": [
    "https://commons.wikimedia.org/wiki/Category:Eyjafjallaj%C3%B6kull",
    "https://commons.wikimedia.org/wiki/Category:2010_eruption_series_in_the_Eyjafjallaj%C3%B6kull_volcanic_system"
  ],
  "opening_hours": {
    "volcano_viewing": "Visible from Ring Road year-round, weather permitting",
    "lava_centre": "Daily 09:00-19:00, Hvolsvöllur village (30 km east), admission required",
    "thorvaldseyri_centre": "Seasonal hours vary, verify current status before visiting",
    "summit_hikes": "Guided tours only, 9-12 hours round-trip, June-September recommended",
    "fimmvorduhals_trail": "Best hiked mid-June to September, 25 km, requires experience and proper gear",
    "glacier_tours": "Year-round guided tours available, advance booking required",
    "access": "Located off Ring Road (Route 1), approximately 2-hour drive from Reykjavík, visible between Seljalandsfoss and Skógafoss waterfalls"
  }
}
