{
  "name": "Fáskrúðsfjörður - The French Village",
  "description": "Fáskrúðsfjörður is a unique and historically fascinating village of approximately 750 residents in East Iceland's fjord country, distinguished by its extraordinary French heritage that makes it unlike any other Icelandic settlement. Founded in 1880, this picturesque coastal town served as the main hub for French fishermen operating off Iceland's east coast from the early 16th century until 1935, when French cod fishing expeditions to Iceland finally ceased. For centuries, French fishing boats from coastal villages like Dunkirk, Paimpol, and Gravelines sailed to Iceland's rich fishing grounds each season, and Fáskrúðsfjörður became their primary base, gradually developing French infrastructure that was remarkable for such a remote location. The French presence reached its peak in the late 19th and early 20th centuries when the French state constructed substantial buildings including a French hospital (built in 1903 and, at the time, the biggest and most modern hospital in all of Iceland), a French consul's residence, a chapel, and a graveyard for French sailors who perished in the dangerous North Atlantic waters or from illness far from home. This cultural legacy remains vibrantly alive today through bilingual Icelandic-French street signs throughout the village—the only place in Iceland with bilingual signage—and through beautifully restored French heritage buildings that represent one of the largest historical restoration projects outside the Reykjavík area, completed in 2014.",
  "address": "Fáskrúðsfjörður, 750 Fjarðabyggð, Iceland",
  "coordinates": {
    "longitude": -14.0456,
    "latitude": 64.935,
    "altitude": 3.0
  },
  "rating": 4.6,
  "reviews_count": 1280,
  "category": "Village",
  "website": "https://www.faskrudsfjordur.is",
  "phone": "+354 475 1400",
  "images": [
    "https://www.east.is/images/faskrudsfjordur-french-hospital.jpg"
  ],
  "opening_hours": {
    "french_museum": "Summer daily 10:00 AM - 6:00 PM (check locally for current hours)",
    "hotel_labri": "Year-round (reservations recommended)",
    "bilingual_signs": "Throughout village (Icelandic-French)",
    "french_heritage_sites": "Hospital, chapel, graveyard accessible year-round",
    "french_cultural_events": "Summer season (June-August)",
    "population": "Approximately 750 residents"
  }
}