{
  "name": "Faxi",
  "description": "Faxi, also known as Faxafoss or Vatnsleysufoss, is a picturesque 7-meter-high and 80-meter-wide waterfall on the Tungufljót river in southern Iceland, located just 12 kilometers from the famous Geysir geothermal area along the Golden Circle route. Despite its proximity to Iceland's most popular tourist circuit, Faxi remains relatively undiscovered compared to its famous neighbors Gullfoss and Geysir, offering visitors a more peaceful waterfall experience without crowds. The waterfall drops over a broad basalt ledge in a graceful curtain of water, creating a serene cascade that spreads wide across the river rather than plunging dramatically like taller Icelandic waterfalls. The relatively gentle flow and accessible location make it an ideal family-friendly stop requiring minimal hiking effort. What distinguishes Faxi from most other Icelandic waterfalls is the presence of a functioning salmon ladder (fish ladder) on the left side of the cascade, constructed to facilitate salmon migration during their upstream journey to spawning grounds. This engineered structure consists of a series of ascending pools and small cascades that allow Atlantic salmon to bypass the 7-meter drop by swimming through progressively higher pools, demonstrating the remarkable determination of these fish to reach their ancestral breeding areas. During salmon season from late summer through early fall, typically August through September, visitors can witness salmon leaping through the ladder's pools in their instinctive drive to reproduce, providing a fascinating display of natural behavior and wildlife resilience. The waterfall's name Faxafoss derives from Old Norse, with \"faxi\" meaning \"mane,\" likely referring to the water's resemblance to a horse's flowing mane as it cascades over the rock face. The alternative name Vatnsleysufoss translates to \"Waterfall of Vatnsleysa,\" referring to the local area. Located just 104 kilometers from Reykjavík and a mere 5-minute detour from Route 35—the main road connecting Geysir to Selfoss—Faxi requires approximately 1 hour and 25 minutes to reach from the capital in clear conditions. From the Geysir geothermal area, visitors follow Route 35 south for 6 kilometers before turning onto a short access road leading to the waterfall parking area. Short walking paths from the parking lot lead to multiple viewing platforms offering different perspectives of the waterfall, salmon ladder, and surrounding landscape. The site includes a small café near the parking area serving light refreshments, though hours vary seasonally. While there is no entrance fee to view the waterfall itself, a small parking fee applies. The waterfall is accessible year-round, though winter visits may encounter icy paths requiring careful footing, and summer offers the best conditions for viewing salmon migration.",
  "address": "Route 35, 801 Selfoss, Iceland",
  "coordinates": {
    "longitude": -20.33725,
    "latitude": 64.22547,
    "altitude": 0.0
  },
  "rating": 4.5,
  "reviews_count": 2900,
  "category": "Waterfall",
  "website": "https://www.south.is/en/place/faxi-waterfall",
  "phone": null,
  "images": [
    {
      "source": "Visit South Iceland",
      "url": "https://www.south.is/en/place/faxi-waterfall"
    },
    {
      "source": "Guide to Iceland",
      "url": "https://guidetoiceland.is/travel-iceland/drive/faxi"
    }
  },
  "opening_hours": {
    "access": "Open 24/7 year-round",
    "parking_fee": "Small fee required (typically 500-700 ISK per vehicle)",
    "waterfall_viewing": "Free, no entrance fee beyond parking",
    "cafe": "Seasonal hours at on-site café, typically summer months only",
    "salmon_season": "Late August through September - best time to observe salmon migration",
    "salmon_ladder": "Visible on left side of waterfall, fish ladder aids upstream migration",
    "walking_distance": "Very short walk from parking to viewing platforms, family-friendly",
    "dimensions": "7 meters high, 80 meters wide, gentle cascade over basalt ledge",
    "alternative_names": "Faxafoss, Vatnsleysufoss (Waterfall of Vatnsleysa)",
    "distance_from_reykjavik": "104 km, approximately 1 hour 25 minutes drive",
    "distance_from_geysir": "12 km, 5-minute detour from Route 35",
    "golden_circle_extension": "Easy addition to Golden Circle route, less crowded than main attractions",
    "best_season": "Summer for salmon viewing and café access, accessible year-round with caution in winter"
  }
}
