{
  "name": "Foss á Síðu - The Blown Away Waterfall",
  "description": "Foss á Síðu is an elegantly slender waterfall that drops dramatically from high cliffs in South Iceland, creating one of the Ring Road's most photogenic roadside attractions despite being easily overlooked by travelers focused on the region's more famous cascades. Located just 10 kilometers east of Kirkjubæjarklaustur village along Route 1, this waterfall sees the narrow Fossá stream—fed from Lake Þórutjörn on the plateau above—plunging vertically down an ancient basalt cliff face that represents what was once Iceland's southern coastline approximately 10,000 years ago, before post-glacial land rebound and sediment deposition pushed the ocean farther south to its current position. The waterfall's height is variously reported as 30 meters, 80 meters, or 82 meters depending on whether measurements include the full cliff face or just the visible freefalling water column, but regardless of precise figures, the visual impact is unmistakable: a thin white ribbon of water dropping through open air down a sheer dark cliff into the green valley below. With a width of only about 3 meters (10 feet), Foss á Síðu represents the opposite of Iceland's massive curtain-like waterfalls—this is delicate verticality, a slender thread connecting the plateau above to the lowlands below. The waterfall has earned the nickname \"The Blown Away Waterfall\" due to a remarkable phenomenon that occurs during Iceland's frequent strong winds: when wind conditions are exactly right, particularly powerful gusts from certain directions can literally blow the falling water sideways or even upward, dispersing it into mist before it reaches the ground, causing the waterfall to temporarily \"disappear\" or spray dramatically across the cliff face rather than falling straight down. This spectacle delights visitors fortunate enough to witness it, turning the waterfall into a natural demonstration of wind power that few other falls can match. The cliff face from which Foss á Síðu descends features beautiful columnar basalt formations visible in the rock walls, geological structures formed when ancient lava flows cooled and contracted into hexagonal columns. Nearby, just a short distance along Route 1, visitors will find Dverghamrar (\"Dwarf Cliffs\"), remarkable basalt column formations that Icelandic folklore says house hidden people or dwarves, adding a mythological dimension to the area's geological wonders. Foss á Síðu is visible directly from the Ring Road, with a convenient pullout allowing travelers to stop, photograph, and admire the falls without hiking, though the viewing angle from the roadside is somewhat distant and side-on. For closer views and better photographic angles, a rough track leads toward the base of the waterfall, though this path is not officially maintained and can be muddy or challenging depending on conditions. The surrounding landscape epitomizes South Iceland's dramatic topography: steep cliffs and mountains rising abruptly from flat coastal plains, creating the visual contrast that makes this region so striking.",
  "address": "Route 1 (Ring Road), 10 km east of Kirkjubæjarklaustur, South Iceland",
  "coordinates": {
    "longitude": -17.9217,
    "latitude": 63.8033,
    "altitude": 80.0
  },
  "rating": 4.4,
  "reviews_count": 1150,
  "category": "Waterfall",
  "website": "https://www.south.is/en/foss-a-sidu",
  "phone": null,
  "images": [
    "https://www.south.is/images/foss-a-sidu-cliff.jpg"
  ],
  "opening_hours": {
    "access": "Year-round (visible from Ring Road)",
    "parking": "Pullout on Route 1",
    "admission": "Free",
    "viewing": "Roadside view or rough track to base (unofficial)",
    "height": "30-82 meters (sources vary)",
    "width": "3 meters (10 feet)",
    "wind_phenomenon": "Strong winds can blow water sideways or upward",
    "nearby": "Dverghamrar basalt cliffs (a few km east)",
    "historical_note": "Cliff represents Iceland's ancient coastline (10,000 years ago)"
  }
}
