{
  "name": "Garðabær - Upscale Residential Suburb",
  "description": "Garðabær establishes Greater Reykjavík's affluent residential municipality positioned southeast capital where approximately 16,000 residents inhabit well-planned suburban neighborhoods characterized higher-than-average incomes modern housing developments excellent schools creating desirable family-oriented community attracting professionals seeking quality living environments convenient capital access while maintaining quiet residential character distinguished from busier urban Reykjavík Kópavogur municipalities preserving small-town atmosphere metropolitan context. Álftanes Peninsula extends Garðabær's western boundary hosting Bessastaðir presidential residence Iceland's head state official home where historic 18th-century church adjacent white manor house create picturesque waterfront setting though public access limited security considerations preventing casual tourism though nearby walking paths coastal areas enable viewing historic buildings distance respecting governmental security requirements while appreciating architectural heritage coastal landscapes characteristic southwestern Iceland shorelines. Vífilsstaðavatn lake provides central recreational focus where walking paths cycling trails circumnavigate freshwater body creating popular outdoor exercise destination local residents while summer swimming activities complement year-round trail usage establishing community gathering space natural amenity enhancing residential appeal beyond purely housing orientations typical bedroom community developments demonstrating successful integration natural features urban planning creating livable sustainable community character.",
  "address": "Garðabær, 210 Capital Region, Iceland (southeast of Reykjavík)",
  "coordinates": {
    "longitude": -21.9272,
    "latitude": 64.0894,
    "altitude": 18.0
  },
  "rating": 4.3,
  "reviews_count": 2890,
  "category": "Town - Capital Region",
  "website": "https://gardabaer.is/en",
  "phone": "+354 525 8500",
  "images": [
    "https://visitreykjavik.is/images/gardabaer.jpg"
  ],
  "opening_hours": {
    "population": "~16,000",
    "location": "Southeast of Reykjavík, includes Álftanes Peninsula",
    "bessastadir": "Presidential residence on Álftanes (limited public access)",
    "vifilsstadavatn": "Lake with walking/cycling paths",
    "gardatorg": "Town center, Hagkaup, restaurants",
    "asvallalaug": "Swimming pool complex",
    "character": "Affluent residential, family-oriented, quiet suburban"
  }
}