{
  "name": "Geitafoss - The Goats' Waterfall",
  "description": "Geitafoss, translating to \"Goats' Falls,\" is a modest but charming 5-meter waterfall on the powerful Skjálfandafljót river in North Iceland, located in close proximity to the much more famous Goðafoss (Waterfall of the Gods) along the Diamond Circle route. The waterfall's unassuming name derives from local farming history—a farmer who drove his sheep and goats through this area gave the falls its name, reflecting the pastoral traditions that have characterized this region for centuries. Despite its relatively small size compared to Iceland's towering cascades, Geitafoss holds biological significance as the upper limit for salmon migration on the Skjálfandafljót river: salmon swim upstream from the ocean through various obstacles and reaches as far as this waterfall, but the 5-meter drop proves too high for even the most determined fish to leap, making Geitafoss the natural boundary that separates the lower river's salmon-bearing waters from the upper river's salmon-free sections. This ecological role makes the waterfall interesting to anglers and fish biologists studying Iceland's Atlantic salmon populations and their spawning behaviors. Geitafoss's location on the same river as Goðafoss means visitors can experience both waterfalls in a single excursion, with Geitafoss offering a quieter, less crowded alternative to its famous downstream neighbor. Access to Geitafoss is possible via footbridge crossing the river, or by driving to the designated parking area (numbered 883) near Goðafoss and following paths to the falls, though the exact route may vary and local signage should be followed. While descriptions note that Geitafoss is \"not as beautiful as Goðafoss,\" this undersells its appeal—the waterfall's intimate scale, the opportunity to view it from multiple angles including from below via steep ladders on the west side, and the chance to experience a waterfall without tourist crowds make it a worthwhile destination for those who appreciate Iceland's lesser-known natural features. The Skjálfandafljót river at Geitafoss flows with characteristic glacial milkiness and substantial power despite the waterfall's modest height, with churning water creating constant spray and sound. The surrounding landscape features typical North Iceland scenery: lava fields, mountains in the distance, hardy vegetation, and the sense of geological forces still actively shaping the terrain. The Diamond Circle route that passes near Geitafoss connects several of North Iceland's premier attractions including Dettifoss (Europe's most powerful waterfall), Ásbyrgi canyon, Húsavík (whale watching capital), Lake Mývatn and its geothermal areas, and of course Goðafoss, making Geitafoss a bonus stop for those exploring this less-traveled alternative to the more famous Golden Circle in the south.",
  "address": "Skjálfandafljót River, near Goðafoss, North Iceland (off Diamond Circle route)",
  "coordinates": {
    "longitude": -17.5500,
    "latitude": 65.6833,
    "altitude": 140.0
  },
  "rating": 4.2,
  "reviews_count": 650,
  "category": "Waterfall",
  "website": "https://www.northiceland.is/en/geitafoss",
  "phone": null,
  "images": [
    "https://www.northiceland.is/images/geitafoss-river.jpg"
  ],
  "opening_hours": {
    "access": "Year-round (easier in summer)",
    "access_methods": "Footbridge or from parking area 883 near Goðafoss",
    "view_from_below": "Steep ladder on west side (caution required)",
    "admission": "Free",
    "height": "5 meters",
    "ecological_note": "Upper limit of salmon migration on Skjálfandafljót river",
    "nearby": "Goðafoss waterfall (more famous, nearby)",
    "route": "Diamond Circle in North Iceland"
  }
}
