{
  "name": "Glaumbær Farm & Turf House Museum",
  "description": "Glaumbær Farm stands as one of Iceland's best-preserved and most authentic turf farmsteads, offering visitors an immersive experience of traditional Icelandic rural life through 13 interconnected turf buildings that housed multiple generations of farming families from the 18th century until the last residents departed in 1947, when the farm was designated a national heritage site and transformed into the centerpiece of the Skagafjörður Heritage Museum. Located in the fertile Skagafjörður valley in North Iceland, Glaumbær exemplifies the distinctive Icelandic architectural tradition of turf construction that developed over centuries as an ingenious adaptation to Iceland's harsh climate, scarcity of timber, and abundance of turf—the sod and soil held together by grass roots that, when stacked in thick walls and covered with grass roofs, provided excellent insulation against brutal winters while remaining affordable for even modest farming families. The Glaumbær complex demonstrates the classic Icelandic turf farm layout where individual buildings—dwelling rooms, pantries, storage areas, workrooms, and even a dairy—connect via a central passageway, allowing residents to move between spaces without venturing into harsh weather.",
  "address": "Glaumbær, 551 Sauðárkrókur, Skagafjörður, North Iceland",
  "coordinates": {
    "longitude": -19.4833,
    "latitude": 65.6167,
    "altitude": 25.0
  },
  "rating": 4.7,
  "reviews_count": 1950,
  "category": "Museum",
  "website": "https://www.glaumbaer.is/en",
  "phone": "+354 453 6173",
  "images": [
    "https://www.glaumbaer.is/images/turf-houses-exterior.jpg"
  ],
  "opening_hours": {
    "high_season": "Daily 10:00 AM - 6:00 PM",
    "spring_autumn": "Weekdays 10:00 AM - 4:00 PM (Sept 21-Oct 20, April 1-May 19)",
    "winter": "By request (Oct 21-March 31)",
    "admission_adults": "2,000 ISK",
    "admission_seniors_students": "1,700 ISK",
    "admission_children": "Free (under 17)",
    "combined_ticket": "Available with Víðimýri Turf Church",
    "buildings": "13 interconnected turf structures",
    "last_residents": "1947 (then designated national heritage site)",
    "cafe": "Áshús timber house (1884-86) serves traditional pastries & soup",
    "group_booking": "byggdasafn@skagafjordur.is or +354 453 6173 (2 days advance)"
  }
}