{
  "name": "Gluggafoss - The Window Waterfall",
  "description": "Gluggafoss, translating to \"Window Falls\" or \"Window Waterfall,\" is one of South Iceland's most geologically fascinating and photogenic cascades, named for the remarkable series of openings—natural \"windows\"—carved through the soft volcanic rock through which the water flows and can be glimpsed from various angles. Located approximately 117 kilometers from Reykjavík and about 20 kilometers from the village of Hvolsvöllur along Route 261, Gluggafoss presents a unique two-tier structure where the Merkjá river has carved a dramatic channel through a hill composed of different volcanic materials. The upper portion of the waterfall drops 44 meters through a narrow vertical recess cut into soft palagonite (volcanic tuff), while the lower section spreads across a broader basalt ledge and falls an additional 8.5 meters in three main channels, creating a total drop of over 50 meters. The distinctive \"windows\" that give the waterfall its name formed over thousands of years as the soft palagonite rock eroded unevenly, creating natural tunnels, arches, and openings through which the cascading water can be seen from multiple viewpoints. Historically, the waterfall looked quite different—in 1947, the upper falls were completely hidden, with water flowing through a vertical tunnel behind the cliff and emerging only through the bottom window in a beautiful arch formation. Over subsequent decades, erosion has continued to work on the soft rock, collapsing sections of the tunnel and revealing more of the waterfall's internal structure, creating the current configuration of multiple visible cascades and windows. This ongoing geological evolution means Gluggafoss's appearance continues to change gradually, making it a living demonstration of erosion processes. The contrast between the soft, eroding palagonite in the upper cliff face and the harder, more resistant basalt in the lower ledge illustrates the layered nature of Icelandic volcanic geology, where different types of volcanic materials from various eruptions stack atop each other. Visitors can approach quite close to the base of the falls, where spray creates lush vegetation and often rainbows in sunny conditions. Multiple trails and viewpoints allow exploration from different angles, including views through the windows from various positions. The surrounding area features additional smaller cascades, moss-covered rocks, and the characteristic South Iceland landscape of green farmland backed by mountains. Access is straightforward: from Hvolsvöllur on the Ring Road, drive approximately 15 kilometers along paved Route 261 to a marked parking area, from which a short walk leads to the waterfall viewing areas. The proximity to both the Ring Road and popular south coast attractions like Seljalandsfoss makes Gluggafoss an excellent addition to a South Iceland itinerary, though its location slightly off the main tourist corridor means it remains quieter than its more famous neighbors.",
  "address": "Route 261, near Hvolsvöllur, South Iceland",
  "coordinates": {
    "longitude": -20.2167,
    "latitude": 63.7833,
    "altitude": 90.0
  },
  "rating": 4.6,
  "reviews_count": 1580,
  "category": "Waterfall",
  "website": "https://www.south.is/en/gluggafoss",
  "phone": null,
  "images": [
    "https://www.south.is/images/gluggafoss-windows.jpg"
  ],
  "opening_hours": {
    "access": "Year-round (paved road)",
    "road": "Route 1 → Route 261 from Hvolsvöllur (15 km / 9 miles)",
    "parking": "Marked parking area near waterfall",
    "admission": "Free",
    "walk_duration": "Short walk from parking to viewpoints",
    "distance_from_reykjavik": "117 km (approximately 1.5 hours)",
    "total_height": "52.5 meters (44m upper + 8.5m lower)",
    "unique_feature": "Natural windows carved through soft palagonite rock"
  }
}
