{
  "name": "Grafarvogslaug - Tranquil Pool in Northeast Reykjavík",
  "description": "Grafarvogslaug serves the Grafarvogur neighborhood in northeastern Reykjavík with a comprehensive swimming facility that combines indoor and outdoor pools, multiple hot tubs, modern infrared sauna technology, and family-friendly features within a community-focused environment that residents describe as particularly tranquil and welcoming compared to busier central city pools. Located in Grafarvogur—a primarily residential district developed from the 1980s onward to accommodate Reykjavík's growing population—the pool functions as a vital neighborhood gathering place where local families bring children for swimming lessons and play, elderly residents maintain health through gentle aquatic exercise, and neighbors encounter each other in the hot tubs where Iceland's famous pot chat tradition creates the nation's most democratic social forum. The facility's dual pool system provides options for different preferences: an outdoor pool allows traditional Icelandic year-round swimming where geothermal heating maintains comfortable water temperature even as swimmers breathe cold air and watch steam rise around them—an experience uniquely Icelandic and surprisingly addictive to those who try it; an indoor pool offers sheltered swimming preferred during particularly harsh weather or by those sensitive to cold, ensuring that swimming remains accessible regardless of conditions. A dedicated children's pool and separate paddling pool provide safe.",
  "address": "Dalhús 2, 112 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.8347,
    "latitude": 64.1503,
    "altitude": 22.0
  },
  "rating": 4.7,
  "reviews_count": 1190,
  "category": "Swimming Pool",
  "website": "https://reykjavik.is/en/grafarvogslaug-pool",
  "phone": "+354 411 5300",
  "images": [
    "https://reykjavik.is/sites/default/files/grafarvogslaug-pool.jpg"
  ],
  "opening_hours": {
    "weekdays": "Monday-Friday 6:30 AM - 10:00 PM",
    "weekends": "Saturday-Sunday 9:00 AM - 9:00 PM",
    "outdoor_pool": "Outdoor pool with year-round geothermal heating",
    "indoor_pool": "Indoor pool for sheltered swimming",
    "children_facilities": "Children's pool, paddling pool, 2 waterslides (main + children's)",
    "hot_tubs": "3 hot tubs",
    "wellness": "Steam bath, infrared sauna",
    "features": "Clean facilities, tranquil atmosphere, family-friendly",
    "neighborhood": "Grafarvogur, Northeast Reykjavík residential area",
    "character": "Quieter neighborhood pool with authentic local atmosphere",
    "reviews": "Praised for cleanliness, community feel, less crowded than central pools"
  }
}