{
  "name": "Grillmarkaðurinn - The Grill Market",
  "description": "Grillmarkaðurinn (The Grill Market) stands as one of Reykjavík's premier upscale dining destinations, showcasing Iceland's extraordinary natural bounty through wood-fired cooking methods and open-grill techniques that create distinctive smoky flavors while celebrating the exceptional quality of Icelandic ingredients ranging from conventional lamb and seafood to adventurous options like reindeer, puffin, and whale that reflect Iceland's unique culinary traditions and relationship with its environment. Located at Lækjargata 2a in Reykjavík's city center, the restaurant occupies a beautifully designed space that embodies Icelandic aesthetic principles through extensive use of natural materials—volcanic rock walls, driftwood elements, and minimalist Scandinavian design create an atmosphere that feels simultaneously sophisticated and grounded in Iceland's rugged landscape. The restaurant's name directly references both its cooking methodology (grilling over open flames and wood fire) and its market-inspired philosophy of sourcing the freshest possible ingredients from Iceland's farmers, fishermen, and foragers who supply produce, meat, and seafood at peak quality. The open grill visible from dining areas allows guests to watch chefs work with primal cooking techniques—fire, smoke, and skilled timing—that connect modern fine dining to ancestral food preparation methods used by Vikings and earlier inhabitants. The menu features Icelandic lamb raised on highland pastures where sheep roam freely eating wild grasses and herbs that impart distinctive flavor; Atlantic seafood caught in some of the world's richest fishing grounds; and adventurous proteins like reindeer (wild herds roaming East Iceland), puffin (seabirds traditionally eaten in coastal communities), and whale (controversial but legal and part of Icelandic culinary heritage)—these unusual proteins offer international visitors authentic tastes of traditional Icelandic diet while sparking discussions about food ethics, cultural traditions, and conservation. The tasting menu (9,900 ISK, approximately $72 USD) contains some of the restaurant's best and most popular courses, providing a curated journey through Icelandic flavors and cooking techniques that showcase the kitchen's range and creativity. À la carte options allow diners to customize their experience, with dishes ranging from approximately 1,690-1,990 ISK for sides and appetizers, though main courses command higher prices reflecting premium ingredients and upscale preparation. The restaurant operates dinner service Sunday-Thursday with last reservations at 21:30 and Friday-Saturday with last reservations at 22:00, starting at 17:30 (5:30 PM) all days. During December (December 5-23), lunch service operates Monday-Friday 11:30-14:00, providing midday dining opportunities during the holiday season when tourists visit for Christmas markets and winter activities. The bar on the lower floor opens at 17:00 and continues serving until closing time, offering craft cocktails, Icelandic beers, and international wines that complement the grilled cuisine. Reservations are highly recommended, particularly on weekends when the restaurant's popularity and reputation create high demand—walk-ins may face extended waits or inability to secure tables. The combination of central location, beautiful design incorporating Icelandic natural materials, exceptional ingredient quality, distinctive wood-fired cooking, and menu featuring both familiar and adventurous proteins makes Grillmarkaðurinn a special-occasion destination for both visitors seeking authentic Icelandic fine dining and locals celebrating important events.",
  "address": "Lækjargata 2a, 101 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9325,
    "latitude": 64.1472,
    "altitude": 5.0
  },
  "rating": 4.5,
  "reviews_count": 3890,
  "category": "Restaurant",
  "website": "https://grillmarkadurinn.is/en",
  "phone": "+354 571 7777",
  "images": [
    "https://grillmarkadurinn.is/images/interior-volcanic-rock.jpg"
  ],
  "opening_hours": {
    "dinner_sun_thu": "17:30 - 21:30 (last reservation)",
    "dinner_fri_sat": "17:30 - 22:00 (last reservation)",
    "lunch_december": "11:30 - 14:00 Monday-Friday (Dec 5-23 only)",
    "bar": "17:00 until closing (lower floor)",
    "reservations": "Highly recommended, especially weekends",
    "cuisine": "Icelandic, wood-fired grill, open flame cooking",
    "specialties": "Lamb, seafood, reindeer, puffin, whale",
    "cooking_method": "Open grill, wood-fired, smoky flavors",
    "tasting_menu": "9,900 ISK (~$72 USD) - best and most popular courses",
    "appetizers_sides": "1,690-1,990 ISK range",
    "price_level": "Upscale, special occasion dining",
    "design": "Natural materials, volcanic rock walls, driftwood, Scandinavian minimalism",
    "philosophy": "Market-inspired freshest ingredients from Icelandic producers",
    "adventurous_proteins": "Reindeer (East Iceland wild herds), puffin (traditional seabird), whale (cultural heritage)",
    "conventional_proteins": "Icelandic lamb from highland pastures, Atlantic seafood",
    "bar_offerings": "Craft cocktails, Icelandic beers, international wines",
    "location": "Lækjargata city center, convenient downtown location",
    "atmosphere": "Sophisticated yet grounded in Icelandic rugged landscape",
    "viewing": "Open grill visible from dining areas"
  }
}
