{
  "name": "Grjótagjá",
  "description": "Grjótagjá is a small but visually striking lava cave containing a geothermal hot spring located near Lake Mývatn in North Iceland, situated on private land at the Vogar farm. The cave formed thousands of years ago when molten lava flowing through an underground tube drained away, leaving behind a hollow tunnel that subsequently filled with naturally heated groundwater from geothermal activity in the Krafla volcanic system. The cave features a narrow opening descending into a dimly lit chamber where steaming turquoise water glows ethereally in shafts of light penetrating through cracks in the volcanic rock ceiling. For centuries, Grjótagjá served as a popular natural bathing spot for locals who enjoyed soaking in the warm waters within the atmospheric cave setting, though the water temperature varied considerably depending on geothermal fluctuations. Between 1975 and 1984, intense volcanic activity from nearby Krafla superheated the spring to dangerously scalding temperatures approaching or exceeding boiling point, making bathing impossible and forcing the cave's closure. Although geothermal activity has since decreased and water temperatures have dropped to approximately 43-46°C (109-115°F) in recent years, the spring remains unpredictable, sometimes spiking above 50°C (122°F) due to ongoing geothermal processes. Due to these dangerous temperature fluctuations and the risk of sudden temperature increases, bathing in Grjótagjá has been permanently prohibited.",
  "address": "Grjótagjá, Vogar, 660 Mývatn, Iceland",
  "coordinates": {
    "longitude": -16.8814,
    "latitude": 65.6309,
    "altitude": 0.0
  },
  "rating": 4.3,
  "reviews_count": 4100,
  "category": "Cave",
  "website": "https://www.visitmyvatn.is",
  "phone": null,
  "images": [
    "https://www.visitmyvatn.is",
    "https://guidetoiceland.is/travel-iceland/drive/grjotagja"
  ],
  "opening_hours": {
    "viewing_access": "Viewable from outside 24/7 year-round, viewing and photography permitted from entrance",
    "bathing_status": "BATHING STRICTLY PROHIBITED - Cave entry forbidden due to dangerous temperature fluctuations",
    "water_temperature": "43-46°C (109-115°F) typically, unpredictable spikes above 50°C (122°F) possible",
    "historical_temperatures": "1975-1984 Krafla eruptions superheated water to near-boiling, making bathing impossible",
    "safety_warning": "DO NOT enter cave or touch water - temperatures unpredictable and potentially scalding",
    "private_property": "Located on Vogar farm private land, gate and prohibition signs installed by landowners",
    "enforcement": "Gate may not always be locked but entry prohibition legally binding - respect closure",
    "game_of_thrones": "Season 3 Episode 5 filming location - Jon Snow and Ygritte cave scene",
    "filming_note": "Bathing scene filmed before current prohibition with controlled temperatures for actor safety",
    "alternative_bathing": "Visit Mývatn Nature Baths (1.5 km away) for legal, safe geothermal bathing with facilities",
    "cave_formation": "Lava tube cave formed when molten lava drained, later filled with geothermal spring water",
    "visual_features": "Narrow opening, dimly lit chamber, luminous turquoise water, steam, light shafts through rock ceiling",
    "parking": "Small parking area near cave, short walk from Route 1",
    "distance_from_akureyri": "Approximately 90 km east",
    "diamond_circle": "Located near Lake Mývatn on Diamond Circle route"
  }
}
