{
  "name": "Gullfoss",
  "description": "Gullfoss, meaning \"Golden Falls\" in Icelandic, is one of Iceland's most iconic and visited waterfalls, located in the canyon of the Hvítá river in southwest Iceland. The waterfall is approximately 105 kilometers from Reykjavík and forms a key part of the famous Golden Circle tourist route. Fed by meltwater from the Langjökull glacier, the powerful Hvítá river cascades in two dramatic stages: first dropping 11 meters, then plunging an additional 21 meters into a rugged 2.5-kilometer-long canyon, creating a total drop of 32 meters. On sunny days, the mist from the falls creates beautiful rainbows, while in winter, the waterfall partially freezes into stunning ice formations. The waterfall's immense power is particularly impressive during summer meltwater season when approximately 140 cubic meters of water per second thunders over the edge. Gullfoss was nearly lost to hydroelectric development in the early 20th century but was saved through the determined efforts of Sigríður Tómasdóttir, daughter of the landowner, who threatened to throw herself into the falls in protest. Today, viewing platforms on both the upper and lower levels allow visitors to safely experience the waterfall's raw power and beauty from multiple angles.",
  "address": "Gullfoss Parking, 846, Iceland",
  "coordinates": {
    "longitude": -20.1199478,
    "latitude": 64.3270716,
    "altitude": 0.0
  },
  "rating": null,
  "reviews_count": null,
  "category": "Waterfall",
  "website": "https://guidetoiceland.is/book-holiday-trips/river-rafting-in-gullfoss-canyon",
  "phone": null,
  "images": [
    {
      "source": "Google My Maps",
      "url": "https://mymaps.usercontent.google.com/hostedimage/m/*/3AKcrxGRJgBu6oJv42bgt-Rb9pe_AfhyeI8c0wK9_sHekg3nyb1Z676i_zSeGYyB5Q-coQVbqRSXgoYI_uMCo1MUDKBY_44oJGPFESZFH0EXwUCQLkOZtxL_PPEms20L9porrZmm1V4K5YvfkJR0baStCsmzRw79uqTAJD4h6finIeQjse4WcUKRJK7kucQPINbkpctEnHCY?authuser=0&fife=s16383"
    },
    {
      "source": "Google My Maps",
      "url": "https://mymaps.usercontent.google.com/hostedimage/m/*/3AKcrxGTNFtvIPW60LdB_oM6ue9OwVwDj4Cd-L741q_-nwk8E94EINYRTqLfqWWkWHEvWSgnF9wE3V70blynJ8cHLZvWzLXgqdEFE0eT7GdGYCF-1ydKzA9GKHt4SDoFkOPR-zy2yDBMqt-di4268WmZxjVOeM0Yp_pz-ITMJS39gaJ3_OHs2MRyQ6d8IkCC_rZimSXO6vsA?authuser=0&fife=s16383"
    }
  ],
  "opening_hours": {
    "all_year": "Open 24/7 (waterfall and viewing platform)",
    "visitor_center": "Typically 09:30 - 19:00 (hours may vary seasonally)"
  }
}
