{
  "name": "Gunnuhver - Iceland's Largest Mud Pool",
  "description": "Gunnuhver establishes Iceland's largest most powerful mud pool geothermal area Reykjanes Peninsula southwestern tip where violently bubbling mud pools powerful steam vents fumaroles eject superheated steam columns reaching 10-20 meters high creating spectacular geothermal display where temperatures reach approximately 300 degrees Celsius establishing one Iceland's hottest most dramatic geothermal sites demonstrating raw volcanic power Mid-Atlantic Ridge location. Named Gunna female ghost Icelandic folklore allegedly trapped hot springs 17th-century priest where spirit powers fierce geothermal activity creating cultural mythology enhancing natural phenomenon establishing multidimensional narrative combining geology folklore establishing richer tourism interpretation beyond purely scientific geological explanation. Geothermal field covers several hectares steaming barren landscape painted vibrant yellow orange white sulfur silica deposits creating visually stunning chromatic displays where dynamic activity constantly changes new vents opening others closing mud pools shifting locations steam intensity varying creating ever-evolving landscape defying static expectations demonstrating living geological processes ongoing volcanic activity. Reykjanes volcanic system Mid-Atlantic Ridge location drives intense geothermal activity where underground heat powers Svartsengi geothermal power station supplying Blue Lagoon Reykjanes power station establishing dual nature tourism energy production demonstrating geothermal Iceland's practical energy infrastructure beyond purely tourist attractions. Well-maintained wooden boardwalks elevated viewing platforms enable safe observation multiple vantage points where 15-20 minute circuit leisurely pace provides comprehensive geothermal experience though exposed Atlantic location creates powerful winds dispersing steam dramatically revealing boiling mud creating dynamic viewing conditions requiring weather preparedness flexible visitor approach.",
  "address": "Route 425, near Reykjanesviti, 240 Grindavik, Reykjanes Peninsula",
  "coordinates": {
    "longitude": -22.3042,
    "latitude": 63.8201,
    "altitude": 20.0
  },
  "rating": 4.7,
  "reviews_count": 8900,
  "category": "Geothermal Area",
  "website": "https://www.reykjanes.is/gunnuhver",
  "phone": null,
  "images": [
    "https://www.reykjanes.is/images/gunnuhver.jpg"
  ],
  "opening_hours": {
    "access": "Year-round, 24/7",
    "circuit_time": "15-20 minutes",
    "from_reykjavik": "40 minutes drive",
    "from_grindavik": "20 minutes",
    "safety": "Stay on boardwalks, steam can shift suddenly with wind",
    "character": "Largest mud pool, powerful steam vents, folklore, Atlantic winds"
  }
}
