{
  "name": "Háifoss - The High Waterfall",
  "description": "Háifoss, whose name translates literally to \"High Waterfall\" or \"Tall Waterfall,\" lives up to its designation as one of Iceland's most impressive waterfalls, plunging 122 meters (400 feet) from the edge of a dramatic cliff into the remote Fossárdalur valley in South Iceland's highlands. This spectacular cascade ranks among Iceland's tallest waterfalls—listed variously as the third or fourth highest in the country depending on how seasonal waterfalls and glacier waterfalls are counted—and offers visitors one of the most breathtaking waterfall viewing experiences in all of Iceland. Háifoss is fed by the Fossá river, which drops vertically over a sheer cliff face in a single powerful column of white water that creates a constant mist and thundering roar audible from the viewpoint across the canyon. What makes Háifoss particularly special is not just its impressive height but its dramatic setting: the waterfall is framed by steep canyon walls of layered volcanic rock in shades of brown, red, and black, creating a stark, almost otherworldly landscape that epitomizes Iceland's volcanic origins. The viewing area sits on the opposite side of the narrow canyon, providing an unobstructed frontal view of the entire waterfall from top to bottom, with the added visual bonus of Granni, a companion waterfall of similar height, visible adjacent to Háifoss—though Granni's water flow is seasonal and often reduced to a thin ribbon or absent entirely during dry periods.",
  "address": "Fossárdalur Valley, Þjórsárdalur, South Iceland",
  "coordinates": {
    "longitude": -19.6833,
    "latitude": 64.1833,
    "altitude": 280.0
  },
  "rating": 4.8,
  "reviews_count": 2680,
  "category": "Waterfall",
  "website": "https://www.south.is/en/haifoss",
  "phone": null,
  "images": [
    "https://www.south.is/images/haifoss-canyon.jpg"
  ],
  "opening_hours": {
    "access_season": "Mid-June to September recommended (F-roads closed in winter)",
    "road": "Route F208 + Road 332 (4x4 required for final section)",
    "admission": "Free",
    "facilities": "Parking area, no services or toilets",
    "drive_from_ring_road": "1-1.5 hours (approximately 50 km)",
    "nearby_gjain": "5 km detour from Road 332 (highly recommended)",
    "height": "122 meters (400 feet)",
    "ranking": "3rd or 4th tallest waterfall in Iceland"
  }
}