{
  "name": "Helgafell (Snæfellsnes)",
  "description": "Helgafell is a 73-meter sacred mountain located on the Snæfellsnes Peninsula near the town of Stykkishólmur in West Iceland. Despite its modest height, Helgafell holds immense significance in Icelandic history and culture, featuring prominently in the Eyrbyggja Saga as a holy mountain where the chieftain Þórólfur Mostrarskegg established Iceland's first temple. The mountain was considered so sacred that in pagan times, no one was allowed to look at it unwashed, and no living creature could be harmed on its slopes. According to legend, wishes made at the summit will be granted if certain conditions are met: the climber must ascend in silence without looking back and make three wishes facing east while remaining silent on the descent.\n\nThe mountain offers an easy hike accessible to visitors of all ages and fitness levels. A well-maintained path leads to the summit in just 15-20 minutes, making it one of Iceland's most accessible viewpoints. From the top, visitors enjoy panoramic views across Breiðafjörður bay with its countless islands, the town of Stykkishólmur, and on clear days, the distant Westfjords. The summit features a small stone cairn and offers peaceful surroundings ideal for contemplation. The mountain's relatively modest elevation belies its dramatic visual impact, rising sharply from the surrounding flat terrain and farmland. Archaeological excavations have uncovered evidence of ancient burials and religious activity, confirming the mountain's long-standing spiritual importance in Icelandic culture.\n\nHelgafell is located approximately 5 kilometers south of Stykkishólmur, easily accessible via Route 56. A parking area at the mountain's base provides convenient access to the trail. The site is free to visit and accessible year-round, though winter conditions can make the path icy. The short, easy hike makes Helgafell an excellent choice for families, those with limited time, or visitors seeking a gentle introduction to Icelandic hiking. Many visitors observe the traditional wish-making ritual, whether for cultural interest or genuine spiritual practice. The mountain can be combined with visits to Stykkishólmur's attractions including the Norwegian House museum and the distinctive modern church.",
  "category": "Mountain",
  "coordinates": {
    "latitude": 64.910556,
    "longitude": -22.761944,
    "altitude": 73.0
  },
  "rating": 4.6,
  "reviews_count": 680,
  "opening_hours": "Open 24/7 (easy 15-20 minute hike)"
}
