{
  "name": "Herring Era Museum - Iceland's Atlantic Klondike",
  "description": "The Herring Era Museum in Siglufjörður stands as Iceland's largest maritime museum and the nation's only museum to have won the prestigious European Museum Award (in 2000), occupying a remarkably authentic setting in the old Róaldsbrakki salting station that was abandoned after the catastrophic collapse of the herring stock in 1969, preserving the infrastructure, atmosphere, and spirit of an industry that once provided up to 44% of Iceland's export income and transformed Siglufjörður into the \"Atlantic Klondike\"—a boom town where fortunes were made and lost as quickly as the herring came and went. The museum's extraordinary success in preservation and presentation stems from its use of actual working buildings rather than purpose-built exhibition spaces: visitors walk through genuine fish processing facilities, workers' quarters, and storage areas where the herring industry operated at its peak, with machinery, tools, and equipment left largely in place, creating an immersive time-capsule experience that brings history to life with almost overwhelming authenticity. The exhibitions spread across three different historic buildings, each focusing on different aspects of herring fishing and processing: the first building details the fishing itself, with restored boats, nets, and equipment demonstrating how crews went to sea in often-dangerous conditions chasing the massive herring schools that migrated through Icelandic waters; the second building showcases the processing side, with salting stations, barrels, and factory equipment revealing the labor-intensive work of preserving fish for export to markets across Europe and beyond; the third building explores the social history, documenting how the seasonal herring fishery created a unique culture where thousands of workers descended on small coastal towns each summer, creating temporary cities of workers' barracks, saloons, stores, and all the infrastructure needed to support an itinerant workforce. At its peak in the 1940s-1960s, Siglufjörður's population swelled from a few hundred permanent residents to over 10,000 during herring season, with round-the-clock activity as boats unloaded catches, workers processed fish, and the smell of herring and salt permeated everything. The museum preserves this frenetic energy through photographs, personal testimonies, and recreated scenes showing the backbreaking work that women, men, and even children performed during these intense seasonal campaigns. The herring's sudden disappearance in 1969—caused by overfishing and environmental changes—devastated Iceland's north coast, forcing economic diversification and leaving ghost towns and abandoned facilities like Róaldsbrakki as monuments to boom-and-bust resource exploitation. The museum treats this history with nuance, celebrating the ingenuity and hard work of the herring era while acknowledging the unsustainability that led to collapse. Interactive elements include opportunities to try salting techniques, listen to folk songs from the herring era, and explore how herring fishing shaped Icelandic language, cuisine, and culture in ways still evident today. The museum's European Museum Award recognized not just its collection but its innovative approach to industrial heritage preservation and its success in telling compelling human stories through material culture.",
  "address": "Snorragata, 580 Siglufjörður, North Iceland",
  "coordinates": {
    "longitude": -18.9167,
    "latitude": 66.1500,
    "altitude": 5.0
  },
  "rating": 4.7,
  "reviews_count": 1680,
  "category": "Museum",
  "website": "http://www.sild.is/en",
  "phone": "+354 467 1604",
  "images": [
    "https://www.sild.is/images/roaldsbrakki-salting-station.jpg"
  ],
  "opening_hours": {
    "june_august": "10:00 AM - 5:00 PM (or 6:00 PM)",
    "may_september": "1:00 PM - 5:00 PM",
    "winter": "By appointment",
    "admission_adults": "2,200 ISK",
    "admission_seniors_youth": "1,200 ISK (seniors and under 20)",
    "admission_children": "Free (under 16 with adults)",
    "group_rate": "1,800 ISK (10 or more)",
    "award": "European Museum Award (2000)",
    "three_buildings": "Fishing, processing, and social history exhibits",
    "opened": "1994 in Róaldsbrakki salting station"
  }
}
