{
  "name": "Hjörleifshöfði",
  "description": "Hjörleifshöfði is a dramatic 221-meter-high palagonite inselberg rising from the vast black sand expanse of Mýrdalssandur outwash plain in southern Iceland, approximately 15 kilometers east of Vík. This enormous rock formation, formed during a subglacial volcanic eruption beneath an ice age glacier, stands as a solitary geological monument on the barren coastal plain between the village of Vík and the Atlantic Ocean. The promontory holds profound significance in Icelandic history as the landing site and namesake of Hjörleifur Hróðmarsson, the blood brother of Ingólfur Arnarson, Iceland's first permanent Viking settler who arrived around 874 AD. According to the Landnámabók (Book of Settlement), Hjörleifur established his homestead at this location in 874 AD but was tragically betrayed and murdered by his Irish slaves in 875 AD, just one year after arriving in Iceland. The slaves subsequently fled to the Westman Islands, where Ingólfur later tracked them down and killed them in revenge for his foster brother's death. On the summit of Hjörleifshöfði stands Hjörleifshaugur, the burial mound of Hjörleifur himself, marking over 1,100 years of Icelandic settlement history. The promontory's southern cliffs, facing the Atlantic Ocean, host important seabird colonies including puffins and auks, making it a popular bird-watching destination during nesting season from May through August. The most famous feature is Gígjagjá, popularly known as Yoda Cave, a massive 20 to 30-meter-high cavern carved into the southern palagonite cliffs.",
  "address": "Hjörleifshöfði, 871 Vík, Iceland",
  "coordinates": {
    "longitude": -18.7828,
    "latitude": 63.4203,
    "altitude": 221.0
  },
  "rating": 4.5,
  "reviews_count": 2800,
  "category": "Historic Site",
  "website": "https://www.south.is/en/place/hjorleifshofdi",
  "phone": null,
  "images": [
    {
      "source": "Wikimedia Commons",
      "url": "https://commons.wikimedia.org/wiki/Category:Hjörleifshöfði"
    },
    {
      "source": "Visit South Iceland",
      "url": "https://www.south.is/en/place/hjorleifshofdi"
    }
  ],
  "opening_hours": {
    "access": "Open 24/7 year-round, weather permitting",
    "parking_fee": "1,000 ISK per vehicle",
    "access_road": "2 km gravel road from Ring Road, 4x4 recommended especially after rain",
    "hiking_time": "40 minutes to summit, 2-3 hours for complete circuit including Yoda Cave and bird cliffs",
    "best_season": "May to August for bird watching, summer for easiest road conditions",
    "yoda_cave": "Free access year-round, located on south side facing the ocean, 20-30 meters high",
    "safety_notes": "Road can be soft, muddy, and icy in winter/spring. Check weather before visiting. Bird cliffs can be slippery.",
    "distance_from_vik": "15 km east, approximately 15-minute drive"
  }
}