{
  "name": "Hofskirkja",
  "description": "Hofskirkja is Iceland's last turf church built in the traditional style and the youngest of only six remaining turf churches in the country, all of which are protected as national historical monuments. Located in the village of Hof in Öræfi, southeastern Iceland, approximately 20 kilometers southeast of Skaftafell in Vatnajökull National Park and 87 kilometers east of Kirkjubæjarklaustur, the church sits dramatically beneath Hvannadalshnjúkur, Iceland's highest peak at 2,110 meters. The current structure was originally constructed in 1884 by Páll Pálsson, a renowned Icelandic carpenter, and dedicated to Saint Clement. The church underwent thorough restoration between 1953 and 1954 by the National Museum of Iceland and was reconsecrated in 1954. However, churches have occupied this sacred site for over 700 years, with the oldest written records appearing in a medieval document from 1343, establishing Hofskirkja as one of Iceland's most historically significant religious locations. The church exemplifies traditional Icelandic turf architecture, featuring a timber skeleton surrounded by sturdy stone walls that provide structural support. The roof is capped by heavy stone slabs covered with layers of turf and grass, creating a distinctive green covering that helps retain heat and provides natural insulation against Iceland's harsh climate. The building is partially buried into the earth, allowing the ground itself to serve as additional insulation—a crucial adaptation for survival in the sub-Arctic environment.",
  "address": "Hof, 785 Öræfi, Iceland",
  "coordinates": {
    "longitude": -16.7075,
    "latitude": 63.9067,
    "altitude": 0.0
  },
  "rating": 4.4,
  "reviews_count": 1850,
  "category": "Turf Church",
  "website": "https://www.thjodminjasafn.is/en/soguleg-husasofn/hofskirkja-a-oraefum",
  "phone": null,
  "images": [
    "https://commons.wikimedia.org/wiki/Category:Hofskirkja_(í_Öræfum)",
    "https://commons.wikimedia.org/wiki/File:Hofskirkja,_Hofi_í_Öræfum.JPG"
  ],
  "opening_hours": {
    "exterior_viewing": "Accessible 24/7 year-round from perimeter fence",
    "interior_access": "Closed to public, no interior visits permitted except during occasional church services",
    "parking": "Free parking available adjacent to church grounds",
    "admission": "No entrance fee, free to view from outside",
    "access_road": "Hofsvegur road off Ring Road (Route 1), 5-minute drive from highway",
    "distance_from_skaftafell": "20 km southeast",
    "distance_from_kirkjubaejarklaustur": "87 km east",
    "status": "Protected national monument, active parish church, maintained by National Museum of Iceland",
    "notes": "Church and grounds are fenced for preservation. Photography permitted from outside. One of only 6 remaining turf churches in Iceland."
  }
}
