{
  "name": "Hofsós - Infinity Pool Scenic Village",
  "description": "Hofsós establishes scenic village Skagafjörður fjord where approximately 180 residents inhabit historic trading post settlement achieving international recognition hosting spectacular infinity pool Sundlaug Hofsóss overlooking fjord creating exceptional swimming experience combining geothermal bathing dramatic seascapes establishing premier Icelandic swimming destination attracting visitors worldwide seeking unique bathing experiences beyond conventional pool facilities demonstrating how exceptional amenities transform tiny villages tourism destinations. Icelandic Emigration Centre Vesturfarasetrið documents 19th-20th century emigration Canada United States where economic hardships volcanic eruptions drove thousands Icelanders overseas creating diaspora communities maintaining cultural connections establishing heritage museum preserving emigration history family genealogy research supporting cultural tourism diaspora visitors researching ancestry heritage connections. Historic buildings preserve 19th century trading post architecture where Pakkhús warehouse Gamla Kaupfélagið old cooperative store maintain traditional commercial architecture establishing heritage character beyond purely functional modern structures demonstrating successful historical preservation supporting tourism cultural identity. Swimming pool Hofsós oceanfront infinity design creates illusion merging Skagafjörður waters where geothermal warmth combines stunning views creating unforgettable bathing experiences featured countless travel publications Instagram posts establishing global recognition tiny village demonstrating social media power transforming obscure locations viral destinations. Quiet character maintains authentic atmosphere where minimal commercialization limited tourist infrastructure preserve genuine small-village qualities appealing visitors seeking peaceful authentic experiences beyond crowded tourist circuits though basic amenities require realistic expectations regarding available services dining accommodation options.",
  "address": "Hofsós, 565 North Iceland",
  "coordinates": {
    "longitude": -19.4333,
    "latitude": 65.8667,
    "altitude": 5.0
  },
  "rating": 4.7,
  "reviews_count": 5670,
  "category": "Village - North Iceland",
  "website": "https://www.skagafjordur.is",
  "phone": "+354 455 6720",
  "images": [
    "https://www.northiceland.is/images/hofsos-pool.jpg"
  ],
  "opening_hours": {
    "population": "~180",
    "location": "Skagafjörður fjord, scenic coastline",
    "infinity_pool": "Sundlaug Hofsóss, oceanfront fjord views (global fame)",
    "emigration_centre": "Vesturfarasetrið, 19th-20th century emigration history",
    "character": "Tiny scenic village, world-famous infinity pool, heritage site"
  }
}
