{
  "name": "Húsavík",
  "description": "Húsavík is a charming coastal town of approximately 2,300 residents in North Iceland, universally recognized as the \"Whale Watching Capital of the World\" and \"Whale Watching Capital of Europe\" due to exceptional marine mammal viewing opportunities in Skjálfandi Bay. Located on the eastern shore of Skjálfandi Bay approximately 90 kilometers northeast of Akureyri, the town's nutrient-rich waters attract up to 23 different whale species including humpback whales, minke whales, harbor porpoises, white-beaked dolphins, and occasionally the magnificent blue whale—Earth's largest animal. Additionally, large colonies of Atlantic puffins nest on islands within the bay during summer months from May through August, offering combined whale and puffin viewing excursions. Multiple whale watching companies operate from Húsavík harbor, with Gentle Giants Whale Watching earning TripAdvisor awards for 14 consecutive years through 2025, testament to consistently high-quality experiences. Success rates for whale sightings between June and August in Skjálfandi Bay approach near-certainty, with some operators offering free return trips if no whales are spotted. Tours typically last 2.5 to 3 hours departing from the picturesque harbor, using traditional oak boats or modern RIBs (rigid inflatable boats) for closer encounters. The town gained international pop culture recognition from the 2020 Netflix film Eurovision Song Contest: The Story of Fire Saga starring Will Ferrell and Rachel McAdams.",
  "address": "Húsavík, 640 Húsavík, Iceland",
  "coordinates": {
    "longitude": -17.3397,
    "latitude": 66.0449,
    "altitude": 0.0
  },
  "rating": 4.7,
  "reviews_count": 6800,
  "category": "Town",
  "website": "https://www.northiceland.is/en/destinations/towns/husavik",
  "phone": "+354 464 1860",
  "images": [
    {
      "source": "Visit North Iceland",
      "url": "https://www.northiceland.is/en/destinations/towns/husavik"
    },
    {
      "source": "Guide to Iceland",
      "url": "https://guidetoiceland.is/travel-iceland/drive/husavik"
    }
  ],
  "opening_hours": {
    "town_access": "Open 24/7 year-round, residential town with full services",
    "whale_watching_season": "Year-round tours, peak season June-August with near-certain sightings",
    "whale_species": "Up to 23 species: humpback, minke, blue whales, dolphins, harbor porpoises",
    "puffin_colonies": "May-August nesting season on bay islands, combined whale-puffin tours available",
    "gentle_giants": "14-year consecutive TripAdvisor award winner through 2025, 2.5-3 hour tours",
    "geosea_baths": "Geothermal seawater infinity pools 38-39°C, cliff-top ocean views, saunas, restaurant",
    "geosea_discount": "15% off entrance with whale watching tour tickets from participating operators",
    "whale_museum": "11 whale skeletons, cetacean biology exhibits, open year-round",
    "husavikurkirkja_church": "1907 Swiss chalet-style wooden church with red roof, town landmark",
    "exploration_museum": "Viking to Apollo missions, human exploration history",
    "eurovision_film": "Featured in 2020 Netflix Eurovision Song Contest: The Story of Fire Saga, Academy Award-nominated song",
    "fosshotel_husavik": "Largest conference hotel in North Iceland since 2016 expansion",
    "services": "Hotels, guesthouses, restaurants, cafés, Ölstofan microbrewery, swimming pool, campsite, golf, skiing",
    "population": "Approximately 2,300 residents",
    "distance_from_akureyri": "90 km northeast via Route 1 and Route 85",
    "diamond_circle": "Key town on Diamond Circle route in North Iceland"
  }
}