{
  "name": "Hvannadalshnjúkur",
  "description": "Hvannadalshnjúkur is Iceland's highest peak at 2,110 meters (6,923 feet) above sea level, located on the northwestern rim of the Öræfajökull volcano within Vatnajökull National Park. This majestic summit represents the ultimate mountaineering challenge for climbers in Iceland, combining high-altitude conditions, glacier travel, and potential volcanic hazards. The peak is actually part of a stratovolcano that last erupted in 1727-1728, causing catastrophic destruction in the surrounding area. The volcano remains active, with geothermal heat maintaining ice caves beneath the summit ice cap. Hvannadalshnjúkur's prominence makes it visible from vast distances across Southeast Iceland.\n\nClimbing Hvannadalshnjúkur requires significant mountaineering experience, proper equipment, and typically takes 10-15 hours for the round trip from Skaftafell area. The ascent involves glacier travel with crevasse dangers, steep snow and ice slopes, and potential for severe weather including high winds and whiteout conditions. Most climbers attempt the peak during June through August when weather is most stable, though summit success rates remain around 50% due to challenging conditions. The standard route begins from Sandfell hut, traversing Falljökull glacier before ascending steep snow slopes to the summit plateau. Climbers must be roped together, equipped with ice axes, crampons, and appropriate glacier rescue gear. The summit offers extraordinary 360-degree views when weather permits, with much of Iceland visible including Eyjafjallajökull, Snæfell, and the vast Vatnajökull ice cap.\n\nAttempting Hvannadalshnjúkur is only recommended for experienced mountaineers or through guided expeditions offered by certified Icelandic mountain guides. Independent climbers must register their plans with local authorities and carry appropriate emergency equipment including GPS, emergency shelter, and communication devices. The mountain demands respect for its volcanic and glacial hazards. The area is remote with no facilities near the climbing routes. Most guided expeditions operate from Skaftafell during summer months, with trips requiring 2-3 days including approach, summit attempt, and return. The climb represents a serious mountaineering undertaking and should not be attempted without proper preparation, fitness, and experience.",
  "category": "Mountain",
  "coordinates": {
    "latitude": 64.008333,
    "longitude": -16.650000,
    "altitude": 2110.0
  },
  "rating": 4.9,
  "reviews_count": 245,
  "opening_hours": "June-August (guided tours only, experienced mountaineers)"
}
