{
  "name": "Hólmavík - Witchcraft Museum Town",
  "description": "Hólmavík establishes Strandir region service center eastern Westfjords where approximately 370 residents inhabit Steingrímsfjörður fjord creating modest commercial hub supporting broader remote coastal population providing fuel accommodations dining medical services establishing regional importance exceeding population size though primarily recognized hosting Museum of Icelandic Sorcery & Witchcraft documenting dark witchcraft persecution history magical traditions establishing macabre tourism attraction differentiating small fishing village creating distinctive identity supporting visitor economy. Witchcraft Museum presents comprehensive collection sorcery artifacts historical persecution accounts magical staves necropants legendary húðfeldur human-skin pants creating shocking yet educational exhibits exploring 17th-century witch trials Iceland where predominantly male victims differed European witch-hunt patterns targeting women establishing unique cultural historical context demonstrating how folklore persecution traditions shape Icelandic identity narratives supporting tourism cultural education beyond purely scenic natural attractions. Route 68 continues north connecting isolated Strandir coast Djúpavík abandoned herring factory Drangsnes village though increasingly rough gravel roads challenging driving conditions create genuine adventure travel requiring proper vehicles driving skills patience accepting slow speeds poor conditions establishing off-beaten-path authenticity appealing adventurous travelers willing endure discomfort accessing truly remote regions beyond convenient tourist circuits.",
  "address": "Hólmavík, 510 Strandir, Westfjords",
  "coordinates": {
    "longitude": -21.6833,
    "latitude": 65.7167,
    "altitude": 5.0
  },
  "rating": 4.3,
  "reviews_count": 3450,
  "category": "Town - Westfjords",
  "website": "https://www.strandir.is",
  "phone": "+354 451 3111",
  "images": [
    "https://www.westfjords.is/images/holmavik-witchcraft.jpg"
  ],
  "opening_hours": {
    "population": "~370 (Strandir region center)",
    "location": "Steingrímsfjörður fjord, eastern Westfjords",
    "witchcraft_museum": "Museum of Icelandic Sorcery & Witchcraft, necropants exhibit",
    "route_68": "North to Drangsnes, Djúpavík (gravel, challenging)",
    "character": "Service center, witchcraft heritage tourism, remote Strandir gateway"
  }
}