{
  "name": "Hólar Cathedral - Iceland's Oldest Stone Church & Northern Episcopal Seat",
  "description": "Hólar Cathedral represents nearly 900 years of continuous religious, educational, and cultural significance, serving as Episcopal see for northern Iceland from 1106 to 1798 (while Skálholt served southern Iceland) and functioning as educational center that shaped Icelandic intellectual life through multiple centuries of transformation from Catholic diocese to Lutheran reformation to modern university. Bishop Jón Ögmundsson founded the diocese and cathedral school in 1106 AD, establishing institution that would educate Iceland's clergy, scholars, and leaders for next seven centuries—this educational mission positioned Hólar as intellectual hub where Latin, theology, literature, and practical knowledge transmitted across generations. The introduction of Iceland's first printing press to Hólar in 1530 (20 years before Reformation) revolutionized Icelandic literacy and book production, allowing mass distribution of religious texts, sagas, and educational materials that previously existed only as rare handwritten manuscripts vulnerable to fire, decay, and loss—this technological advancement preserved Icelandic language and culture during period when Danish colonial influence threatened linguistic independence. The Reformation in 1550 AD converted Iceland from Catholicism to Lutheranism, transforming Hólar from Catholic episcopal seat to Lutheran bishopric while the cathedral school became Latin school operating until 1801, maintaining classical education tradition even as political and religious structures changed.",
  "address": "Hólar, 551 Hjaltadalur, Skagafjörður, Iceland (North Iceland)",
  "coordinates": {
    "longitude": -19.1437,
    "latitude": 65.7456,
    "altitude": 75.0
  },
  "rating": 4.6,
  "reviews_count": 1240,
  "category": "Cathedral & Historic Site",
  "website": "https://www.holar.is",
  "phone": "+354 455 6333",
  "images": [
    "https://nat.is/wp-content/uploads/holar-cathedral.jpg"
  ],
  "opening_hours": {
    "diocese_founded": "1106 by Bishop Jón Ögmundsson",
    "episcopal_period": "1106-1798 (692 years as northern Iceland's Episcopal see)",
    "cathedral_school": "1106-1801 (695 years) - Latin school after 1550 Reformation",
    "current_cathedral": "Consecrated 1763 - Iceland's oldest stone church",
    "bishops": "36 total - 23 Catholic (1106-1550), 13 Lutheran (1550-1798)",
    "first_printing_press": "1530 - Iceland's first, 20 years before Reformation",
    "reformation": "1550 AD - conversion from Catholic to Lutheran",
    "modern_education": "1882 Agricultural College → 2003 Hólar University College",
    "restored_episcopal_status": "1952 - regained as parsonage and ordaining bishop seat",
    "current_bishop": "Solveig Lara Guðmundsdóttir",
    "educational_focus": "Medieval: theology, Latin, classical education; Modern: equestrian studies, aquaculture, tourism",
    "cultural_significance": "Shaped Icelandic intellectual life for nearly 900 years",
    "printing_impact": "Revolutionized literacy, preserved Icelandic language during Danish colonial period",
    "location": "Hjaltadalur valley, Skagafjörður region, North Iceland",
    "architectural_significance": "Oldest stone church in Iceland, rare permanent construction",
    "historical_artifacts": "Interior preserves centuries of worship artifacts and woodwork",
    "archaeological_remains": "Medieval layout and construction evidence in surrounding grounds"
  }
}