{
  "name": "Kol Restaurant - Kitchen & Bar on Rainbow Street",
  "description": "Kol Restaurant has become one of Reykjavík's most popular dining destinations since opening, offering innovative cuisine with significant emphasis on grilled dishes while occupying a prime location on the colorful Skólavörðustígur—the rainbow street painted in Pride colors that has become one of Reykjavík's most photographed thoroughfares, connecting downtown to the iconic Hallgrímskirkja church that dominates the city skyline. Located at Skólavörðustígur 40, the restaurant benefits from foot traffic of tourists walking between Laugavegur shopping street and Hallgrímskirkja, while the vibrant rainbow street provides an Instagram-worthy backdrop that attracts visitors seeking both excellent food and aesthetic experiences. The menu celebrates exciting innovations with variety spanning finger food, salads, fish, steaks, and desserts—the kitchen's expertise with charcoal grilling creates distinctive smoky flavors and perfect searing that makes their grilled steaks and other proteins particularly noteworthy. Signature dishes include gyoza tacos (fusion concept combining Japanese dumplings with Mexican presentation), charcoal grilled steaks showcasing premium beef with expert flame preparation, smoked salmon highlighting Iceland's exceptional Atlantic fish, grilled scallops demonstrating the kitchen's skill with delicate seafood, and roasted duck providing rich, flavorful alternative to lighter fish options. The restaurant offers multiple tasting menu options including Icelandic (focusing on local ingredients and traditional flavors), French (drawing on classic haute cuisine techniques and ingredients), and vegan (demonstrating that innovative plant-based cuisine can match the creativity and satisfaction of conventional menus), providing choices for diverse dietary preferences and culinary curiosities. The popular weekend bottomless brunch has become a Reykjavík institution, with Saturday and Sunday Bubble Brunch menus attracting both locals and visitors seeking leisurely weekend meals with unlimited drinks creating festive, social atmosphere. Weekday lunch service (12:00 PM - 2:00 PM) offers a special menu providing more casual, quicker dining for business lunches or tourists taking midday breaks during sightseeing. Prices are described as reasonable with typical expectations around 12,000 ISK per person for an entrée and beer, positioning Kol as upscale but not prohibitively expensive—special occasion dining that remains accessible rather than rarified luxury. The restaurant's name \"Kol\" means charcoal in Icelandic, directly referencing the charcoal grilling techniques that define much of the menu and create the smoky, seared flavors that have become house signatures. The combination of excellent location on rainbow street near major tourist sites, diverse menu with something for every taste, expertise with grilled preparations, tasting menu options accommodating different preferences, and popular brunch service has made Kol one of Reykjavík's busiest and most recommended restaurants—reservations are essential, particularly for weekend brunch or dinner service when demand frequently exceeds capacity. The atmosphere balances upscale dining with approachable casualness, avoiding stuffiness while maintaining standards of service, presentation, and quality that distinguish fine dining from ordinary meals.",
  "address": "Skólavörðustígur 40, 101 Reykjavík (Rainbow Street)",
  "coordinates": {
    "longitude": -21.9287,
    "latitude": 64.1441,
    "altitude": 15.0
  },
  "rating": 4.7,
  "reviews_count": 4120,
  "category": "Restaurant",
  "website": "https://kolrestaurant.is/en",
  "phone": "+354 517 7474",
  "images": [
    "https://kolrestaurant.is/images/rainbow-street-location.jpg"
  ],
  "opening_hours": {
    "weekday_lunch": "12:00 PM - 2:00 PM (special lunch menu)",
    "weekend_brunch": "Saturday & Sunday Bubble Brunch (bottomless brunch)",
    "cuisine": "Innovative with emphasis on charcoal grilling",
    "name_meaning": "Kol = charcoal in Icelandic",
    "signature_dishes": "Gyoza tacos, charcoal grilled steaks, smoked salmon, grilled scallops, roasted duck",
    "menu_variety": "Finger food, salads, fish, steaks, desserts",
    "tasting_menus": "Icelandic, French, vegan options available",
    "grilling_specialty": "Charcoal grilling creates smoky flavors and perfect searing",
    "brunch": "Popular weekend bottomless brunch (Saturday & Sunday)",
    "price_estimate": "~12,000 ISK per person (entrée + beer)",
    "price_level": "Reasonable, upscale but accessible",
    "location_highlight": "Rainbow street (Skólavörðustígur), near Hallgrímskirkja church",
    "foot_traffic": "Prime location between Laugavegur shopping and Hallgrímskirkja",
    "instagram_worthy": "Vibrant rainbow street provides photogenic backdrop",
    "atmosphere": "Upscale yet approachable, avoids stuffiness",
    "reservations": "Essential, especially weekends (brunch & dinner)",
    "popularity": "One of Reykjavík's busiest and most recommended restaurants",
    "dietary_accommodation": "Vegan tasting menu available alongside meat-focused options",
    "nearby": "Hallgrímskirkja church, Laugavegur shopping street"
  }
}
