{
  "name": "Kópavogur - Iceland's Second Largest City",
  "description": "Kópavogur establishes Iceland's second-largest municipality positioned immediately south Reykjavík where approximately 40,000 residents create vibrant suburban city character integrated Greater Reykjavík metropolitan area offering modern amenities commercial developments residential neighborhoods functioning major economic cultural center beyond bedroom community stereotype demonstrating successful urban development patterns Icelandic context transforming former rural farmland contemporary city maintaining efficient connections capital while cultivating independent identity distinct attractions. Smáralind Shopping Mall dominates retail landscape representing Iceland's largest shopping complex spanning 10.5 acres accommodating 90+ stores restaurants cinema gym facilities establishing premier shopping destination Greater Reykjavík area where international brands local boutiques coexist creating comprehensive retail experience serving city populations beyond traditional downtown Reykjavík shopping districts providing convenient suburban commercial infrastructure supporting modern consumer lifestyles expectations. Kópavogur Church commands attention striking modernist architecture designed Hörður Bjarnason completed 1963 where elevated hilltop location provides panoramic capital region views while unique geometric design represents mid-century Icelandic ecclesiastical architecture departing traditional church aesthetics establishing architectural landmark visible across municipality functioning active parish serving religious community cultural heritage site demonstrating post-war Icelandic development ambitions.",
  "address": "Kópavogur, 200 Capital Region, Iceland (immediately south of Reykjavík)",
  "coordinates": {
    "longitude": -21.9078,
    "latitude": 64.1097,
    "altitude": 15.0
  },
  "rating": 4.4,
  "reviews_count": 6780,
  "category": "Town - Capital Region",
  "website": "https://kopavogur.is/en",
  "phone": "+354 441 3000",
  "images": [
    "https://visitreykjavik.is/images/kopavogur-city.jpg"
  ],
  "opening_hours": {
    "population": "~40,000 (Iceland's 2nd largest)",
    "location": "Immediately south of Reykjavík",
    "smaralind": "Iceland's largest shopping mall, 90+ stores",
    "sky_lagoon": "Oceanside geothermal spa, 7-step ritual",
    "kopavogur_church": "1963 modernist landmark, hilltop views",
    "gerdarsafn": "Art museum, modern/contemporary focus",
    "swimming_pools": "Salalaug, Kópavogslaug",
    "character": "Modern suburb, shopping, residential, family-friendly"
  }
}