{
  "name": "Kópavogslaug - One of Iceland's Largest Aquatic Centers",
  "description": "Kópavogslaug ranks among Iceland's largest and most comprehensive aquatic facilities, featuring an Olympic-sized 50-meter outdoor pool, two indoor pools, seven hot tubs, three waterslides, and integrated fitness center that together create a destination serving serious athletes, casual swimmers, families with children, and the geothermal bathing culture that makes swimming pools Iceland's most important social gathering places. Located in Kópavogur—Iceland's second-largest municipality with approximately 40,000 residents, forming Reykjavík's southern neighbor in the continuous capital region urban sprawl—the facility serves a prosperous, family-oriented community known for excellent schools, modern shopping centers, cultural venues including the distinctive Salurinn concert hall, and quality recreational infrastructure. Kópavogslaug's scale and amenities distinguish it from neighborhood pools, positioning it as a regional destination that attracts users from across the capital area who seek facilities matching international standards while maintaining authentic Icelandic pool culture. The centerpiece 50-meter Olympic outdoor pool accommodates competitive swimming, triathlon training, water polo, and serious lap work with proper regulation dimensions, multiple lanes, and timing equipment used by Iceland's national team swimmers and age-group competitors preparing for meets. The pool maintains year-round comfortable temperature through geothermal heating, allowing outdoor training even during winter months when swimmers glide through warm water while snow falls around them—a surreal experience unique to Iceland's geothermal abundance. Two indoor pools provide sheltered swimming options during particularly harsh weather or for users preferring climate-controlled environments, accommodating everything from parent-child swimming lessons to aquatic therapy to recreational splashing. Seven hot tubs—one of Iceland's most extensive collections—offer temperature variety from mild to intense heat, allowing bathers to select preferred warmth levels and creating enough capacity that crowding rarely occurs even during peak hours. The hot tubs function as Kópavogur's democratic social forum where pot chat flourishes—those relaxed conversations about local affairs, national politics, sports, family matters, and weather that constitute Iceland's most egalitarian social practice where corporate executives soak alongside construction workers, discussing issues as equals. A steam bath provides humid heat distinct from dry sauna warmth, beneficial for respiratory health, skin hydration, and the cleansing detoxification many Icelanders consider essential. A cold plunge tub offers contrast bathing opportunities for those practicing alternating hot and cold immersion. Three waterslides provide graduated thrill levels for different ages and courage, making the facility particularly family-friendly despite its serious athletic training capacity. The integrated gym facility creates a comprehensive fitness center where members can combine swimming, weight training, cardio equipment, and group classes in single visits, making Kópavogslaug attractive to serious fitness enthusiasts. The facility operates on seasonal hours with extended summer schedules (May 1-September 30) offering weekend swimming until 8:00 PM, while winter hours (October 1-April 30) close weekends earlier at 6:00 PM—reflecting Iceland's seasonal light variations and usage patterns.",
  "address": "Borgarholtsbraut 17, 200 Kópavogur, Iceland",
  "coordinates": {
    "longitude": -21.8897,
    "latitude": 64.1089,
    "altitude": 15.0
  },
  "rating": 4.7,
  "reviews_count": 2180,
  "category": "Swimming Pool",
  "website": "https://www.kopavogur.is/en/residents/sports/swimming-pools-in-kopavogur",
  "phone": "+354 441 8500",
  "images": [
    "https://www.kopavogur.is/images/kopavogslaug-pool.jpg"
  ],
  "opening_hours": {
    "weekdays": "6:30 AM - 10:00 PM",
    "weekends_summer": "8:00 AM - 8:00 PM (May 1 - September 30)",
    "weekends_winter": "8:00 AM - 6:00 PM (October 1 - April 30)",
    "admission_adults": "1,190 ISK per visit",
    "multi_visit_10": "6,800 ISK (10 visits)",
    "multi_visit_30": "14,000 ISK (30 visits)",
    "multi_visit_60": "22,600 ISK (60 visits)",
    "annual_pass": "34,100 ISK",
    "olympic_pool": "50m outdoor pool (Olympic-sized)",
    "indoor_pools": "2 indoor pools",
    "hot_tubs": "7 hot tubs (extensive variety)",
    "features": "3 waterslides, cold tub, steam bath, integrated gym",
    "scale": "One of Iceland's largest aquatic centers",
    "athletics": "Used by national team swimmers and competitive athletes",
    "municipality": "Kópavogur (pop. ~40,000), Iceland's 2nd largest municipality",
    "regional_draw": "Attracts users from across capital region",
    "nearby": "Salurinn concert hall, modern shopping centers"
  }
}
