{
  "name": "Langabúð Djúpivogur",
  "description": "Langabúð is a beautifully preserved historic trading post and cultural heritage house located in the charming fishing village of Djúpivogur in East Iceland. Built in 1790, this red-painted timber building is one of Iceland's oldest commercial structures and represents a remarkably intact example of 18th-century trading post architecture. The building served as the commercial center of Djúpivogur for over 200 years, where local farmers and fishermen traded their goods for imported necessities. Today, Langabúð functions as a cultural center, café, and heritage museum, offering visitors a glimpse into Iceland's trading history and rural life.\n\nThe heritage house features carefully curated exhibits about the history of Djúpivogur and the surrounding region, including displays on local fishing traditions, farming practices, and the evolution of trade in rural Iceland. The museum showcases artifacts from the building's trading post days, including vintage goods, tools, ledgers, and photographs that bring the past to life. Particularly notable are the exhibitions about sculptor Ríkarður Jónsson, who was born in Djúpivogur in 1888 and became one of Iceland's most important artists. The building's original interiors have been preserved, with dark wooden floors, low ceilings, and small-paned windows creating an atmospheric setting. The attached café serves traditional Icelandic cakes, coffee, and light meals in a historic ambiance.\n\nLangabúð is located in the heart of Djúpivogur village, directly beside the harbor with views across Berufjörður fjord. The building is easily accessible and offers free parking nearby. The heritage house and café are typically open daily during summer months (June-August) with reduced hours in shoulder seasons. Djúpivogur itself is worth exploring, featuring the modern outdoor sculpture installation 'Eggin í Gleðivík' (34 eggs representing local bird species) and serving as a gateway to the remote Eastfjords. The village lies on Route 1 approximately 100 kilometers south of Egilsstaðir, making it a convenient stop for Ring Road travelers.",
  "category": "Museum",
  "coordinates": {
    "latitude": 64.644167,
    "longitude": -14.282222,
    "altitude": 5.0
  },
  "phone": "+354 478 8220",
  "rating": 4.5,
  "reviews_count": 320,
  "opening_hours": "June-August: Daily 10:00-18:00; September-May: Reduced hours"
}
