{
  "name": "Humarhátíð (Lobster Festival Höfn)",
  "description": "Humarhátíð, the annual Lobster Festival in Höfn, is one of Iceland's most beloved food festivals, celebrating the town's status as the langoustine (Iceland lobster) capital of the country. Held every June over a long weekend, this festival transforms the small southeastern town of Höfn into a culinary destination that attracts thousands of visitors from across Iceland and internationally. The festival centers on the exceptional langoustines harvested from the waters around Höfn, which are renowned for their sweet, delicate flavor and superior quality. During the festival, local restaurants and temporary food stalls compete to create the most innovative and delicious langoustine dishes, from traditional preparations to creative modern interpretations. The atmosphere is festive and family-friendly, with live music, entertainment, art exhibitions, and activities for children complementing the culinary experiences.\n\nThe festival has grown significantly since its inception in 1987, when it began as a small local celebration. Today it's a major event on Iceland's culinary calendar, showcasing not only langoustines but also Iceland's vibrant food scene and the importance of sustainable fishing to coastal communities. Visitors can sample langoustine prepared in countless ways—grilled, fried, in soups, on pizzas, in tacos, and in traditional Icelandic preparations. Many restaurants offer special tasting menus during the festival, and cooking demonstrations by renowned chefs provide insight into techniques for preparing these delicate crustaceans. The festival also includes cultural events highlighting local arts and crafts, exhibitions about the fishing industry, and opportunities to learn about marine conservation and sustainable fishing practices that keep Höfn's langoustine fishery healthy and productive.\n\nAttending Humarhátíð offers more than just exceptional food—it provides deep insight into Icelandic coastal culture and the relationship between communities and the sea. The festival atmosphere is warm and welcoming, with locals proud to share their culinary treasure with visitors. Höfn itself is worth exploring, with its stunning location at the edge of Hornafjörður fjord, views toward Vatnajökull glacier, and access to spectacular natural attractions in Southeast Iceland. During the festival, accommodation in Höfn and surrounding areas fills quickly, so booking well in advance is essential. The event typically runs from Thursday through Sunday in late June or early July, with the main activities concentrated on Friday and Saturday. Combining the festival with exploration of nearby attractions like Jökulsárlón glacier lagoon and the Vatnajökull region creates an unforgettable Iceland experience.",
  "category": "Restaurant",
  "coordinates": {
    "latitude": 64.253333,
    "longitude": -15.208889,
    "altitude": 5.0
  },
  "rating": 4.8,
  "reviews_count": 1876,
  "opening_hours": "Annual event held in late June/early July (check dates annually). Main activities Friday-Sunday. Book accommodation well in advance."
}
