{
  "name": "Laugardalslaug - Reykjavík's Largest Pool Complex",
  "description": "Laugardalslaug stands as Reykjavík's largest and most comprehensive swimming pool complex, offering an Olympic-sized outdoor pool alongside extensive recreational facilities that make it a beloved gathering place for locals and a popular destination for visitors seeking an authentic Icelandic swimming culture experience. Located in Laugardalur valley in eastern Reykjavík—a district that serves as the city's primary sports and recreation hub—the facility exemplifies Iceland's deep-rooted swimming tradition where geothermal pools function as social centers comparable to cafés or pubs in other cultures. The centerpiece 50-meter Olympic outdoor pool maintains a comfortable 29°C (84°F) temperature year-round thanks to geothermal heating, allowing swimmers to glide through warm water while surrounded by cool Icelandic air, with steam rising dramatically on cold days. Beyond competitive swimming, the complex features multiple hot tubs (heitir pottar) ranging from 38-44°C (100-111°F) where Icelanders engage in their cherished tradition of pot chat—relaxed conversations about everything from politics to weather to neighborhood gossip that represent Iceland's most democratic social forum where everyone from laborers to politicians soak side by side. A unique saltwater hot tub provides a different mineral experience, while a cold plunge pool offers the invigorating contrast essential to the Icelandic bathing ritual. The nearly 300-foot waterslide delights children and adventurous adults.",
  "address": "Sundlaugavegur 30a, 104 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.8951,
    "latitude": 64.1414,
    "altitude": 12.0
  },
  "rating": 4.7,
  "reviews_count": 3240,
  "category": "Swimming Pool",
  "website": "https://reykjavik.is/en/laugardalslaug-pool",
  "phone": "+354 411 5100",
  "images": [
    "https://reykjavik.is/sites/default/files/laugardalslaug-pool.jpg"
  ],
  "opening_hours": {
    "weekdays": "Monday-Friday 6:30 AM - 10:00 PM",
    "weekends": "Saturday-Sunday 8:00 AM - 9:00 PM",
    "admission_adults": "1,330 ISK (~$9.50)",
    "admission_youth_16_17": "210 ISK (~$1.50)",
    "admission_children_0_15": "Free",
    "swimsuit_rental": "900 ISK",
    "towel_rental": "600 ISK",
    "reykjavik_city_card": "Free admission with card",
    "olympic_pool": "50m outdoor pool at 29°C (84°F)",
    "hot_tubs": "Multiple hot tubs 38-44°C, including saltwater tub",
    "features": "Waterslide (300 ft), wipeout track, indoor pool, children's pool, mini-golf",
    "accessibility": "Wheelchair elevator access to pools, hot tubs, sauna",
    "food_service": "Café with snacks, restaurant for 90 guests",
    "largest": "Reykjavík's largest swimming pool complex"
  }
}