{
  "name": "Leirhnjúkur",
  "description": "Leirhnjúkur, which translates to 'Clay Peak,' is a remarkable geothermal area and volcanic crater within the Krafla volcanic system in North Iceland. This site became famous during the Krafla Fires eruption series (1975-1984) when it was the source of multiple lava flows that transformed the landscape. The area showcases some of Iceland's youngest lava fields, with sections of black volcanic rock so fresh that you can still see the ropy textures and flow patterns preserved in stunning detail. Steam rises from countless fissures in the lava, and colorful mineral deposits paint the rocks in shades of yellow, orange, and red, creating an otherworldly landscape.\n\nThe geothermal activity at Leirhnjúkur includes active fumaroles, hot springs, and mud pots set within the dramatic volcanic terrain. Visitors can walk through the lava field on well-maintained trails and boardwalks that protect both the fragile environment and hikers from geothermal hazards. The contrast between the jet-black lava rock and bright sulfur deposits creates exceptional photographic opportunities. The area demonstrates the entire cycle of volcanic creation, with ancient weathered craters visible alongside fresh lava from the 1970s-80s eruptions. The ground remains hot in many areas, with temperatures sometimes reaching 100°C just centimeters below the surface. This heat sustains unique thermophilic bacteria that color some pools and streams in brilliant shades of orange and green.\n\nLeirhnjúkur is accessed via a paved road from the main Krafla geothermal area parking lot, making it suitable for regular vehicles. The main circuit trail around Leirhnjúkur takes approximately 45-60 minutes at a leisurely pace. The trail offers stunning views of the Krafla caldera, Víti crater lake, and the vast lava fields stretching toward Lake Mývatn. Summer months (June-September) provide optimal hiking conditions, though the site is accessible year-round for those prepared for winter conditions. The area is free to visit and rarely crowded despite its accessibility. Nearby attractions include the Krafla Power Station visitor center and the beautiful Víti crater with its blue-green lake.",
  "category": "Geothermal Area",
  "coordinates": {
    "latitude": 65.717222,
    "longitude": -16.807778,
    "altitude": 520.0
  },
  "rating": 4.8,
  "reviews_count": 980,
  "website": "https://www.visitnorthiceland.is",
  "opening_hours": "Open 24/7 (paved road access, free entry)"
}
