{
  "name": "Litlanesfoss - Basalt Column Falls",
  "description": "Litlanesfoss, also known as Stuðlabergsfoss (which translates to \"Basalt Column Falls\"), is a spectacular 30-meter-tall two-tier waterfall in East Iceland that ranks among the country's most geologically dramatic cascades due to the extraordinary hexagonal basalt columns that flank it on both sides. These towering basalt formations—some of the tallest basalt columns in Iceland at up to 20 meters (65 feet) high—create a natural cathedral-like setting where the Hengifossá river drops in two distinct steps through a narrow gorge lined with these perfectly geometric volcanic pillars. The basalt columns formed thousands of years ago when lava flows cooled and contracted, creating the characteristic six-sided prismatic structures that appear almost too perfect to be natural. At Litlanesfoss, these columns stand vertically like organ pipes or a giant's colonnade, framing the white cascading water in a composition that exemplifies the geometric beauty of volcanic geology. The waterfall tumbles into a small clear pool before continuing downstream through the basalt gorge, with spray and mist often creating rainbows when sunlight hits at the right angle. Litlanesfoss serves as the scenic prelude to Hengifoss, Iceland's third-tallest waterfall, along one of East Iceland's most rewarding short hikes. The trail begins at a parking area approximately 35 kilometers southwest of Egilsstaðir (the largest town in East Iceland) and follows the Hengifossá river upstream through a beautiful canyon landscape. Hikers encounter Litlanesfoss after about 20-25 minutes of moderate uphill walking on a well-maintained trail, making it an ideal destination for visitors who want dramatic scenery without extreme physical challenge. Most visitors continue past Litlanesfoss for an additional 15-20 minutes to reach Hengifoss, which features distinctive red clay layers in its cliff face, but many photographers and geology enthusiasts consider Litlanesfoss the more visually striking of the two waterfalls due to its basalt columns being more accessible for photography and appearing more dramatic in frame with the falling water. The basalt formations at Litlanesfoss are reminiscent of similar columns at other famous Icelandic locations like Svartifoss and Aldeyjarfoss, but Litlanesfoss's columns are particularly tall and the setting more intimate, allowing visitors to approach quite close to examine the geometric precision of the volcanic rock. The trail to both waterfalls offers additional scenic rewards including views over Lagarfljót lake in the valley below, wildflowers in summer, and interpretive signs explaining the area's geology and formation history.",
  "address": "Hengifossá River, East Iceland (near Egilsstaðir)",
  "coordinates": {
    "longitude": -14.8667,
    "latitude": 65.0833,
    "altitude": 180.0
  },
  "rating": 4.7,
  "reviews_count": 2150,
  "category": "Waterfall",
  "website": "https://www.east.is/en/litlanesfoss",
  "phone": null,
  "images": [
    "https://www.east.is/images/litlanesfoss-basalt-columns.jpg"
  ],
  "opening_hours": {
    "access": "Year-round (winter conditions may make trail challenging)",
    "parking": "Hengifoss parking area (shared with Hengifoss waterfall)",
    "hike_duration": "20-25 minutes from parking (moderate uphill)",
    "admission": "Free",
    "distance_from_egilsstadir": "35 km southwest (approximately 30 minutes drive)",
    "trail_continues_to": "Hengifoss waterfall (additional 15-20 minutes)",
    "height": "30 meters (two-tier cascade)",
    "basalt_column_height": "Up to 20 meters (65 feet)"
  }
}
