{
  "name": "Lofthellir",
  "description": "Lofthellir, meaning 'Air Cave,' is one of Iceland's most spectacular lava caves, renowned for its massive year-round ice formations that create a magical underground wonderland. Located in the Mývatn region of North Iceland, this approximately 3,500-year-old lava tube features enormous ice stalactites and stalagmites that grow to impressive sizes thanks to the cave's unique microclimate. Some ice formations reach several meters in height and width, creating surreal frozen sculptures that gleam in the light of headlamps. The cave's entrance lies in rough volcanic terrain, and accessing the interior requires descending through a collapsed section of the lava tube.\n\nThe cave system extends for hundreds of meters, though guided tours typically cover the most impressive sections where ice formations are densest. The ice persists year-round because cold air is denser than warm air and sinks into the cave, keeping temperatures below freezing even during summer months outside. The cave walls are formed from solidified lava, showing classic features of lava tube formation including drip formations, lava stalactites, and smoothly sculpted walls. The contrast between black volcanic rock and pristine blue-white ice creates stunning visual effects. Exploring Lofthellir offers insight into both volcanic and glacial processes operating in the same environment.\n\nVisiting Lofthellir is only possible through guided tours due to the cave's remote location, challenging access, and the need to protect this fragile environment. Tours typically depart from the Mývatn area and require 4x4 vehicles to reach the cave entrance across rough highland terrain. The journey takes about 45 minutes from Reykjahlíð, followed by a short hike across a lava field. Tours are offered from June through September when highland roads are accessible. Visitors must be reasonably fit as the cave entry requires scrambling over rocks and navigating uneven surfaces. The cave temperature remains around 0°C year-round, so warm clothing is essential even in summer. Tours typically last 3-4 hours including transportation.",
  "category": "Cave",
  "coordinates": {
    "latitude": 65.626944,
    "longitude": -16.668056,
    "altitude": 480.0
  },
  "rating": 4.9,
  "reviews_count": 425,
  "opening_hours": "June-September (guided tours only, advance booking required)"
}
