{
  "name": "Lágafellslaug - Mosfellsbær Swimming Complex",
  "description": "Lágafellslaug stands as Mosfellsbær's premier aquatic and fitness facility, offering a comprehensive swimming complex with multiple pools, extensive waterslides, and integrated World Class gym facilities that make it a popular destination for families, fitness enthusiasts, and visitors exploring the greater Reykjavík area. Located in Mosfellsbær—a rapidly growing municipality of approximately 12,000 residents situated about 15 kilometers east of central Reykjavík along Route 1 (the Ring Road)—the facility serves a community known for its proximity to outdoor recreation including hiking in Esjan mountain, exploring lava caves at Víðgelmir, and accessing highland routes. The swimming complex exemplifies modern Icelandic aquatic design with specialized pools serving different user groups and purposes. The main 25-meter pool accommodates lap swimmers, aquatic fitness classes, and general recreational swimming with comfortable year-round temperature maintained through geothermal heating that makes outdoor swimming pleasurable even during Iceland's coldest months. A unique 16-meter pool features an adjustable bottom that can be raised or lowered to different depths, making it ideal for swimming instruction where water level can be customized to student comfort and skill levels—during scheduled lessons this pool is reserved for instruction, but it opens to general public use during non-lesson hours. A dedicated shallow children's pool equipped with various play features including fountains, sprayers, and interactive water toys creates an engaging environment where young swimmers develop water confidence and basic swimming skills essential in Iceland's culture of universal swimming education. The facility's waterslide complex ranks among its most popular features with three slides providing graduated thrill levels: one open slide approximately 12 meters long offers gentle introduction to waterslide fun appropriate for younger or more cautious users; two enclosed tube slides ranging from 33 to 43 meters create exciting descents through twisting darkness that adventurous children and adults find irresistible. Three hot tubs with temperatures varying from 38-42°C (100-108°F) provide traditional Icelandic soaking and pot chat experiences where neighbors and strangers alike relax in therapeutic warmth while engaging in the relaxed conversations that constitute Iceland's most democratic social practice. A cold plunge tub offers contrast bathing opportunities for those practicing alternating hot and cold immersion believed to improve circulation, boost immune function, and provide invigorating physiological stimulus. A steam room provides humid heat beneficial for respiratory health and skin. The facility's partnership with World Class—Iceland's leading fitness center chain—creates an integrated wellness complex where members can access both swimming pools and fully-equipped gym facilities, offering comprehensive fitness options under one roof. This integration makes Lágafellslaug particularly attractive to serious fitness enthusiasts who combine swimming, weight training, cardio equipment, and group classes in comprehensive workout routines.",
  "address": "Lækjarhlíð 1a, 270 Mosfellsbær, Iceland",
  "coordinates": {
    "longitude": -21.6833,
    "latitude": 64.1628,
    "altitude": 35.0
  },
  "rating": 4.6,
  "reviews_count": 1380,
  "category": "Swimming Pool",
  "website": "https://sundlaugar.is/en/sundlaugasafn/lagafellslaug/",
  "phone": "+354 517 6080",
  "images": [
    "https://sundlaugar.is/images/lagafellslaug-mosfellsbaer.jpg"
  ],
  "opening_hours": {
    "year_round": "Open all year",
    "contact_for_hours": "Call +354 517 6080 for current 2026 hours",
    "winter_hours_reference": "Weekdays 6:30-8:00 AM & 3:00-9:00 PM, Sat 9:00 AM-5:00 PM, Sun 9:00 AM-4:00 PM",
    "main_pool": "25m pool for lap swimming and recreation",
    "adjustable_pool": "16m pool with adjustable bottom (primarily lessons, public when available)",
    "children_pool": "Shallow pool with play features",
    "waterslides": "3 slides: 12m open slide, 33m & 43m enclosed tube slides",
    "hot_tubs": "3 hot tubs (38-42°C / 100-108°F)",
    "cold_plunge": "Cold tub for contrast bathing",
    "wellness": "Steam room",
    "fitness_partnership": "World Class gym membership includes pool access",
    "municipality": "Mosfellsbær (pop. ~12,000), 15km east of Reykjavík",
    "nearby_attractions": "Esjan mountain, Víðgelmir lava cave, highland access"
  }
}
