{
  "name": "Matur og Drykkur - Traditional Icelandic with Modern Twists",
  "description": "Matur og Drykkur (Food and Drink) stands as one of Reykjavík's most authentic celebrations of traditional Icelandic cuisine, preserving centuries-old recipes and cooking techniques while applying modern culinary innovation to create dishes that honor Iceland's food heritage without being bound by it—the restaurant's mission centers on reviving and reinterpreting dishes from Icelandic cookbook history, particularly inspired by Helga Sigurðardóttir's influential cookbook from which the restaurant takes its name. Located at Grandagarður 2 in Reykjavík's harbor area known locally as Grandi, the restaurant occupies a former salt fish factory near the Saga Museum, choosing atmosphere and authenticity over downtown glitz—the working harbor location reflects Iceland's maritime heritage and provides immediate proximity to fishing boats that supply the day's catch. This family-run establishment earned recognition in the 2025 Michelin Guide Iceland for culinary excellence that showcases Iceland's unique food culture shaped by harsh climate, isolation, and resourcefulness that required preserving summer's bounty through winter's darkness using fermentation, pickling, smoking, drying, and other techniques that created distinctive flavors unfamiliar to visitors from temperate regions. The ten-course tasting menu reflects current seasons and incorporates foraged wild herbs and seaweed gathered from Icelandic coastlines and mountains, collaborating with local farmers to obtain the best possible ingredients that meet the restaurant's standards for quality, freshness, and authenticity. Dishes draw inspiration from traditional Icelandic cuisine but receive modern interpretation that makes them accessible to contemporary palates while retaining essential character—cod liver with rowan berries combines a protein traditionally eaten out of necessity with tart wild berries creating sweet-savory complexity; Arctic char with smoked buttermilk and beer mustard showcases Iceland's abundant cold-water fish prepared with fermented dairy that has sustained Icelanders for generations; warm rye bread soup with ice cream transforms dense, slightly sweet Icelandic rye bread into dessert that surprises diners while celebrating a staple that sustained rural families through long winters. The restaurant cannot offer vegan, gluten-free, or lactose-free menus due to the fundamental role that animal products and dairy play in traditional Icelandic cuisine—this limitation reflects culinary honesty rather than inflexibility, as authentic Icelandic food culture developed around sheep, fish, and dairy that provided essential nutrition in a climate where plant cultivation remained challenging until recent decades. Operating Thursday through Sunday from 18:00 to 23:00 (6:00 PM to 11:00 PM), the limited schedule allows the kitchen to focus on quality and freshness while giving the family-run operation sustainable work-life balance. The harbor location in a converted salt fish factory creates atmospheric dining where industrial heritage meets culinary artistry—exposed beams, minimal decoration, and warehouse-style space emphasize that the food, not flashy design, constitutes the main attraction. The restaurant's commitment to preserving and celebrating traditional Icelandic recipes while making them relevant and delicious for modern diners serves both cultural preservation and culinary innovation, offering visitors authentic taste of Iceland's food heritage that extends beyond Viking clichés to embrace the ingenious, flavorful cuisine that sustained Icelanders through centuries of isolation and hardship.",
  "address": "Grandagarður 2, 101 Reykjavík (Grandi harbor area, near Saga Museum)",
  "coordinates": {
    "longitude": -21.9543,
    "latitude": 64.1522,
    "altitude": 3.0
  },
  "rating": 4.6,
  "reviews_count": 2180,
  "category": "Restaurant",
  "website": "https://en.maturogdrykkur.is",
  "phone": "+354 571 8877",
  "images": [
    "https://maturogdrykkur.is/images/harbor-factory.jpg"
  ],
  "opening_hours": {
    "thursday_sunday": "18:00 - 23:00 (6:00 PM - 11:00 PM)",
    "closed": "Monday, Tuesday, Wednesday",
    "michelin_guide": "Listed in 2025 Michelin Guide Iceland",
    "cuisine": "Traditional Icelandic with modern interpretation",
    "tasting_menu": "10 courses reflecting current season",
    "signature_dishes": "Cod liver with rowan berries, Arctic char with smoked buttermilk & beer mustard, warm rye bread soup with ice cream",
    "ingredients": "Foraged wild herbs, seaweed, local farm products, fresh fish",
    "philosophy": "Preserve old Icelandic recipes, modern twists, Helga Sigurðardóttir cookbook inspiration",
    "family_run": "Family-run establishment",
    "dietary_restrictions": "Cannot accommodate vegan, gluten-free, or lactose-free due to traditional cuisine nature",
    "location_character": "Former salt fish factory, Grandi harbor area, working maritime atmosphere",
    "setting": "Industrial heritage space, minimal decoration, focus on food not flashy design",
    "collaboration": "Local farmers for best ingredients",
    "foraging": "Wild herbs and seaweed gathered from Icelandic nature",
    "cultural_mission": "Preserve Icelandic food heritage while making it relevant for modern diners",
    "nearby": "Saga Museum, working harbor, fishing boats"
  }
}
