{
  "name": "Micro Bar - Reykjavík's First Craft Beer Bar",
  "description": "Micro Bar holds distinction as Reykjavík's first craft beer bar, pioneering the city's artisan beer culture by opening when Icelandic brewing remained dominated by major brewery products and craft beer consciousness barely existed—this first-mover advantage established Micro Bar as essential destination for serious beer enthusiasts while the bar's longevity and continued relevance demonstrate sustained commitment to quality and curation rather than resting on historical significance. Located in the cellar at Vesturgata 2, the below-ground setting creates intimate, cave-like atmosphere where exposed stone walls, dim lighting, and compact space encourage conversation and beer appreciation over loud music and party atmosphere that characterizes Iceland's mainstream nightlife. The owner also operates Gæðingur brewery, creating vertical integration where ownership controls both production and retail, ensuring fresh beer supply while providing direct feedback channel from customers to brewing team who can adjust recipes, timing, and packaging based on firsthand market response. The selection features both Gæðingur's own beers and carefully chosen offerings from other Icelandic craft breweries, creating comprehensive showcase of Iceland's brewing scene that allows visitors to sample multiple producers without visiting separate locations. With 10 rotating taps, the choices range from Icelandic microbrews to unique international offerings, ensuring variety and preventing stagnation where same beers occupy taps indefinitely—this rotation rewards repeat visits as new arrivals and seasonal releases create ever-changing experience. The truly exceptional depth comes from the bottle selection: over 200 different beers represent years of curation, international sourcing, and storage management that transforms Micro Bar from simple taproom to comprehensive beer library where obscure styles, rare releases, and international cult favorites become accessible to Icelandic beer geeks who otherwise face limited selection. The beer tasting flights provide affordable entry point for visitors uncertain about committing to full pints: 5-beer flights cost 4,000 ISK while 10-beer flights run 6,000 ISK, allowing systematic exploration of styles, breweries, and flavor profiles while minimizing waste if particular beers disappoint. This educational approach serves craft beer's growth by converting casual drinkers into informed enthusiasts who develop preferences and expand comfort zones. Happy hour every day 3:00-6:00 PM addresses Iceland's notoriously expensive alcohol prices that shock visitors accustomed to cheaper beer in home markets—the discounts make craft beer accessible to budget-conscious travelers and locals who appreciate quality but cannot afford premium prices throughout evenings. Operating hours Monday-Thursday 4:00 PM-12:30 AM, Friday 4:00 PM-12:30 AM, Saturday 1:00 PM-12:30 AM, Sunday 1:00 PM-12:30 AM provide afternoon and evening access with weekend earlier opening accommodating day-drinking culture. The cellar location at Vesturgata 2 places Micro Bar in downtown Reykjavík's compact bar district where multiple venues cluster within easy walking distance, allowing bar-hopping that characterizes Icelandic nightlife—locals typically visit several establishments throughout evenings rather than remaining in single location.",
  "address": "Vesturgata 2 (cellar), 101 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9425,
    "latitude": 64.1478,
    "altitude": -3.0
  },
  "rating": 4.7,
  "reviews_count": 2640,
  "category": "Craft Beer Bar",
  "website": "https://gaedingur.beer/en/pages/microbar-reykjavik",
  "phone": "+354 865 8989",
  "images": [
    "https://gaedingur.beer/images/micro-bar-cellar.jpg"
  ],
  "opening_hours": {
    "monday_thursday": "4:00 PM - 12:30 AM",
    "friday": "4:00 PM - 12:30 AM",
    "saturday": "1:00 PM - 12:30 AM",
    "sunday": "1:00 PM - 12:30 AM",
    "happy_hour": "Every day 3:00 PM - 6:00 PM",
    "pioneer_status": "Reykjavík's first craft beer bar",
    "owner": "Also operates Gæðingur brewery - vertical integration",
    "draft_taps": "10 rotating taps - Icelandic microbrews and international offerings",
    "bottle_selection": "200+ different beers - comprehensive beer library",
    "tasting_flights": "5 beers for 4,000 ISK, 10 beers for 6,000 ISK",
    "flight_purpose": "Affordable exploration, educational approach, minimize waste",
    "selection_curation": "Gæðingur's own beers plus other Icelandic craft breweries",
    "atmosphere": "Below-ground cellar, intimate cave-like setting, exposed stone walls",
    "character": "Dim lighting, compact space, conversation-focused over loud music",
    "rotation_benefit": "Changing taps reward repeat visits, prevent stagnation",
    "happy_hour_purpose": "Address Iceland's expensive alcohol prices, accessibility",
    "location": "Downtown bar district, easy bar-hopping distance",
    "educational_mission": "Convert casual drinkers to informed enthusiasts",
    "depth": "Rare releases, obscure styles, international cult favorites accessible",
    "feedback_loop": "Owner brewery receives direct customer input for recipe adjustments",
    "longevity": "Sustained relevance beyond first-mover historical significance"
  }
}
