{
  "name": "Micro Bar - Reykjavík's First Craft Beer Bar",
  "description": "Micro Bar holds distinction as Reykjavík's first craft beer bar, pioneering the city's artisan beer culture by opening when Icelandic brewing remained dominated by major brewery products and craft beer consciousness barely existed—this first-mover advantage established Micro Bar as essential destination for serious beer enthusiasts while the bar's longevity and continued relevance demonstrate sustained commitment to quality and curation rather than resting on historical significance. Located in the cellar at Vesturgata 2, the below-ground setting creates intimate, cave-like atmosphere where exposed stone walls, dim lighting, and compact space encourage conversation and beer appreciation over loud music and party atmosphere that characterizes Iceland's mainstream nightlife. The owner also operates Gæðingur brewery, creating vertical integration where ownership controls both production and retail, ensuring fresh beer supply while providing direct feedback channel from customers to brewing team who can adjust recipes, timing, and packaging based on firsthand market response. The selection features both Gæðingur's own beers and carefully chosen offerings from other Icelandic craft breweries, creating comprehensive showcase of Iceland's brewing scene that allows visitors to sample multiple producers without visiting separate locations.",
  "address": "Vesturgata 2 (cellar), 101 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9425,
    "latitude": 64.1478,
    "altitude": -3.0
  },
  "rating": 4.7,
  "reviews_count": 2640,
  "category": "Craft Beer Bar",
  "website": "https://gaedingur.beer/en/pages/microbar-reykjavik",
  "phone": "+354 865 8989",
  "images": [
    "https://gaedingur.beer/images/micro-bar-cellar.jpg"
  ],
  "opening_hours": {
    "monday_thursday": "4:00 PM - 12:30 AM",
    "friday": "4:00 PM - 12:30 AM",
    "saturday": "1:00 PM - 12:30 AM",
    "sunday": "1:00 PM - 12:30 AM",
    "happy_hour": "Every day 3:00 PM - 6:00 PM",
    "pioneer_status": "Reykjavík's first craft beer bar",
    "owner": "Also operates Gæðingur brewery - vertical integration",
    "draft_taps": "10 rotating taps - Icelandic microbrews and international offerings",
    "bottle_selection": "200+ different beers - comprehensive beer library",
    "tasting_flights": "5 beers for 4,000 ISK, 10 beers for 6,000 ISK",
    "flight_purpose": "Affordable exploration, educational approach, minimize waste",
    "selection_curation": "Gæðingur's own beers plus other Icelandic craft breweries",
    "atmosphere": "Below-ground cellar, intimate cave-like setting, exposed stone walls",
    "character": "Dim lighting, compact space, conversation-focused over loud music",
    "rotation_benefit": "Changing taps reward repeat visits, prevent stagnation",
    "happy_hour_purpose": "Address Iceland's expensive alcohol prices, accessibility",
    "location": "Downtown bar district, easy bar-hopping distance",
    "educational_mission": "Convert casual drinkers to informed enthusiasts",
    "depth": "Rare releases, obscure styles, international cult favorites accessible",
    "feedback_loop": "Owner brewery receives direct customer input for recipe adjustments",
    "longevity": "Sustained relevance beyond first-mover historical significance"
  }
}