{
  "name": "Mosfellsbær - Gateway to Nature & Sagas",
  "description": "Mosfellsbær positions northeastern Greater Reykjavík where approximately 12,000 residents inhabit transitional zone between urban capital landscapes rural countryside accessing Esjan mountain hiking trails Mosfellsdalur valley routes establishing outdoor recreation hub commuter town character serving residents seeking nature proximity metropolitan employment opportunities creating balanced lifestyle combining career advancement wilderness access characteristic modern Icelandic living aspirations prioritizing work-life balance natural environment engagement. Gljúfrasteinn museum preserves Nobel Prize-winning author Halldór Laxness's former residence where Iceland's literary giant lived worked 1945-1998 creating substantial portion his celebrated works earning 1955 Nobel Literature Prize establishing Iceland's premier literary heritage site maintaining authentic mid-century home environment including writing studio personal library gardens creating immersive experience understanding Iceland's most influential 20th-century cultural figure whose works defined modern Icelandic literature global recognition. Esjan mountain looms dramatically western boundary establishing iconic Reykjavík skyline feature while municipal territory provides primary trail access popular Þverfellshorn summit route where 914-meter peak attracts weekend hikers enjoying panoramic capital region views Faxaflói Bay vistas rewarding 3-4 hour moderate hikes demonstrating Mosfellsbær's strategic position accessing premier hiking destinations convenient metropolitan locations enabling same-day nature excursions without extensive travel commitments characteristic urban-adjacent mountain access.",
  "address": "Mosfellsbær, 270 Capital Region, Iceland (northeast of Reykjavík)",
  "coordinates": {
    "longitude": -21.6897,
    "latitude": 64.1639,
    "altitude": 35.0
  },
  "rating": 4.4,
  "reviews_count": 3450,
  "category": "Town - Capital Region",
  "website": "https://www.mosfellsbaer.is/en",
  "phone": "+354 525 6700",
  "images": [
    "https://www.mosfellsbaer.is/images/mosfellsbaer-town.jpg"
  ],
  "opening_hours": {
    "population": "~12,000",
    "location": "Northeast Reykjavík, gateway to Esjan mountain",
    "gljufrasteinn": "Halldór Laxness museum (Nobel Prize author 1955)",
    "esjan_access": "Primary trails to Þverfellshorn (914m)",
    "alafoss": "Historic wool factory outlet, lopapeysur sweaters",
    "varma_river": "Salmon fishing, geothermal features",
    "character": "Outdoor recreation, literary heritage, urban-rural balance"
  }
}