{
  "name": "Museum of Design and Applied Art",
  "description": "The Museum of Design and Applied Art (Hönnunarsafn Íslands) is Iceland's national design museum, dedicated to collecting, preserving, and exhibiting Icelandic design and applied arts. Established in 1998, the museum showcases the evolution of Icelandic design from the early 20th century to contemporary practice, including furniture, textiles, ceramics, glassware, industrial design, and graphic design. The museum's collection highlights how Icelandic designers have drawn inspiration from the nation's dramatic landscape, Nordic design traditions, and unique cultural heritage to create distinctive aesthetic expressions. The institution plays a crucial role in documenting Iceland's design history and promoting design awareness among the public.\n\nThe museum's permanent collection features works by Iceland's most influential designers, including furniture by Einar Árnason and Gunnlaugur Halldórsson, ceramics by Guðmundur Einarsson, and textiles by contemporary designers. Rotating exhibitions explore specific themes, designers, or design movements, often featuring international design alongside Icelandic works to provide context and comparison. The museum has hosted exhibitions on topics ranging from mid-century Icelandic modernism to contemporary sustainable design practices. Interactive displays allow visitors to understand design processes and the relationship between form, function, and cultural context. The museum also maintains an extensive archive of design drawings, prototypes, and documentation that serves as an important research resource.\n\nThe museum is located at Garðatorg in Garðabær, just south of Reykjavík, in a modern building that exemplifies contemporary Icelandic architecture and design principles. The bright, minimalist exhibition spaces provide an ideal setting for displaying design objects. The museum is open Tuesday through Sunday with modest admission fees. Regular programs include design workshops, lectures by designers, and family-friendly activities that introduce children to design thinking. The museum shop offers curated Icelandic design products, books, and gifts. Public transportation and parking are readily available, making the museum easily accessible from central Reykjavík within a 15-minute drive.",
  "category": "Museum",
  "coordinates": {
    "latitude": 64.088611,
    "longitude": -21.927778,
    "altitude": 25.0
  },
  "website": "https://honnunarsafn.is",
  "phone": "+354 512 1525",
  "rating": 4.3,
  "reviews_count": 180,
  "opening_hours": "Tuesday-Sunday: 12:00-17:00; Monday: Closed"
}
