{
  "name": "National Museum of Iceland",
  "description": "The National Museum of Iceland (Þjóðminjasafn Íslands) is the country's premier institution for preserving and presenting Icelandic cultural heritage, located at Suðurgata 41 in central Reykjavík, just east of the picturesque Tjörnin lake. Established in 1863, the museum houses over 2,000 carefully curated artifacts spanning Iceland's entire history from the Viking Age settlement in 874 AD through the medieval period, Danish rule, independence movement, and into the modern era. The permanent exhibition, \"Making of a Nation - Heritage and History in Iceland,\" provides comprehensive insight into how Icelandic society, culture, and national identity evolved over 1,100 years through archaeological finds, historical objects, photographs, and multimedia presentations. The chronological journey begins with the Viking Age, displaying artifacts from settlement-era graves including weapons, jewelry, tools, and the remarkable Valþjófsstaður church door from approximately 1200 AD, one of Iceland's most treasured medieval artworks carved with intricate scenes from a knight's saga. The medieval section explores Iceland's conversion to Christianity in the year 1000, the Commonwealth period when the Alþingi parliament governed without a king, and the creation of the Icelandic sagas—medieval prose narratives that are Iceland's most significant contribution to world literature. The museum documents the challenging centuries under Norwegian and later Danish rule from 1262 onwards.",
  "address": "Suðurgata 41, 102 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9481,
    "latitude": 64.142,
    "altitude": 0.0
  },
  "rating": 4.6,
  "reviews_count": 3800,
  "category": "Museum",
  "website": "https://www.thjodminjasafn.is/en",
  "phone": "+354 530 2200",
  "images": [
    {
      "source": "National Museum Official",
      "url": "https://www.thjodminjasafn.is/en"
    },
    {
      "source": "Visit Reykjavík",
      "url": "https://visitreykjavik.is/service/national-museum-iceland"
    }
  ],
  "opening_hours": {
    "summer_daily": "Daily 10:00-17:00 (May 1 - September 15)",
    "winter": "Daily 10:00-17:00, closed Mondays (September 16 - April 30)",
    "cafe": "11:00-16:00 daily when museum open",
    "guided_tours": "Free tour every Saturday 11:00 AM, included with admission",
    "admission_adults": "2,500 ISK (approximately $18 USD)",
    "admission_students": "1,500 ISK with valid student ID",
    "admission_children": "Free for visitors 17 and younger",
    "combo_ticket": "Valid for both National Museum and Culture House (Safnahúsið)",
    "audio_guide": "Included with admission in multiple languages",
    "parking": "Free parking for museum visitors",
    "permanent_exhibition": "Making of a Nation - Heritage and History in Iceland (2,000+ artifacts)",
    "collection_highlights": "Valþjófsstaður church door (c. 1200), Viking Age artifacts, medieval manuscripts, independence movement documents",
    "temporary_exhibitions": "Rotating exhibits on Icelandic culture, archaeology, contemporary art, thematic history",
    "established": "1863, Iceland's premier cultural heritage institution",
    "museum_shop": "Icelandic history books, artifact replicas, design products, educational materials",
    "accessibility": "Wheelchair accessible, family-friendly, suitable for all ages"
  }
}