{
  "name": "Ölfusá Bridge",
  "description": "The Ölfusá Bridge is a historic steel truss bridge crossing the Ölfusá river where it flows into the Atlantic Ocean near Þorlákshöfn in South Iceland. Originally built in 1891, the bridge represents one of Iceland's earliest major infrastructure projects and has been crucial to connecting the southwestern region with the rest of the country. The current bridge, rebuilt and reinforced multiple times over the decades, carries Route 1 (Ring Road) across the river, maintaining its importance as a vital transportation link. The Ölfusá is Iceland's largest river by volume (averaging 400 m³/s), though it is only 25 kilometers long, formed by the confluence of the Hvítá and Sog rivers.\n\nThe bridge area holds significant historical importance beyond its transportation function. The site has been a river crossing point for over a millennium, with medieval sources mentioning fords here. The construction of the first permanent bridge in 1891 was a major achievement for Iceland, which at the time had virtually no modern infrastructure. Subsequent reconstructions in 1945 and 1970 modernized the structure while preserving elements of historical design. The bridge provides views of the powerful river flowing from Þingvallavatn lake through the fertile Ölfus region to the sea. During salmon runs, the river attracts anglers, and the estuary is important for bird life.\n\nThe Ölfusá Bridge is located on Route 1 approximately 50 kilometers southeast of Reykjavík and 10 kilometers inland from Þorlákshöfn port town. The bridge is accessible year-round as part of the Ring Road. Small parking areas on both approaches allow brief stops, though space is limited and the bridge carries heavy traffic. The area offers picturesque views of the river, surrounding farmland, and on clear days, distant mountains. Nearby Selfoss town (10 km north) provides services. The bridge area has become significant in discussions of renewable energy, as the river system has been considered for hydroelectric development.",
  "category": "Bridge",
  "coordinates": {
    "latitude": 63.943889,
    "longitude": -21.172222,
    "altitude": 5.0
  },
  "rating": 4.2,
  "reviews_count": 210,
  "opening_hours": "Open 24/7 (Ring Road bridge)"
}
