{
  "name": "VOX Restaurant",
  "description": "VOX Restaurant is the signature fine dining restaurant at the Hilton Reykjavík Nordica hotel, offering an upscale culinary experience that showcases the best of Icelandic ingredients prepared with international technique and creativity. Since opening, VOX has established itself as one of Reykjavík's premier dining destinations, earning recognition for its sophisticated menu, excellent wine program, and elegant atmosphere. The restaurant's culinary philosophy centers on using Iceland's exceptional raw materials—pristine seafood, grass-fed lamb, wild game, and foraged ingredients—and presenting them with modern European culinary techniques and beautiful plating. The menu changes seasonally and often features dishes that highlight the unique characteristics of Icelandic ingredients while drawing inspiration from global cuisine.\n\nThe restaurant's interior is elegant and contemporary, with floor-to-ceiling windows that provide natural light during Iceland's bright summer evenings and views of the surrounding area. The dining room creates an atmosphere of refined comfort rather than intimidating formality, with attentive service that enhances rather than overwhelms the dining experience. VOX offers both à la carte options and tasting menus, including a comprehensive multi-course experience that takes diners on a culinary journey through Iceland's seasons and flavors. The wine list is extensive and thoughtfully curated, featuring both Old World classics and New World wines selected to pair beautifully with the Nordic-focused menu. The restaurant also maintains an impressive selection of Icelandic craft beers and spirits for those preferring local beverages.\n\nDining at VOX appeals to visitors seeking a refined culinary experience that demonstrates Iceland's maturation as a gastronomic destination. The restaurant has received numerous accolades and consistently high ratings from both professional critics and diners. While VOX represents a significant investment compared to more casual dining options, the quality of ingredients, skillful preparation, and overall experience justify the price for special occasion dining or for food enthusiasts wanting to experience Iceland's haute cuisine scene. The restaurant's location in the Hilton Nordica hotel, slightly outside the downtown core, means it attracts a mix of hotel guests and Reykjavík residents celebrating special occasions. Reservations are essential, particularly for weekend dining. For wine enthusiasts, VOX occasionally hosts special wine dinners and tasting events that pair exceptional wines with carefully crafted menus, providing memorable culinary experiences that showcase the sophisticated side of Iceland's dining scene.",
  "category": "Restaurant",
  "coordinates": {
    "latitude": 64.141667,
    "longitude": -21.896944,
    "altitude": 20.0
  },
  "rating": 4.5,
  "reviews_count": 1678,
  "opening_hours": "Dinner Tuesday-Saturday 18:00-22:00 (last seating around 21:00). Closed Sunday-Monday. Reservations strongly recommended."
}
