{
  "name": "Pakkhús Restaurant - Höfn's Langoustine Capital Seafood",
  "description": "Pakkhús Restaurant occupies a prime harborside location in Höfn, southeast Iceland's lobster capital where local fishing boats land some of the world's finest langoustines (Nephrops norvegicus, marketed internationally as \"Iceland lobster\" though technically a large prawn species), creating direct supply chain from boat to kitchen that ensures exceptional freshness and quality while supporting the fishing industry that sustains Höfn's 2,200 residents and defines the town's economy and identity. The restaurant's name \"Pakkhús\" means \"warehouse\" in Icelandic, referencing both the building's historical use as harbor storage facility and the restaurant's current role as repository for the region's exceptional seafood bounty. Operating daily 12:00 PM to 10:00 PM when open (note: the restaurant was temporarily closed in late 2025 with planned February 2026 reopening, so visitors should verify current status before making special trips), Pakkhús serves lunch and dinner to tourists driving the Ring Road and locals celebrating special occasions or hosting visiting friends and family. The menu showcases langoustines prepared multiple ways that highlight the sweet.",
  "address": "Krosseyjarvegur 3, 780 Höfn, Iceland (harbor location)",
  "coordinates": {
    "longitude": -15.209,
    "latitude": 64.2536,
    "altitude": 2.0
  },
  "rating": 4.6,
  "reviews_count": 3880,
  "category": "Restaurant",
  "website": "https://pakkhus.is",
  "phone": "+354 478 2280",
  "images": [
    "https://pakkhus.is/images/langoustine-platter.jpg"
  ],
  "opening_hours": {
    "regular_hours": "Daily 12:00 PM - 10:00 PM (when operating)",
    "status_note": "Temporarily closed late 2025, planned February 2026 reopening - verify status",
    "reservations": "No reservations - first-come, first-served",
    "waiting_area": "Cozy bar and lower-level waiting area with harbor views",
    "specialty": "Langoustines (Nephrops norvegicus) from local Höfn boats",
    "langoustine_soup": "Cream of langoustine soup with herb oil, fried langoustines, house bread, whipped butter",
    "langoustine_wine": "300g langoustine tails & whole baked in creamy white wine sauce, salad, potatoes, bread",
    "lobster_tails": "400g Atlantic lobster tails (3 pieces) oven-grilled in garlic & butter, corn, hollandaise",
    "langoustine_pizza": "Premium ingredient in casual preparation, accessible format",
    "other_seafood": "Local fish soup, salted cod (historical preservation tradition)",
    "meat_options": "Lamb from Icelandic highlands, duck, pork",
    "name_meaning": "Pakkhús = warehouse (historical harbor storage facility)",
    "direct_supply": "Fishing boats land catches directly at Höfn harbor, exceptional freshness",
    "höfn_reputation": "Lobster/langoustine capital of Iceland",
    "town_economy": "Fishing industry sustains 2,200 residents, defines identity",
    "view": "Harborside with Vatnajökull glacier backdrop (Europe's largest ice cap)",
    "location_advantage": "Ring Road obligatory stop, southeast Iceland exploration",
    "clientele": "Tourists driving Ring Road + locals + langoustine enthusiasts making pilgrimages",
    "egalitarian_seating": "No reservations reflects Icelandic values - no preferential treatment",
    "atmosphere": "Casual to upscale, harbor warehouse character"
  }
}