{
  "name": "Petra's Stone and Mineral Collection (Steinasafn Petru)",
  "description": "Petra's Stone and Mineral Collection in the tiny East Iceland village of Stöðvarfjörður represents one of Iceland's most remarkable and touching museums—a lifetime's passionate accumulation of stones, minerals, and geological specimens assembled over decades by Petra María Sveinsdóttir (1922-2012), a local woman with no formal geological training but an extraordinary eye for beauty and an obsessive dedication to gathering Iceland's mineral wealth. What began as childhood fascination with colorful pebbles grew into a consuming passion that led Petra to roam the mountains, beaches, and volcanic landscapes of East Iceland for over 70 years, collecting specimens that caught her eye for their colors, shapes, crystal formations, or geological interest. By her death at age 89, Petra had amassed a staggering collection of tens of thousands of specimens—some sources estimate 70,000-100,000 pieces—that fill every available surface, shelf, table, and display case in her former home and adjacent buildings, creating an almost overwhelming visual experience of color, texture, and geological diversity. The collection includes spectacular examples of Iceland's volcanic minerals: zeolites in every color from white through yellow.",
  "address": "Fjarðarbraut 21, 755 Stöðvarfjörður, East Iceland",
  "coordinates": {
    "longitude": -13.8833,
    "latitude": 64.8333,
    "altitude": 5.0
  },
  "rating": 4.5,
  "reviews_count": 1780,
  "category": "Museum",
  "website": "https://www.steinapetra.is",
  "phone": "+354 475 8834",
  "images": [
    "https://www.steinapetra.is/images/stone-collection-display.jpg"
  ],
  "opening_hours": {
    "may_october": "May 1 - October 15 (or 31), daily 9:00 AM - 5:00 PM (or 6:00 PM)",
    "winter": "October 15 - April 30, Monday-Friday 9:00 AM - 3:00 PM",
    "admission_adults": "2,000 ISK (ages 14+)",
    "group_discount": "15% discount for groups of 10+",
    "wheelchair_accessible": "Yes",
    "cafe": "Café Sunnó serves soup, sandwiches, pastries, coffee",
    "collection_size": "Tens of thousands of specimens (estimates 70,000-100,000)",
    "collector": "Petra María Sveinsdóttir (1922-2012)",
    "collecting_period": "Over 70 years of gathering",
    "display_method": "Arranged by color and aesthetics rather than scientific classification",
    "location_note": "In collector's former home, preserved as she left it"
  }
}