{
  "name": "Icelandic Phallological Museum - World's Only Penis Museum",
  "description": "The Icelandic Phallological Museum holds the unique distinction of being the world's only museum dedicated exclusively to phallology (the scientific study of the penis), housing the planet's largest collection of penises and penile parts with over 300 specimens representing more than 100 different mammal species. Located in downtown Reykjavík at Hafnartorg Square near the harbor, this one-of-a-kind museum presents what could easily be dismissed as a novelty attraction with unexpected scientific rigor, educational context, and even artistic sensibility, creating an experience that manages to be simultaneously educational, fascinating, humorous, and genuinely unique. The collection began in 1974 when Sigurður Hjartarson, then a teacher and historian, received his first specimen—a bull's penis used as an ox-whip—as a joke gift, sparking what would become a lifelong passion for assembling this extraordinary collection. Over the following decades, Hjartarson methodically acquired specimens from Icelandic mammals including whales, seals, walruses, polar bears, foxes, minks, and all land and marine mammals found in Iceland, as well as donations from around the world including elephants, giraffes, and primates. The museum's crown jewels include massive whale penises up to 170 centimeters long and weighing 70 kilograms, displayed alongside tiny hamster specimens barely visible to the naked eye, creating startling contrasts in size and biological diversity.",
  "address": "Kalkofnsvegur 2, 101 Reykjavík, Iceland (Hafnartorg Square)",
  "coordinates": {
    "longitude": -21.9456,
    "latitude": 64.1478,
    "altitude": 0.0
  },
  "rating": 4.3,
  "reviews_count": 3850,
  "category": "Museum",
  "website": "https://www.phallus.is",
  "phone": "+354 561 6663",
  "images": [
    "https://www.phallus.is/images/exterior-harbor.jpg"
  ],
  "opening_hours": {
    "daily": "10:00 AM - 7:00 PM",
    "admission_adults": "2,750-3,300 ISK (approximately $20-25 USD)",
    "admission_children": "Free (13 and under)",
    "admission_seniors": "Reduced rate available",
    "reykjavik_city_card": "20% discount",
    "collection_size": "300+ specimens from 100+ species",
    "founded": "1974 (current location since 2011)",
    "awards": "Featured in international media and documentaries"
  }
}