{
  "name": "Reykjavík Art Museum",
  "description": "Reykjavík Art Museum (Listasafn Reykjavíkur) is the largest visual art institution in Iceland, operating three distinct locations across the capital city, each with its own character, collection focus, and architectural identity. A single admission ticket grants 24-hour access to all three buildings, allowing visitors to explore the full breadth of Icelandic and contemporary international art across multiple venues. Hafnarhús, located at Tryggvagata 17 by the Old Harbour, occupies a six-story former warehouse designed by Studio Grandi Architects and transformed into a striking contemporary art space. The building's industrial architecture—exposed concrete, high ceilings, and flexible gallery spaces—provides an ideal setting for cutting-edge contemporary art exhibitions. Hafnarhús permanently displays works from the Erró collection, featuring pop art and surrealist paintings by Icelandic-French artist Erró (Guðmundur Guðmundsson, born 1932), whose colorful, densely layered works incorporate imagery from comic books, advertising, and art history. The museum also presents rotating exhibitions of contemporary Icelandic and international artists working in diverse media including painting, sculpture, installation, video, and performance art. Kjarvalsstaðir, opened in 1973 in Klambratún park, is dedicated to Jóhannes Sveinsson Kjarval (1885-1972), Iceland's most beloved painter.",
  "address": "Three locations: Hafnarhús (Tryggvagata 17), Kjarvalsstaðir (Flókagata), Ásmundarsafn (Sigtún)",
  "coordinates": {
    "longitude": -21.9436,
    "latitude": 64.1478,
    "altitude": 0.0
  },
  "rating": 4.6,
  "reviews_count": 4200,
  "category": "Art Museum",
  "website": "https://listasafnreykjavikur.is/en",
  "phone": "+354 411 6400",
  "images": [
    "https://listasafnreykjavikur.is/en",
    "https://visitreykjavik.is/reykjavik-art-museum-hafnarhus"
  ],
  "opening_hours": {
    "admission": "Single ticket valid 24 hours for all three locations",
    "hafnarhus": "Tryggvagata 17, contemporary art, Erró collection permanent display, former warehouse",
    "hafnarhus_focus": "Cutting-edge contemporary art, rotating exhibitions, pop art and surrealism",
    "kjarvalsstadir": "Flókagata, Klambratún park, opened 1973, Jóhannes Kjarval permanent collection",
    "kjarvalsstadir_focus": "Jóhannes Kjarval (1885-1972) landscapes, Icelandic/Nordic artist exhibitions",
    "asmundarsafn": "Sigtún, Laugardalur, sculptor's home/workshop, sculpture garden",
    "asmundarsafn_focus": "Ásmundur Sveinsson (1893-1982) sculptures, saga figures, abstract forms",
    "erro_collection": "Permanent at Hafnarhús - pop art by Icelandic-French artist Erró (b. 1932)",
    "kjarval_collection": "Permanent at Kjarvalsstaðir - beloved painter's landscapes with folklore elements",
    "asmundur_collection": "Permanent at Ásmundarsafn - monumental bronze/concrete/stone sculptures in garden",
    "hafnarhus_architecture": "Repurposed industrial warehouse by Studio Grandi Architects, six stories",
    "kjarvalsstadir_architecture": "1973 modernist building by Hannes Kró Kristjánsson in city park",
    "asmundarsafn_architecture": "Artist-designed white-domed structure inspired by Mediterranean/turf houses",
    "museum_night": "Annual Reykjavík Museum Night with special programming and free admission",
    "collection_scope": "Largest visual art institution in Iceland, traditional to contemporary art",
    "temporary_exhibitions": "Rotating shows at all three venues featuring Icelandic and international artists"
  }
}
