{
  "name": "Rjúkandi (Rjúkandafoss) - Iceland's 12th Tallest Waterfall",
  "description": "Rjúkandi, also known as Rjúkandafoss, ranks as Iceland's 12th tallest waterfall with an impressive total drop of 93 meters (305 feet), making it a spectacular roadside attraction along the Ring Road in the scenic Jökuldalur valley of East Iceland. The waterfall descends in two dramatic steps from the Ysta-Rjúkandi river, which originates in the Sandfell mountain area: the upper tier drops 33 meters (109 feet) in a graceful veiling horsetail style where water spreads and partially breaks apart as it falls, followed by a more powerful lower plunge of 60 meters (196 feet) where the water leaps in a concentrated column before crashing into the pool below. This two-stage configuration creates dynamic visual interest, with each tier offering distinct character—the upper portion elegant and diffused, the lower portion powerful and thunderous. What makes Rjúkandi particularly appealing to travelers is its exceptional accessibility: the waterfall is visible directly from Iceland's Ring Road (Route 1) with a convenient pullover parking area allowing visitors to stop, photograph, and admire this natural wonder without any hiking required, making it one of the most accessible tall waterfalls in Iceland. The location within Jökuldalur valley, a broad glacial valley characterized by expansive views, meandering rivers, and dramatic mountain backdrops, provides a scenic setting that enhances the waterfall's visual impact. Rjúkandi sits roughly midway between two of East Iceland's major towns: Egilsstaðir (the regional capital and service hub) lies just 50 kilometers (31 miles) to the east.",
  "address": "Ring Road (Route 1), Jökuldalur valley, East Iceland (50 km west of Egilsstaðir)",
  "coordinates": {
    "longitude": -15.4667,
    "latitude": 65.2,
    "altitude": 320.0
  },
  "rating": 4.5,
  "reviews_count": 1280,
  "category": "Waterfall",
  "website": "https://www.east.is/en/rjukandi",
  "phone": null,
  "images": [
    "https://www.east.is/images/rjukandi-two-tiers.jpg"
  ],
  "opening_hours": {
    "access": "Year-round (visible from Ring Road)",
    "parking": "Pullover area directly off Route 1",
    "admission": "Free",
    "viewing": "Roadside - no hiking required",
    "total_height": "93 meters / 305 feet (12th tallest in Iceland)",
    "upper_tier": "33m / 109 feet (veiling horsetail style)",
    "lower_tier": "60m / 196 feet (concentrated plunge)",
    "distance_from_egilsstadir": "50 km (31 miles) west",
    "river_source": "Ysta-Rjúkandi river from Sandfell mountain"
  }
}