{
  "name": "Secret Lagoon",
  "description": "The Secret Lagoon, known in Icelandic as Gamla Laugin (\"The Old Pool\"), is a historic and atmospheric geothermal bathing pool located in the small village of Flúðir in South Iceland, approximately 100 kilometers from Reykjavík. Built in 1891, it holds the distinction of being Iceland's oldest swimming pool still in operation, predating modern spa culture by over a century. The pool is fed by a nearby hot spring that maintains a constant, comfortable water temperature of about 38-40°C (100-104°F) year-round. The natural setting is particularly special - the pool is surrounded by active geothermal features including bubbling hot springs, steaming fumaroles, and a small geyser called Litli-Geysir that erupts every few minutes, sending water a few meters into the air. Wooden boardwalks around the pool allow visitors to safely observe these geothermal wonders up close. The rustic, naturalistic design preserves the pool's historical character while modern amenities including changing rooms, showers, and a small bar/café ensure visitor comfort. Unlike some of Iceland's more commercialized spa destinations, the Secret Lagoon maintains an authentic, low-key atmosphere that evokes traditional Icelandic bathing culture. The site is particularly magical in winter when snow and ice frame the steaming pool.",
  "address": "Hvammsvegur, 845 Flúðir, Iceland",
  "coordinates": {
    "longitude": -20.3093383,
    "latitude": 64.1372373,
    "altitude": 0.0
  },
  "rating": null,
  "reviews_count": null,
  "category": "Geothermal Spa",
  "website": "https://secretlagoon.is",
  "phone": "+354 555 3351",
  "images": [
    {
      "source": "Google My Maps",
      "url": "https://mymaps.usercontent.google.com/hostedimage/m...phuZqH3hBIUmnwo3RfAmBkkxb1oGM3-QhcRp8W8?authuser=0&fife=s16383"
    }
  ],
  "opening_hours": {
    "general": "Typically open daily; standard opening 10:00–22:00 with seasonal variations. Check official website for current times."
  }
}
