{
  "name": "Selfoss - South Iceland's Largest Town",
  "description": "Selfoss is South Iceland's largest and fastest-growing town, with a population that surpassed the symbolic milestone of 10,000 residents for the first time in 2024, reaching approximately 10,420 inhabitants by 2025 and establishing itself as one of Iceland's most significant urban centers outside the capital region. Located approximately 50 kilometers (31 miles) southeast of Reykjavík along the Ring Road (Route 1), Selfoss occupies a strategic position on the banks of the Ölfusá River, Iceland's largest river by volume, where a bridge crossing has made the town a natural transportation and commercial hub connecting the capital area to the entire south coast. Originally a small farming community, Selfoss experienced rapid transformation in the 20th century, evolving into a thriving service, trade, and light industrial center that serves as the economic and administrative heart of South Iceland's agricultural regions. The town's growth has been driven by its excellent location as a commuter hub for people working in Reykjavík who prefer more affordable housing and small-town atmosphere, the development of the dairy and agricultural industries (with major dairy cooperatives and food processing facilities), and its role as the last major service center before travelers embark on Ring Road journeys around Iceland. Selfoss offers comprehensive amenities rare in rural Iceland.",
  "address": "Selfoss, 800 Árborg, Iceland",
  "coordinates": {
    "longitude": -20.9968,
    "latitude": 63.9339,
    "altitude": 15.0
  },
  "rating": 4.2,
  "reviews_count": 2150,
  "category": "Town",
  "website": "https://www.south.is/en/destinations/towns-regions/towns/selfoss",
  "phone": "+354 480 1900",
  "images": [
    "https://www.south.is/images/selfoss-town-bridge.jpg"
  ],
  "opening_hours": {
    "swimming_pool": "Daily 6:30 AM - 9:00 PM (varying hours weekends)",
    "shopping": "Most stores Monday-Friday 9:00 AM - 6:00 PM, Saturday 10:00 AM - 4:00 PM",
    "supermarkets": "Daily until 11:00 PM (major chains)",
    "tourist_information": "Summer daily 9:00 AM - 6:00 PM, winter reduced hours",
    "distance_from_reykjavik": "50 km (31 mi), approximately 40 minutes via Route 1",
    "population": "10,420 residents (2025), largest town in South Iceland",
    "gateway_to": "Golden Circle, South Coast, Ring Road journeys"
  }
}