{
  "name": "The Settlement Exhibition (Reykjavík 871±2)",
  "description": "The Settlement Exhibition (Landnámssýningin) presents one of Iceland's most important archaeological discoveries—a Viking Age longhouse from approximately 930-1000 AD preserved in its original location beneath downtown Reykjavík, offering visitors an extraordinary opportunity to stand beside authentic remains of Iceland's earliest permanent settlers. The exhibition's name, \"871±2,\" derives from precise volcanic tephra dating: during excavation in 2001, archaeologists discovered a layer of volcanic ash deposited across Iceland from a Torfajökull eruption dated to 871 AD (with a margin of error of plus or minus two years), beneath which they found wall remnants proving human habitation predated this eruption. This tephra layer serves as an exact time marker in Icelandic archaeology, allowing researchers to date structures and artifacts with unusual precision. The excavated longhouse represents one of the oldest structures found in Reykjavík, built using the traditional Viking Age technique of turf walls supported by timber frames, measuring approximately 20 meters long—substantial enough to house an extended family or small community. The exhibition preserves the longhouse foundation exactly where it was discovered, with carefully controlled environmental conditions preventing deterioration while allowing visitors to view the actual walls, post holes, and living surfaces that Viking Age Icelanders constructed and occupied over a millennium ago. Advanced museum technology enhances the experience: multimedia displays, 3D reconstructions, and augmented reality applications help visitors visualize how the longhouse appeared when occupied, showing the interior layout with sleeping benches, central hearth, storage areas, and the daily activities of cooking, weaving, tool-making, and socializing that filled these spaces. The exhibition contextualizes the longhouse within Iceland's broader settlement history, explaining the Landnám (land-taking) period from approximately 874-930 AD when Norwegian chieftains, Irish monks, and various settlers arrived in Iceland fleeing political turmoil in Scandinavia or seeking new opportunities. Archaeological evidence including Viking Age artifacts excavated from the site—tools, jewelry, animal bones, and everyday objects—provides insights into early Icelandic life, trade connections with Europe, farming practices, and the challenges of establishing permanent settlement in Iceland's harsh environment. The location itself is significant: the exhibition occupies a historic building on Aðalstræti (Main Street), one of Reykjavík's oldest streets, creating a direct physical connection between Iceland's Viking Age origins and its modern capital. Visitors descend from the contemporary city street into the excavated archaeological layers, literally traveling through time as they move from 21st-century Reykjavík to Viking Age foundations below.",
  "address": "Aðalstræti 16, 101 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9444,
    "latitude": 64.1475,
    "altitude": 0.0
  },
  "rating": 4.6,
  "reviews_count": 2650,
  "category": "Museum",
  "website": "https://www.reykjavikcitymuseum.is/settlement-exhibition",
  "phone": "+354 411 6370",
  "images": [
    "https://www.reykjavikcitymuseum.is/images/longhouse-excavation.jpg"
  ],
  "opening_hours": {
    "daily": "9:00 AM - 8:00 PM",
    "admission": "Check website for current pricing (combined ticket with other city museums)",
    "typical_visit": "Approximately 1 hour",
    "archaeological_date": "871±2 AD (tephra dating)",
    "longhouse_period": "Approximately 930-1000 AD",
    "discovery_year": "2001",
    "unique_feature": "Viking longhouse preserved in original location beneath downtown",
    "technology": "3D reconstructions, AR apps, multimedia displays"
  }
}
