{
  "name": "Settlement Center",
  "description": "The Settlement Center (Landnámssetur Íslands) is an award-winning interactive museum in Borgarnes dedicated to Iceland's Viking Age settlement and saga heritage, housed in a beautifully restored warehouse building on the town's historic harbor. Opened in 2006, the museum has become one of Iceland's premier cultural institutions, offering visitors an immersive journey into the nation's founding era through state-of-the-art multimedia exhibitions, authentic artifacts, and compelling storytelling. The center presents two distinct but complementary exhibitions, each designed to be experienced in approximately 30 minutes with included audioguides available in 15 languages including English, German, French, Spanish, Italian, Dutch, Russian, Japanese, and Icelandic. The Settlement Exhibition chronicles Iceland's discovery and colonization beginning in 874 AD when Norse chieftain Ingólfur Arnarson established Iceland's first permanent settlement in present-day Reykjavík. The exhibition explores the motivations driving Vikings to cross the treacherous North Atlantic—political conflicts in Norway, land scarcity, desire for independence, and spirit of exploration—and details the extraordinary challenges faced by these pioneering settlers. Visitors journey through recreated environments, view archaeological artifacts from settlement-era excavations, and experience multimedia presentations depicting the harsh realities of establishing farms and communities on a volcanic island at the edge of the known world.",
  "address": "Brákarbraut 13-15, 310 Borgarnes, Iceland",
  "coordinates": {
    "longitude": -21.9173,
    "latitude": 64.5419,
    "altitude": 0.0
  },
  "rating": 4.6,
  "reviews_count": 4800,
  "category": "Museum",
  "website": "https://www.landnam.is",
  "phone": "+354 437 1600",
  "images": [
    "https://www.landnam.is/eng/",
    "https://www.west.is/en/service/the-settlement-center"
  ],
  "opening_hours": {
    "museum": "Hours vary seasonally - typically 10:00-17:00 summer, reduced hours winter",
    "exhibitions": "Two exhibitions: Settlement (30 min) + Egil's Saga (30 min), total visit ~1-1.5 hours",
    "audioguide": "Included with admission, available in 15 languages",
    "admission": "Adults typically 2,000-2,500 ISK, children reduced rates, check website for current prices",
    "restaurant": "Award-winning Icelandic cuisine, overlooks Borgarfjörður bay, licensed bar",
    "museum_shop": "Saga books, historical literature, Icelandic handicrafts, woolen goods, Viking souvenirs",
    "special_events": "Saga readings, historical lectures, educational school programs",
    "accessibility": "Wheelchair accessible, family-friendly, suitable for all ages",
    "awards": "Multiple tourism and museum excellence awards",
    "opened": "2006 in restored harbor warehouse building",
    "historical_focus": "Iceland's Settlement Age (870-930 AD), Egill Skallagrímsson saga (c. 910-990 AD)",
    "unique_features": "Multimedia synchronized audioguides, atmospheric recreations, authentic artifacts",
    "distance_from_reykjavik": "70 km north in Borgarnes via Ring Road, 1 hour drive",
    "recommended_time": "1-1.5 hours for both exhibitions plus restaurant/shop time"
  }
}
