{
  "name": "Bjarnarhöfn Shark Museum - Hákarl Heritage",
  "description": "The Bjarnarhöfn Shark Museum on the northern shores of the Snæfellsnes Peninsula offers visitors one of Iceland's most unique and sensory-challenging cultural experiences: education about and tasting of hákarl, Iceland's infamous fermented Greenland shark that ranks among the world's most acquired tastes and has gained international notoriety as a test of culinary bravery. The museum occupies a working farm that represents one of Iceland's last remaining traditional hákarl producers, maintaining centuries-old fermentation methods passed down through generations on this very property. Greenland sharks (Somniosus microcephalus) inhabit Iceland's cold waters, growing to massive sizes (up to 7 meters and 1,000 kg) and living extraordinarily long lives—recently discovered to potentially exceed 400 years, making them the longest-lived vertebrates on Earth. However, their flesh contains high concentrations of trimethylamine oxide and urea, making it toxic when fresh and unfit for human consumption without special treatment. Traditional Icelandic preservation methods developed over centuries transformed this poisonous meat into edible food through a process combining fermentation and drying: sharks are beheaded and gutted, then buried in gravel pits where bacterial fermentation and pressure from stones press out fluids over 6-12 weeks, after which the meat is cut into strips and hung in ventilated drying sheds for several months where it develops a characteristic brown crust and potent ammonia smell that announces its presence from considerable distance.",
  "address": "Bjarnarhöfn, 356 Snæfellsbær, Snæfellsnes Peninsula, West Iceland",
  "coordinates": {
    "longitude": -23.75,
    "latitude": 64.8667,
    "altitude": 10.0
  },
  "rating": 4.3,
  "reviews_count": 1890,
  "category": "Museum",
  "website": "https://bjarnarhofn.is",
  "phone": "+354 438 1581",
  "images": [
    "https://bjarnarhofn.is/images/shark-drying-house.jpg"
  ],
  "opening_hours": {
    "summer": "9:00 AM - 6:00 PM (some sources say 8:00 PM, verify before visiting)",
    "daily": "10:00 AM - 5:00 PM (alternative hours from different sources)",
    "admission_adults": "2,000 ISK",
    "admission_children": "Free (12 and under)",
    "included": "Guided tour + hákarl tasting + Brennivín schnapps",
    "fermentation_process": "6 months (burial in gravel, then drying in shed)",
    "production": "One of Iceland's last traditional hákarl producers",
    "greenland_shark": "Somniosus microcephalus (400+ year lifespan, toxic when fresh)",
    "cultural_significance": "Traditional Þorrablót food, survival necessity historically"
  }
}