{
  "name": "Skaftafellsjökull",
  "description": "Skaftafellsjökull is one of the most accessible and frequently photographed outlet glaciers flowing from Vatnajökull, Europe's largest ice cap, descending into the Skaftafell area of Southeast Iceland. This valley glacier presents textbook glacial features including a heavily crevassed icefall where the glacier descends through steeper terrain, a more gently sloping tongue in the lower valley, and an active terminus bordered by a growing proglacial lake. The glacier is particularly notable for demonstrating rapid retreat—historical photographs from the early 20th century show the glacier extending several kilometers further down the valley, while today's terminus has retreated dramatically, leaving behind fresh moraines and exposing scoured bedrock.\n\nThe glacier displays beautiful blue ice in older, compressed sections, contrasted with white snow and distinctive black stripes of volcanic ash from past eruptions including Eyjafjallajökull and other Vatnajökull volcanoes. The ash layers provide a visible record of centuries of volcanic activity, while the glacier's movement and annual layers of snowfall create fascinating patterns in the ice. The surrounding landscape tells the story of glacial processes: U-shaped valleys carved by ancient ice, lateral and terminal moraines marking previous glacier extents, glacial striations on exposed bedrock, and periglacial features on the valley floor. The proglacial lake at the glacier's terminus has expanded significantly in recent decades, now containing small icebergs calved from the glacier face.\n\nSkaftafellsjökull is one of Iceland's most accessible glaciers for viewing, reached via an easy 30-40 minute walking trail from the main Skaftafell parking area. The well-maintained path leads through birch woodland and across the Skaftafellsheiði heath before descending to the glacier viewpoint. Interpretive signs explain glacial processes and the dramatic retreat observed in recent decades. While viewing the glacier from the marked trail is safe and requires no special equipment, walking onto the glacier is extremely dangerous due to hidden crevasses and unstable ice, and is only permitted with certified guides. Several tour operators offer guided glacier walks on Skaftafellsjökull during summer months, providing all necessary equipment. The site is part of Vatnajökull National Park with excellent visitor facilities at Skaftafell.",
  "category": "Glacier",
  "coordinates": {
    "latitude": 64.035000,
    "longitude": -16.934722,
    "altitude": 200.0
  },
  "rating": 4.7,
  "reviews_count": 1240,
  "opening_hours": "Viewable year-round (30-minute walk); guided glacier tours June-August"
}
