{
  "name": "Skálholt",
  "description": "Skálholt is one of Iceland's most historically significant sites, serving as the nation's principal episcopal seat and religious center for over 700 years from 1056 until 1785, when the bishopric relocated to Reykjavík. Located in the heart of South Iceland approximately 50 kilometers from the capital, Skálholt functioned as far more than a religious center during its medieval heyday—it simultaneously served as Iceland's primary educational institution, political nerve center, and cultural hub throughout the Middle Ages and Reformation period. The site hosted Iceland's first formal school, established around 1056, which trained generations of clergy, scholars, and leaders who shaped Icelandic society for centuries. Alongside the cathedral, bishop's residence, and school, the complex included extensive farming operations, a smithy for metalworking, and during the Catholic period (until 1550), a monastery. At its peak, Skálholt was essentially a small city and the second-largest settlement in Iceland after Þingvellir's parliament grounds. The site witnessed pivotal moments in Icelandic history including the violent Reformation in 1550 when the last Catholic bishop Jón Arason and his two sons were beheaded at Skálholt on November 7, marking Iceland's forced conversion to Lutheranism. The current cathedral, completed in 1963, is the latest in a succession of churches built on this hallowed ground over nearly a millennium.",
  "address": "Skálholt, 801 Selfoss, Iceland",
  "coordinates": {
    "longitude": -20.5264,
    "latitude": 64.1271,
    "altitude": 0.0
  },
  "rating": 4.6,
  "reviews_count": 3100,
  "category": "Cathedral",
  "website": "https://www.skalholt.is",
  "phone": "+354 486 8870",
  "images": [
    "https://www.skalholt.is/en",
    "https://www.south.is/en/service/skalholt-cathedral"
  ],
  "opening_hours": {
    "cathedral_access": "Generally open daily for visitors, hours vary seasonally",
    "basement_museum": "Displays bishop's tombs, historical artifacts, underground tunnel",
    "admission": "Free entry to cathedral and museum",
    "summer_concerts": "First two weeks of July annually, free concerts, contemporary and early music focus",
    "services": "Lutheran services held regularly, weddings and special ceremonies hosted",
    "bishop_residence": "Active bishop still resides at Skálholt, continuing 1,000-year tradition",
    "historical_period": "Episcopal seat 1056-1785 (729 years), still active religious site",
    "current_building": "Completed 1963, designed by Guðjón Samúelsson (Hallgrímskirkja architect)",
    "reformation": "Site of 1550 beheading of last Catholic bishop Jón Arason and his sons",
    "medieval_role": "Religious center, Iceland's first school (est. 1056), political hub, farming complex",
    "archaeological_site": "Continuous occupation evidence, multiple church generations excavated",
    "festival": "Iceland's oldest summer music festival since 1963, excellent cathedral acoustics",
    "distance_from_reykjavik": "Approximately 50 km east via Route 1 and Route 31",
    "golden_circle_extension": "Easy addition to Golden Circle route, combines history and culture"
  }
}
