{
  "name": "Skál! Restaurant",
  "description": "Skál! is an innovative Icelandic restaurant located in Reykjavík that celebrates traditional Icelandic cuisine while incorporating modern culinary techniques and international influences. The restaurant's name means \"cheers\" in Icelandic, setting a welcoming and convivial tone for the dining experience. Skál! has earned recognition for its commitment to using locally sourced ingredients, supporting Icelandic farmers and fishermen, and creating dishes that tell the story of Iceland's food culture from historical preservation methods to contemporary innovation. The menu changes seasonally to highlight the best ingredients available, with particular emphasis on Icelandic lamb, fresh seafood from surrounding waters, and foraged ingredients that showcase Iceland's unique flora.\n\nThe restaurant's interior design reflects contemporary Icelandic aesthetics—clean lines, natural materials like wood and stone, and subtle lighting that creates an intimate atmosphere. The dining room strikes a balance between formal elegance and the approachable warmth characteristic of Icelandic hospitality. Skál! offers both à la carte dining and tasting menu options that allow guests to experience a curated journey through Icelandic flavors. The tasting menus often include dishes featuring ingredients that might be unfamiliar to international visitors—items like Icelandic skyr (cultured dairy product), seaweed varieties from Iceland's coasts, wild berries, and fish species specific to North Atlantic waters. The culinary team takes pride in explaining dishes, their ingredients, and the cultural or historical significance behind traditional preparations.\n\nDining at Skál! provides both an excellent meal and cultural education about Icelandic food traditions and contemporary cuisine. The restaurant has received positive reviews from food critics and travelers alike for successfully honoring traditional Icelandic cooking while making it accessible and appealing to modern palates. The wine selection includes both international options and increasingly prominent Icelandic craft beers and spirits that complement the menu. Service is professional yet friendly, embodying the Icelandic approach to hospitality that values genuine warmth over stuffy formality. Reservations are strongly recommended, especially during peak tourist season (June-August). The restaurant is located in central Reykjavík, making it easily accessible for visitors exploring the capital. For those seeking to understand Icelandic cuisine beyond hot dogs and fish and chips, Skál! offers a sophisticated and delicious introduction.",
  "category": "Restaurant",
  "coordinates": {
    "latitude": 64.145278,
    "longitude": -21.926111,
    "altitude": 10.0
  },
  "rating": 4.6,
  "reviews_count": 1432,
  "opening_hours": "Dinner Tuesday-Saturday 17:30-22:00 (last seating). Closed Sunday-Monday. Reservations strongly recommended."
}
