{
  "name": "Skeiðará Bridge Monument",
  "description": "The Skeiðará Bridge Monument commemorates the incredible story of Iceland's longest bridge and the glacial flood (jökulhlaup) that destroyed it in 1996. Located along the South Coast on Route 1, the monument consists of twisted steel sections from the original bridge that was swept away when the Grímsvötn volcanic eruption beneath Vatnajökull glacier triggered a massive glacial flood. The flood released an estimated 45,000 cubic meters of water per second—comparable to the Amazon River's flow—carrying house-sized icebergs and boulders that demolished the 900-meter bridge. The mangled steel remnants stand as a powerful testament to the raw power of Iceland's natural forces.\n\nThe monument site includes information panels explaining the 1996 eruption and flood event, complete with photographs documenting the bridge's destruction and the dramatic aftermath. The twisted bridge sections display the immense forces involved, with massive steel beams bent like paper clips. The site provides educational context about glacial floods, volcanic activity beneath ice caps, and the engineering challenges of building infrastructure in Iceland's dynamic geological environment. A new, stronger bridge was constructed nearby with higher clearance to better withstand future floods. The monument has become an important stop for understanding the powerful natural processes that continue to shape Iceland.\n\nThe monument is located directly beside Route 1 approximately 60 kilometers west of Höfn and 50 kilometers east of Kirkjubæjarklaustur on the Skeiðarársandur glacial outwash plain. A parking area provides safe access with interpretive signs in multiple languages. The site is free to visit and accessible year-round, taking just 10-15 minutes to view the monument and read the information panels. The flat, black sand landscape of Skeiðarársandur provides a stark setting that emphasizes the power of glacial floods. Nearby attractions include Skaftafell National Park, Svínafellsjökull glacier, and Jökulsárlón glacier lagoon.",
  "category": "Monument",
  "coordinates": {
    "latitude": 64.055000,
    "longitude": -17.218889,
    "altitude": 5.0
  },
  "rating": 4.6,
  "reviews_count": 720,
  "opening_hours": "Open 24/7 (roadside monument, free access)"
}
