{
  "name": "Skógar Museum - Comprehensive Folk Heritage Complex",
  "description": "Skógar Museum (Skógasafn) stands as one of Iceland's finest and most comprehensive folk museums, located in the village of Skógar on the South Coast directly adjacent to the spectacular Skógafoss waterfall, offering visitors an immersive journey through centuries of Icelandic life, culture, and technological development across three distinct museum buildings and outdoor exhibits. Founded by local teacher and historian Þórður Tómasson who began collecting artifacts in 1949, the museum has grown into a remarkable repository of over 15,000 regional folk craft artifacts that document how Icelanders adapted to one of the world's harshest environments through ingenuity, resourcefulness, and community cooperation. The museum complex divides into three main sections: The Folk Museum houses an extraordinary collection of agricultural and fishing tools demonstrating traditional farming and maritime livelihoods; fishing boats and maritime equipment including everything from simple hand lines to sophisticated navigation instruments; textiles and traditional costumes showcasing Iceland's distinctive knitting patterns and weaving techniques; musical instruments documenting Icelandic folk music traditions; rare books and manuscripts preserving literary heritage; natural history specimens; and fascinating Icelandic curiosities that reflect the nation's unique cultural quirks. The Open Air Museum transports visitors to Iceland's past through meticulously preserved and reconstructed buildings: a traditional turf farmstead built using ancient techniques with thick turf walls providing insulation against brutal weather; a rare 19th-century gabled farm home representing more prosperous agricultural families; an extraordinary dwelling crafted entirely from shipwrecked driftwood.",
  "address": "Skógar, 861 Skógahreppur, South Iceland (next to Skógafoss waterfall)",
  "coordinates": {
    "longitude": -19.5172,
    "latitude": 63.5283,
    "altitude": 15.0
  },
  "rating": 4.6,
  "reviews_count": 2950,
  "category": "Museum",
  "website": "https://www.skogasafn.is",
  "phone": "+354 487 8845",
  "images": [
    "https://www.skogasafn.is/images/turf-houses-museum.jpg"
  ],
  "opening_hours": {
    "june_august": "9:00 AM - 6:00 PM",
    "september_october": "10:00 AM - 5:00 PM",
    "november_april": "10:00 AM - 4:00 PM",
    "may": "10:00 AM - 5:00 PM",
    "closed": "December 24-25, January 1",
    "admission_adults": "Check website for current pricing",
    "collection_size": "15,000+ artifacts",
    "three_sections": "Folk Museum, Open Air Museum, Technical Museum",
    "turf_houses": "Traditional farmsteads, 19th century homes, driftwood house",
    "founded": "1949 by Þórður Tómasson"
  }
}