{
  "name": "Stöðvarfjörður - Home of Petra's Stones",
  "description": "Stöðvarfjörður is a tiny, tranquil coastal village of just 182 residents (as of 2024) nestled on the northern shore of the fjord bearing the same name in East Iceland's dramatic fjord landscape, approximately 628 kilometers from Reykjavík. Despite its diminutive size, this remote settlement has achieved international fame as the home of one of the world's most extraordinary private mineral collections. The village's claim to fame is Petra's Stone and Mineral Collection (Steinasafn Petru), a practically uncountable assemblage of stones, minerals, and geological specimens that fills the former home and garden of the late Ljósbjörg Petra María Sveinsdóttir (1922-2012), affectionately known as Petra. This remarkable woman dedicated her life to collecting stones, beginning in earnest in 1946 when she started gathering beautiful rocks, minerals, crystals, and geological curiosities from across Iceland. What started as a personal passion grew over decades into one of the largest and most diverse private stone collections in the world, containing thousands upon thousands of specimens ranging from tiny crystals to massive boulders, displayed throughout her house, garden, and surrounding grounds in a charming, chaotic profusion that reflects Petra's genuine love for geological beauty rather than formal museum curation. In 1974, recognizing the uniqueness of her collection and responding to growing interest from visitors, Petra decided to open her home Sunnuhlíð to anyone who wished to view her stones, and the museum has operated continuously since then, now managed by her family who preserve her legacy. Walking through the collection is like entering a geological wonderland: rooms filled with glittering quartz crystals, zeolite formations, jasper, agate, volcanic rocks, and minerals in every color imaginable; a garden where massive boulders with striking patterns and colors create a sculpture park of nature's artistry; and everywhere, the sense of Petra's enthusiastic, almost childlike wonder at the beauty hidden in Iceland's rocks. Each stone has been hand-collected, often by Petra herself during walks through the Icelandic countryside, and the collection represents not just geological diversity but a lifetime of dedication to noticing and preserving natural beauty. Beyond the museum, Stöðvarfjörður offers typical East Fjords scenery: steep mountains rising directly from the fjord, excellent fishing, opportunities for hiking and birdwatching, and the authentic atmosphere of a working fishing village where tourism remains secondary to traditional livelihoods. The village's isolation and small size mean facilities are limited, but for travelers seeking off-the-beaten-path experiences and geological wonders, Stöðvarfjörður and Petra's incredible collection are absolutely worth the detour.",
  "address": "Stöðvarfjörður, 755 Fjarðabyggð, Iceland",
  "coordinates": {
    "longitude": -13.8850,
    "latitude": 64.8375,
    "altitude": 5.0
  },
  "rating": 4.7,
  "reviews_count": 1420,
  "category": "Village",
  "website": "https://www.steinapetra.is",
  "phone": "+354 475 8834",
  "images": [
    "https://www.steinapetra.is/images/stone-collection-exterior.jpg"
  ],
  "opening_hours": {
    "petras_collection": "May 1 - October 15, daily 9:00 AM - 5:00 PM",
    "admission": "2,000 ISK (14 years and older), children free",
    "location": "Fjarðarbraut 21, 755 Stöðvarfjörður",
    "winter_visits": "By appointment only (call ahead)",
    "recommended_visit": "1-1.5 hours to explore collection",
    "population": "182 residents (2024)"
  }
}
