{
  "name": "Stöðvarfjörður - Home of Petra's Stones",
  "description": "Stöðvarfjörður is a tiny, tranquil coastal village of just 182 residents (as of 2024) nestled on the northern shore of the fjord bearing the same name in East Iceland's dramatic fjord landscape, approximately 628 kilometers from Reykjavík. Despite its diminutive size, this remote settlement has achieved international fame as the home of one of the world's most extraordinary private mineral collections. The village's claim to fame is Petra's Stone and Mineral Collection (Steinasafn Petru), a practically uncountable assemblage of stones, minerals, and geological specimens that fills the former home and garden of the late Ljósbjörg Petra María Sveinsdóttir (1922-2012), affectionately known as Petra. This remarkable woman dedicated her life to collecting stones, beginning in earnest in 1946 when she started gathering beautiful rocks, minerals, crystals, and geological curiosities from across Iceland. What started as a personal passion grew over decades into one of the largest and most diverse private stone collections in the world, containing thousands upon thousands of specimens ranging from tiny crystals to massive boulders, displayed throughout her house, garden, and surrounding grounds in a charming, chaotic profusion that reflects Petra's genuine love for geological beauty rather than formal museum curation.",
  "address": "Stöðvarfjörður, 755 Fjarðabyggð, Iceland",
  "coordinates": {
    "longitude": -13.885,
    "latitude": 64.8375,
    "altitude": 5.0
  },
  "rating": 4.7,
  "reviews_count": 1420,
  "category": "Village",
  "website": "https://www.steinapetra.is",
  "phone": "+354 475 8834",
  "images": [
    "https://www.steinapetra.is/images/stone-collection-exterior.jpg"
  ],
  "opening_hours": {
    "petras_collection": "May 1 - October 15, daily 9:00 AM - 5:00 PM",
    "admission": "2,000 ISK (14 years and older), children free",
    "location": "Fjarðarbraut 21, 755 Stöðvarfjörður",
    "winter_visits": "By appointment only (call ahead)",
    "recommended_visit": "1-1.5 hours to explore collection",
    "population": "182 residents (2024)"
  }
}