{
  "name": "Stokksnes",
  "description": "Stokksnes is a dramatic headland and black sand beach on the Stokksnes Peninsula in southeast Iceland, dominated by the towering 454-meter peak of Vestrahorn mountain, often called Batman Mountain due to its distinctive three-peaked silhouette resembling the Batman logo. Located approximately 10 kilometers from the town of Höfn and over 450 kilometers from Reykjavík, this privately-owned peninsula has become one of Iceland's most photographed landscapes, celebrated for its otherworldly combination of jagged gabbro peaks, extensive black volcanic sand beaches, and the shallow tidal lagoon Kirkjusandur. Vestrahorn mountain, composed primarily of gabbro—a dark, coarse-grained volcanic rock rich in iron and magnesium—rises dramatically from the flat coastal plain, its rugged peaks and steep slopes formed by volcanic activity millions of years ago. The black sand beaches were created over millennia as ocean waves ground down volcanic rock into fine dark particles that now stretch across the peninsula. At high tide, seawater extends over the sand creating the shallow Kirkjusandur lagoon, which produces stunning mirror reflections of Vestrahorn during calm weather, particularly during golden hour when photographers flock to capture the mountain's reflection in the glassy water. The peninsula is particularly famous among landscape photographers for its dramatic lighting conditions, accessibility, and the stark contrast between the dark peaks, black sand, and often moody Icelandic skies. The location features a replica Viking village originally constructed in 2010 for an Icelandic Viking-era drama film by director Baltasar Kormákur, known for films such as Everest and Adrift. However, the production was never completed due to funding difficulties, and the weathered wooden buildings, turf-roofed halls, Icelandic turf houses, Viking warship, and dungeon remained abandoned for over a decade. The film set finally fulfilled its intended purpose in 2021 when it served as a shooting location for the Netflix series The Witcher: Blood Origin, breathing new life into the atmospheric structures. The Viking Café serves as the access point and fee collection station, operating from 8:00 AM to 8:00 PM during summer months and 8:00 AM to 7:00 PM in other seasons. Access to the private peninsula requires a fee of approximately 1,100 ISK per person, payable at the café or via an outdoor payment machine when the café is closed. Multiple parking areas are available: one at the café with restroom facilities, and three additional parking points within the peninsula offering different vantage points of Vestrahorn and the surrounding landscape. The location is accessible year-round via Route 1 (Ring Road), though weather conditions can vary dramatically with strong coastal winds common throughout the year.",
  "address": "Stokksnes, 780 Höfn, Iceland",
  "coordinates": {
    "longitude": -14.95,
    "latitude": 64.2667,
    "altitude": 0.0
  },
  "rating": 4.8,
  "reviews_count": 15600,
  "category": "Black Sand Beach",
  "website": "https://www.vestrahorn.is",
  "phone": null,
  "images": [
    {
      "source": "Wikimedia Commons",
      "url": "https://commons.wikimedia.org/wiki/Category:Dunes_in_Iceland"
    },
    {
      "source": "Visit South Iceland",
      "url": "https://www.south.is/en/place/stokksnes"
    }
  ],
  "opening_hours": {
    "access": "24/7 year-round via private property entrance",
    "viking_cafe": "Summer (May-September) 08:00-20:00, Other seasons 08:00-19:00",
    "entrance_fee": "1,100 ISK per person (approximately $8-9 USD), payable at Viking Café or outdoor machine",
    "parking": "4 parking areas: 1 at café with facilities, 3 inside peninsula with mountain views",
    "best_for_photography": "Golden hours (sunrise/sunset) for reflections in Kirkjusandur lagoon, calm days with no wind",
    "viking_village": "Included in entrance fee, replica film set accessible year-round",
    "facilities": "Restrooms and refreshments available at Viking Café during opening hours",
    "distance_from_hofn": "10 km west, accessible directly from Route 1 Ring Road"
  }
}
