{
  "name": "Stóri-Dímon",
  "description": "Stóri-Dímon is a spectacular 1,136-meter mountain located in South Iceland, forming part of the Eyjafjöll mountain range west of the infamous Eyjafjallajökull volcano. The mountain's name translates to 'Big Diamond' or 'Big Throne,' referring to its distinctive rocky summit that rises dramatically above the surrounding landscape. Stóri-Dímon offers one of the most rewarding day hikes in South Iceland, combining moderate challenge with extraordinary views of glaciers, volcanoes, and the south coast. The mountain stands as a prominent landmark visible from much of the Ring Road through South Iceland, its pyramid-like profile drawing the eye of passing travelers.\n\nThe hike to Stóri-Dímon's summit typically takes 4-5 hours round trip from the trailhead at Básar. The route ascends through low birch scrubland before climbing onto open mountainside with increasingly spectacular views. The upper portions involve some easy scrambling over rocks but nothing technically difficult for experienced hikers. From the summit, the panorama is breathtaking: Eyjafjallajökull and Mýrdalsjökull glaciers dominate the eastern horizon, while Westman Islands are visible offshore to the south. On exceptionally clear days, Hekla volcano appears to the northeast. The Atlantic Ocean stretches endlessly to the south, and Þórsmörk valley is visible to the east. The summit area features interesting rock formations and provides sheltered spots to rest and enjoy lunch while absorbing the views.\n\nAccess to Stóri-Dímon is via Route 261 (Þórsmörk road) leading inland from Route 1 near Hvolsvöllur. The trailhead at Básar is reachable by regular cars in summer, though the road can be rough. Parking is available near the trail start. The hike is best attempted from June through September when snow has melted from the upper slopes. The trail is not formally marked but is well-trodden and generally easy to follow in good visibility. Weather can change rapidly, so hikers should bring warm layers, rain gear, food, and water. The mountain is suitable for fit hikers with some mountain experience. The hike can be combined with exploring nearby Seljalandsfoss and Gljúfrabúi waterfalls.",
  "category": "Mountain",
  "coordinates": {
    "latitude": 63.597222,
    "longitude": -19.668889,
    "altitude": 1136.0
  },
  "rating": 4.8,
  "reviews_count": 320,
  "opening_hours": "June-September (day hike, good fitness required)"
}
