{
  "name": "Stöðvarfjörður - Petra's Stone Collection Village",
  "description": "Stöðvarfjörður establishes tiny fishing village eastern Iceland where approximately 200 residents inhabit remote fjord achieving international recognition hosting Petra's Stone Collection 70,000+ mineral specimens amassed lifetime passion Petra Sveinsdóttir creating extraordinary private museum transforming ordinary home geological wonderland attracting visitors worldwide seeking unique eccentric attractions demonstrating how individual passion creates tourism destinations supporting tiny communities establishing unexpected draw remote locations. Petra's Stone Collection represents decades obsessive collecting where rocks minerals crystals fill every surface room garden creating overwhelming sensory experience geological diversity artistic arrangement establishing unique museum defying conventional categorization demonstrating how personal collections become cultural institutions supporting tourism education community pride identity. Fishing continues limited operations where tiny fleet provides minimal economic activity though most residents commute work elsewhere establishing bedroom community character depending external employment rather self-sufficient local economy demonstrating extreme challenges maintaining viable communities very small populations remote locations lacking diverse employment opportunities. Dramatic mountain scenery surrounds village where steep peaks create spectacular backdrop though limited infrastructure basic services constrain overnight capacity creating day-visitor patterns limiting economic benefits compared longer-stay tourism generating comprehensive local spending though Petra's collection alone justifies detour eastern fjords routes demonstrating specialized attractions drawing visitors remote locations. Swimming pool provides basic bathing facilities though minimal infrastructure maintains rustic character reflecting tiny population budget constraints nevertheless providing essential community amenity demonstrating national pool priorities.",
  "address": "Stöðvarfjörður, 755 East Iceland",
  "coordinates": {
    "longitude": -13.8833,
    "latitude": 64.8500,
    "altitude": 5.0
  },
  "rating": 4.6,
  "reviews_count": 4230,
  "category": "Village - East Iceland",
  "website": "https://www.east.is",
  "phone": "+354 475 8860",
  "images": [
    "https://www.east.is/images/stoavarfjordur-petra.jpg"
  ],
  "opening_hours": {
    "population": "~200",
    "location": "Remote eastern fjord",
    "petras_collection": "70,000+ minerals, lifetime collection, unique museum",
    "character": "Tiny village, eccentric stone museum, tourism anomaly"
  }
}
