{
  "name": "Sumac Grill + Drinks - Middle Eastern Flavors in Reykjavík",
  "description": "Sumac brings the nostalgic atmosphere and flavors of Beirut to downtown Reykjavík, offering locals and visitors delicious Middle Eastern cuisine and handcrafted Mediterranean cocktails in a setting that celebrates Lebanese and Moroccan culinary traditions while incorporating exceptional Icelandic ingredients that create unexpected but harmonious flavor combinations. Located at Laugavegur 28 on Reykjavík's main shopping street, the restaurant occupies prime real estate in the city's most trafficked pedestrian area, drawing foot traffic from tourists shopping for Icelandic woolens and locals meeting friends for drinks and dinner. Named after sumac—the tart, lemony spice fundamental to Middle Eastern cooking made from dried and ground red berries of the sumac bush—the restaurant signals its commitment to authentic flavors and traditional spice blends that define Levantine cuisine, though chef Thrainn Freyr Vigfusson creatively integrates Icelandic lamb, seafood, and dairy into Middle Eastern preparations that respect both culinary traditions. The menu showcases Middle Eastern and North African spices and flavors mixed with Icelandic ingredients, creating fusion that never feels forced or gimmicky but instead represents thoughtful exploration of how Iceland's exceptional proteins and vegetables work within established flavor profiles from Moroccan tagines, Lebanese mezze, and pan-Mediterranean grilling traditions. Highlighted dishes include flatbread with za'atar and hummus providing the warm.",
  "address": "Laugavegur 28, 101 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9292,
    "latitude": 64.1455,
    "altitude": 10.0
  },
  "rating": 4.7,
  "reviews_count": 2680,
  "category": "Restaurant",
  "website": "https://sumac.is/en",
  "phone": "+354 537 9900",
  "images": [
    "https://sumac.is/images/middle-eastern-mezze.jpg"
  ],
  "opening_hours": {
    "tuesday_thursday": "Kitchen 17:30-22:00, Drinks 17:30-23:00",
    "friday_saturday": "Kitchen 17:30-22:30, Drinks 17:30-23:30",
    "closed": "Monday",
    "michelin_guide": "Listed in 2025 Michelin Guide Iceland",
    "cuisine": "Middle Eastern (Lebanese & Moroccan) with Icelandic ingredients",
    "chef": "Thrainn Freyr Vigfusson",
    "inspiration": "Beirut nostalgic atmosphere, Levantine culinary traditions",
    "name_meaning": "Sumac - tart lemony spice from dried red berries, fundamental to Middle Eastern cooking",
    "signature_dishes": "Flatbread with za'atar & hummus, grilled oyster mushrooms, carrots with whipped feta/honey/cumin, shrimp skewer with chili & preserved lemon, beef short rib with hazelnut dukkah",
    "price_range": "16,000-18,000 ISK per person (~$115-130 USD)",
    "fusion_philosophy": "Middle Eastern & North African spices with Icelandic lamb, seafood, dairy",
    "mezze_culture": "Many small plates with drinks, lingering dining experience",
    "cocktails": "Handcrafted Mediterranean cocktails with pomegranate, rose water, cardamom, date syrup",
    "reservations": "Essential - popular restaurant with limited seating",
    "location": "Prime Laugavegur shopping street location, high foot traffic",
    "vegetarian_strength": "Strong vegetarian Middle Eastern options demonstrate depth",
    "spice_blends": "Authentic za'atar, dukkah, baharat, ras el hanout",
    "preserved_ingredients": "Preserved lemons, pickles, fermented vegetables typical of Levantine cuisine"
  }
}