{
  "name": "Sundhöllin - Reykjavík's Historic Central Pool (1937)",
  "description": "Sundhöll Reykjavíkur—commonly known simply as Sundhöllin—holds the distinguished position as Reykjavík's oldest purpose-built indoor swimming facility, opened in 1937 and representing a significant milestone in Iceland's swimming culture and public health initiatives during a period when indoor bathing facilities were rare luxuries. Designed by renowned Icelandic architect Guðjón Samúelsson—whose portfolio includes Hallgrímskirkja church and numerous other iconic Icelandic buildings—the pool exhibits functionalist architecture characteristic of 1930s Nordic design, blending practical purpose with aesthetic consideration. Located at Barónsstígur 45a in central Reykjavík's 101 postal district, Sundhöllin occupies one of the city's most accessible locations within easy walking distance of Laugavegur shopping street, Hallgrímskirkja, and downtown accommodations, making it particularly convenient for tourists staying in central Reykjavík who want to experience authentic Icelandic pool culture without traveling to outlying neighborhoods. The facility underwent comprehensive renovation in 2017 that modernized amenities while preserving its historic character, carefully balancing heritage preservation with contemporary expectations for comfort and hygiene. The renovation added outdoor facilities to complement the original indoor pool, expanding the complex's appeal and utility across seasons. Today's Sundhöllin features both indoor and outdoor swimming pools, multiple hot tubs providing the essential Icelandic soaking experience, saunas releasing cleansing steam, and a bracing cold plunge pool for those practicing contrast bathing's circulation-boosting benefits. A children's pool accommodates families with young swimmers. Diving boards offer opportunities for aquatic acrobatics. The facility includes a fitness area for dry-land exercise complementing aquatic activities. Despite renovations, Sundhöllin maintains an intimate, neighborhood feel distinct from larger complexes like Laugardalslaug, creating atmosphere many regulars prefer for its community character where familiar faces gather daily. The pool's central location makes it popular with downtown residents, office workers taking lunchtime swims, students from nearby schools, and tourists who discover that a morning swim and hot tub soak provides authentic cultural immersion while relieving travel fatigue. The facility operates on reduced weekend hours compared to weekday schedules, with particularly limited Sunday hours, so visitors should plan accordingly. Sundhöllin represents living history—a functioning facility where modern Icelanders practice the same cleansing and socializing rituals their grandparents did eight decades earlier, maintaining traditions that connect contemporary life to Iceland's public health campaigns that made swimming instruction mandatory and pool access universal.",
  "address": "Barónsstígur 45a, 101 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9342,
    "latitude": 64.1428,
    "altitude": 15.0
  },
  "rating": 4.5,
  "reviews_count": 1920,
  "category": "Swimming Pool",
  "website": "https://reykjavik.is/en/sundholl-reykjavik-pool",
  "phone": "+354 411 5350",
  "images": [
    "https://reykjavik.is/sites/default/files/sundholl-reykjavik.jpg"
  ],
  "opening_hours": {
    "monday_thursday": "6:30 AM - 10:00 PM",
    "friday": "6:30 AM - 8:00 PM",
    "saturday": "8:00 AM - 4:00 PM",
    "sunday": "10:00 AM - 6:00 PM",
    "admission_adults": "1,000 ISK",
    "admission_children_6_17": "160 ISK",
    "admission_children_0_5": "Free",
    "swimsuit_rental": "900 ISK",
    "opened": "1937",
    "architect": "Guðjón Samúelsson (also designed Hallgrímskirkja)",
    "renovated": "2017 comprehensive renovation",
    "location": "Central Reykjavík (101 district)",
    "features": "Indoor pool, outdoor pool, hot tubs, saunas, steam room, cold plunge, diving boards",
    "historic_significance": "Reykjavík's oldest purpose-built indoor swimming facility",
    "character": "Intimate neighborhood atmosphere, functionalist 1930s architecture"
  }
}
