{
  "name": "Surtshellir",
  "description": "Surtshellir, meaning 'Surtr's Cave' (named after the fire giant from Norse mythology), is Iceland's longest and most famous lava tube cave system, stretching nearly 2 kilometers beneath the Hallmundarhraun lava field in West Iceland. This massive cave was formed approximately 1,100 years ago when lava from Langjökull glacier's volcanic system flowed through the area. As the surface of the lava flow cooled and solidified, molten lava continued to flow beneath, eventually draining away and leaving behind this immense tunnel. The cave reaches heights of up to 15 meters and widths of 20 meters in some chambers, creating cathedral-like spaces underground.\n\nThe cave has significant historical and cultural importance in Iceland. Medieval outlaws used Surtshellir as a hideout, and archaeological excavations have uncovered artifacts including bones, tools, and evidence of fires dating back to the Settlement Era. The cave features multiple chambers and passages, with the main tube extending deep into the lava field. Inside, visitors can observe classic lava tube features including lava stalactites, flow marks on the walls, and collapsed sections where the ceiling has fallen in. The cave floor is covered with broken lava rocks and ice formations that persist year-round in the deeper sections. The cave's name and its association with the fire giant Surtr reflect the awe that early Icelanders felt when encountering this geological marvel.\n\nSurtshellir is located in the Hallmundarhraun lava field, accessible via Route 518 from the Ring Road. A parking area and marked trail lead to the cave entrance, with the walk taking about 10 minutes across the rugged lava field. Exploring Surtshellir requires good flashlights or headlamps, sturdy hiking boots, and warm clothing as temperatures inside remain near freezing. While the first chamber can be explored independently, venturing deeper into the cave system requires proper equipment and experience with cave exploration. Guided tours are available and recommended for safety and to learn about the cave's geology and history. The site is accessible from May through October, with winter access not recommended due to ice and snow.",
  "category": "Cave",
  "coordinates": {
    "latitude": 64.698889,
    "longitude": -20.615000,
    "altitude": 450.0
  },
  "rating": 4.7,
  "reviews_count": 540,
  "opening_hours": "May-October (flashlight required, guided tours recommended)"
}
