{
  "name": "Suðurbæjarlaug - Hafnarfjörður Swimming Pool",
  "description": "Suðurbæjarlaug serves Hafnarfjörður—Iceland's third-largest municipality with approximately 30,000 residents, located immediately south of Reykjavík—with a modern swimming facility that combines competitive training pools with family recreation amenities and the hot tubs, steam baths, and cold plunge pools essential to Icelandic bathing culture, all while pioneering progressive admission policies offering free swimming to all visitors under 18 years old. Hafnarfjörður (\"Harbor Fjord\") is a historically significant port town with a charming old harbor district, dramatic lava fields that local folklore associates with hidden elves and trolls, annual Viking Festival celebrations, and strong cultural identity distinct from neighboring Reykjavík despite the urban areas merging seamlessly. Suðurbæjarlaug's design reflects modern aquatic architecture with interconnected indoor and outdoor pools that provide flexibility across Iceland's variable weather conditions. The outdoor 25 x 12.5 meter pool offers traditional Icelandic year-round swimming where geothermal heating maintains comfortable water temperature even as swimmers breathe cold air and watch steam rise dramatically around them—an experience uniquely Icelandic that many visitors find surprisingly addictive. The custom-designed indoor training pool provides sheltered swimming preferred during particularly harsh weather or by competitive swimmers and training groups who utilize it for serious lap work, technique refinement, and coached instruction.",
  "address": "Hringbraut 77, 220 Hafnarfjörður, Iceland",
  "coordinates": {
    "longitude": -21.9611,
    "latitude": 64.0644,
    "altitude": 12.0
  },
  "rating": 4.6,
  "reviews_count": 1520,
  "category": "Swimming Pool",
  "website": "https://en.hafnarfjordur.is/sundlaug/sudurbaejarlaug/",
  "phone": "+354 565 3080",
  "images": [
    "https://en.hafnarfjordur.is/images/sudurbaejarlaug-pool.jpg"
  ],
  "opening_hours": {
    "monday_thursday": "6:30 AM - 10:00 PM",
    "friday": "6:30 AM - 8:00 PM",
    "saturday": "8:00 AM - 6:00 PM",
    "sunday": "8:00 AM - 9:00 PM (extended hours year-round)",
    "admission_under_18": "Free (progressive policy)",
    "reykjavik_city_card": "2 for 1 admission",
    "outdoor_pool": "25 x 12.5m outdoor pool",
    "indoor_pool": "Custom-designed indoor training pool",
    "interconnected": "Indoor and outdoor pools connected",
    "hot_tubs": "3 hot tubs",
    "cold_plunge": "2 cold tubs",
    "features": "Steam bath, 2 waterslides (main + children's), mushroom spray fountain in wading pool",
    "municipality": "Hafnarfjörður (pop. ~30,000), Iceland's 3rd largest municipality",
    "town_character": "Historic port, lava fields, Viking Festival, elf folklore",
    "location": "Immediately south of Reykjavík, urban areas merge seamlessly"
  }
}