{
  "name": "Sægreifinn - The Sea Baron's World-Famous Lobster Soup",
  "description": "Sægreifinn (The Sea Baron) represents one of Reykjavík's most authentic culinary experiences, operating from a humble green-painted fisherman's hut in the old harbor where retired fisherman and Coast Guard chef Kjartan Halldórsson transformed his dockside fish shop into an unlikely dining destination serving what food critics and travelers have called the \"world's greatest lobster soup\" along with simple grilled seafood skewers that showcase Iceland's exceptional marine bounty without pretension or ceremony. The restaurant's origin story embodies Icelandic resourcefulness and hospitality: Kjartan ran a fish shop selling fresh catch directly from the dock when foreign visitors began asking if he could prepare their purchased fish for immediate consumption—in response, he purchased a grill and started cooking seafood on the spot, inviting customers inside the fish shop to dine surrounded by ice chests, fishing equipment, and the working atmosphere of an operational harbor business. This improvised beginning evolved into deliberate restaurant operation while retaining the authentic fisherman's hut character that makes Sægreifinn feel like dining in someone's workshop rather than a polished eatery—the green exterior, simple interior with communal seating, visible kitchen preparation, and maritime décor create atmosphere that tourists seeking \"authentic Iceland\" find irresistible. The menu remains deliberately simple: four different seafood skewers, two vegetarian options, and the legendary lobster soup.",
  "address": "Geirsgata 8, 101 Reykjavík (Old Harbor)",
  "coordinates": {
    "longitude": -21.9436,
    "latitude": 64.1518,
    "altitude": 2.0
  },
  "rating": 4.6,
  "reviews_count": 8650,
  "category": "Restaurant",
  "website": "https://www.saegreifinn.is/en",
  "phone": "+354 553 1500",
  "images": [
    "https://www.saegreifinn.is/images/green-fishermans-hut.jpg"
  ],
  "opening_hours": {
    "daily": "11:30 AM - late (closing varies with customer flow)",
    "specialty": "World-famous lobster soup + grilled seafood skewers",
    "menu_simplicity": "4 seafood skewers, 2 vegetarian skewers, lobster soup",
    "seafood_variety": "Mink whale, angler, catfish, cod, skate, halibut, salmon, lemon sole, plaice, blue ling, torsk, trout, prawns (varies by catch)",
    "lobster_soup_flavor": "Celery, red bell pepper, tomato, cinnamon, clove, coriander with fresh langoustine chunks",
    "soup_serving": "Generous portion with bread and butter, constitutes full meal",
    "lunch_deal": "Lobster soup + fish skewer combo ~2,200-2,500 ISK ($16-18 USD)",
    "founder": "Kjartan Halldórsson - retired fisherman & Coast Guard chef",
    "origin_story": "Fish shop where owner started grilling for customers who requested cooking",
    "atmosphere": "Green-painted fisherman's hut, working harbor character, communal seating",
    "authenticity": "Genuine maritime setting, not manufactured tourism experience",
    "location": "Old harbor (Geirsgata), near whale watching tours & maritime museums",
    "acclaim": "Called 'world's greatest lobster soup' by critics and travelers",
    "reputation": "Guidebook staple, queues during peak lunch hours",
    "price_level": "Exceptional value for quality seafood in expensive Reykjavík",
    "appeal": "Simple preparation highlights seafood quality without pretension",
    "langoustine_note": "Icelandic 'lobster' is actually langoustine/Norway lobster (smaller, sweeter)"
  }
}