{
  "name": "Súðavík - Arctic Fox Center Village",
  "description": "Súðavík establishes small Westfjords village where approximately 190 residents inhabit Álftafjörður fjord 20 kilometers northeast Ísafjörður creating modest fishing settlement achieving international recognition hosting Arctic Fox Center Melrakkasetur research conservation education facility dedicated Iceland's only native land mammal establishing wildlife tourism destination beyond typical fishing village character demonstrating how specialized institutions transform small communities creating distinctive identities attracting visitors supporting local economy. Arctic Fox Center combines research education tourism where breeding enclosures rescue animals public exhibits create comprehensive Arctic fox experience explaining species ecology conservation challenges human-wildlife interactions establishing premier Arctic fox education facility worldwide attracting researchers students wildlife enthusiasts supporting Súðavík economy beyond fishing providing year-round employment tourism revenue diversifying economic base reducing single-industry vulnerability. 1995 avalanche tragedy killed 14 residents devastating small community where massive snow slide destroyed homes infrastructure forcing difficult decisions regarding settlement viability reconstruction relocation ultimately choosing rebuild implementing defensive barriers avalanche early-warning systems demonstrating community determination resilience maintaining settlement despite tragic losses geological hazards establishing memorial commemorating victims honoring community survival spirit.",
  "address": "Súðavík, 420 Westfjords, Iceland",
  "coordinates": {
    "longitude": -23.0333,
    "latitude": 66.0333,
    "altitude": 8.0
  },
  "rating": 4.5,
  "reviews_count": 2450,
  "category": "Town - Westfjords",
  "website": "https://www.sudavik.is",
  "phone": "+354 450 8200",
  "images": [
    "https://www.westfjords.is/images/sudavik-arctic-fox.jpg"
  ],
  "opening_hours": {
    "population": "~190",
    "location": "20 km northeast of Ísafjörður, Álftafjörður fjord",
    "arctic_fox_center": "Melrakkasetur Íslands, research/education/tourism",
    "1995_avalanche": "Tragic slide killed 14, community rebuilt",
    "character": "Small fishing village, Arctic fox tourism, avalanche resilience"
  }
}