{
  "name": "Þórbergur Center",
  "description": "The Þórbergur Center (Þórbergssetur) is a cultural center and museum dedicated to preserving the legacy of Þórbergur Þórðarson (1888-1974), one of Iceland's most important 20th-century writers. Located in Hali, East Iceland, near where Þórbergur grew up, the center celebrates this unconventional author who challenged social norms, religious orthodoxy, and political conservatism through his provocative and deeply personal writings. Þórbergur's works, particularly his autobiographical writings about growing up in rural Iceland, offer profound insights into Icelandic society during a period of dramatic change. The center houses exhibitions about his life, works, and the cultural context that shaped his writing.\n\nThe museum features carefully curated displays exploring Þórbergur's major works, including 'Bréf til Láru' (Letter to Lára), his masterwork 'Íslenzkur aðall' (Icelandic Nobility), and his controversial essays on religion and society. Visitors can learn about his evolution from poverty-stricken farm boy to influential intellectual, his struggles with establishment authorities, and his lifelong commitment to social justice and individual freedom. The exhibits include original manuscripts, photographs, personal belongings, and multimedia presentations that bring his world to life. The center also explores the landscape and community of Suðursveit in East Iceland, showing how place and environment influenced Þórbergur's worldview and writing. Special attention is paid to making his works accessible to international visitors through translations and contextual explanations.\n\nThe Þórbergur Center is located in Hali, a small settlement on Route 1 approximately 60 kilometers west of Höfn. The building occupies a spectacular site overlooking the Lón lagoon with views toward Vatnajökull glacier, providing the type of dramatic Icelandic landscape that permeates Þórbergur's writing. The center is open daily during summer months (June-August) with reduced hours in shoulder seasons. A café serves refreshments and light meals featuring local ingredients. The center also houses a quality bookshop offering Þórbergur's works in Icelandic and translation, along with books about East Iceland and Icelandic literature. The site is easily accessible from the Ring Road, making it a cultural highlight for travelers exploring East Iceland. Visiting typically requires 45-90 minutes depending on level of interest in Icelandic literature.",
  "category": "Museum",
  "coordinates": {
    "latitude": 64.353889,
    "longitude": -15.620000,
    "altitude": 10.0
  },
  "website": "https://www.thorbergur.is",
  "phone": "+354 478 1078",
  "rating": 4.4,
  "reviews_count": 195,
  "opening_hours": "June-August: Daily 10:00-18:00; September-May: By appointment"
}
