{
  "name": "Þrír Frakkar (Three Coats)",
  "description": "Þrír Frakkar, meaning \"Three Coats\" in Icelandic, is a beloved family-run restaurant in Reykjavík that has been serving authentic Icelandic cuisine for over three decades. Located in a residential neighborhood away from the downtown tourist center, this restaurant has earned a loyal following among both locals and knowledgeable visitors seeking genuine Icelandic food prepared with care and respect for tradition. The restaurant specializes in seafood and traditional Icelandic dishes, with a menu that changes based on seasonal availability and the day's catch. Þrír Frakkar represents the kind of unpretentious, quality-focused dining that characterized Reykjavík's food scene before the explosion of trendy restaurants in recent years, and it continues to thrive by maintaining its commitment to excellent ingredients and honest preparation.\n\nThe menu at Þrír Frakkar reads like a survey of Iceland's maritime culinary heritage. The restaurant is particularly famous for its seafood soup, a rich and hearty preparation that has won numerous awards and become legendary among those who've tasted it. Other menu highlights include fresh fish of the day (often halibut, cod, or wolffish), grilled Icelandic lamb, and more adventurous offerings like minke whale and puffin for those interested in trying traditional Icelandic foods that are less common internationally. The restaurant also offers a tasting menu called \"Íslenski Bitinn\" (The Icelandic Bite) that provides a comprehensive introduction to Icelandic cuisine. The wine list is well-curated with options that complement the seafood-heavy menu, and the staff are knowledgeable about pairing wines with the distinctive flavors of Icelandic ingredients.\n\nThe atmosphere at Þrír Frakkar is warm and unpretentious, with nautical-themed décor that references Iceland's fishing heritage. The restaurant occupies a converted house, giving it a cozy, intimate feel quite different from sleeker downtown establishments. Service is friendly and attentive, with staff happy to explain dishes and make recommendations. The restaurant's location in the Vesturbær neighborhood, while requiring a short taxi ride or walk from central Reykjavík, adds to its authentic local character. Þrír Frakkar attracts a mix of Icelandic families celebrating special occasions and informed travelers seeking quality Icelandic cuisine. Reservations are essential, as the restaurant's popularity and limited seating mean it fills quickly, especially on weekends. For those seeking an authentic Icelandic dining experience focused on quality ingredients and traditional preparations rather than trendy innovation, Þrír Frakkar delivers consistently excellent results.",
  "category": "Restaurant",
  "coordinates": {
    "latitude": 64.154167,
    "longitude": -21.960833,
    "altitude": 15.0
  },
  "rating": 4.7,
  "reviews_count": 2134,
  "opening_hours": "Dinner Monday-Saturday 17:30-22:00 (last seating around 21:30). Closed Sundays. Reservations required."
}
