{
  "name": "Urriðafoss - Iceland's Highest Volume Waterfall",
  "description": "Urriðafoss holds the remarkable distinction of being Iceland's highest-volume waterfall, with the mighty Þjórsá river—Iceland's longest at 230 kilometers—pouring approximately 360 cubic meters per second (12,700 cubic feet per second) across a broad curtain of cascades that stretches an impressive 230 meters (750 feet) wide during peak flow periods. Unlike Iceland's famous tall, plunging waterfalls that drop from great heights into misty pools, Urriðafoss presents a different type of spectacle: massive horizontal power as an entire river transforms into thundering whitewater across its full width, dropping a modest but significant 6 meters (12-20 feet depending on water levels) in a series of churning rapids and ledges that create constant roar and spray. The waterfall's name translates to \"Trout Falls\" (urriða means trout in Icelandic), though the location is equally famous for its salmon runs—Atlantic salmon swimming upstream to spawning grounds must navigate and jump Urriðafoss's turbulent waters, and local legend holds that Þjórsá's salmon population has evolved exceptionally strong and long tail fins specifically to clear this obstacle, a fascinating example of evolutionary adaptation to local conditions. The waterfall's prime location directly beside Iceland's Ring Road (Route 1) just east of the intersection with Route 30 makes it one of the nation's most accessible waterfalls—visitors can literally pull off the highway.",
  "address": "Route 1 (Ring Road), near Route 30 junction, South Iceland",
  "coordinates": {
    "longitude": -20.3983,
    "latitude": 63.96,
    "altitude": 30.0
  },
  "rating": 4.4,
  "reviews_count": 1890,
  "category": "Waterfall",
  "website": "https://www.south.is/en/urridafoss",
  "phone": null,
  "images": [
    "https://www.south.is/images/urridafoss-volume.jpg"
  ],
  "opening_hours": {
    "access": "Year-round (directly beside Ring Road)",
    "parking": "Pulloff from Route 1",
    "admission": "Free",
    "walk_duration": "Immediate (waterfall visible from parking)",
    "volume": "360 cms (12,700 cfs) - Iceland's highest volume",
    "width": "230 meters (750 feet)",
    "height": "6 meters (20 feet)",
    "fishing": "Renowned salmon and trout fishing (controlled access)",
    "conservation_status": "Threatened by hydroelectric proposals"
  }
}