{
  "name": "Vatnajökull National Park",
  "description": "Vatnajökull National Park is Iceland's largest national park and one of Europe's largest protected wilderness areas, encompassing approximately 14,967 square kilometers (about 14% of Iceland's land area). Established in 2008 through the merger of Jökulsárgljúfur and Skaftafell national parks with the Vatnajökull glacier region, the park protects an extraordinary diversity of landscapes including Europe's largest glacier, active volcanic systems, powerful waterfalls, glacial rivers, black sand deserts, and unique ecosystems. The park extends from the highlands of the Vatnajökull ice cap down to the southern coast, encompassing some of Iceland's most iconic natural attractions including Jökulsárlón glacier lagoon, Skaftafell wilderness area, Dettifoss waterfall, and Ásbyrgi canyon.\n\nThe park represents the full spectrum of Icelandic natural phenomena, from ice to fire. Beneath the Vatnajökull glacier lie several active volcanic systems including Bárðarbunga, Grímsvötn, and Öræfajökull, creating unique interactions between glacial and volcanic forces. The park has witnessed some of Iceland's most powerful natural events including the 2014-2015 Holuhraun eruption, glacial floods (jökulhlaups), and ongoing glacial retreat driven by climate change. The area supports diverse flora and fauna including Arctic fox, reindeer (in parts of the east), numerous bird species, and unique adaptations to extreme conditions. The park was designated a UNESCO World Heritage Site in 2019, recognized for its exceptional volcanic landscapes showcasing the dynamic geological processes of the North Atlantic.\n\nVatnajökull National Park has multiple access points and visitor centers across South and East Iceland. Major entry areas include Skaftafell in the south (with visitor center and extensive trail network), Höfn area in the southeast (access to glacier lagoons), and Ásbyrgi in the north. The park offers hundreds of kilometers of hiking trails from easy walks to multi-day wilderness treks, glacier hiking tours, ice cave visits, and ranger-led programs during summer. Each area of the park offers distinct experiences - Skaftafell for glacier access and mountain views, Jökulsárlón for iceberg-filled lagoons, Dettifoss area for powerful waterfalls, and Ásbyrgi for dramatic canyons. The park is accessible year-round though winter significantly limits access to highland areas. No entrance fee is charged, though specific attractions and guided activities have separate costs. The park represents Iceland's commitment to preserving its unique natural heritage for future generations.",
  "address": "Southeast and East Iceland (multiple access points)",
  "coordinates": {
    "longitude": -16.7,
    "latitude": 64.4,
    "altitude": 500.0
  },
  "rating": 4.9,
  "reviews_count": 9200,
  "category": "National Park",
  "website": "https://www.vatnajokulsthjodgardur.is/en",
  "phone": "+354 470 8300",
  "images": [
    {
      "source": "Wikimedia Commons",
      "url": "https://commons.wikimedia.org/wiki/File:Vatnajokull_National_Park.jpg"
    },
    {
      "source": "Vatnajökull National Park",
      "url": "https://www.vatnajokulsthjodgardur.is/en"
    }
  ],
  "opening_hours": {
    "park": "Accessible year-round (winter limits highland access)",
    "visitor_centers": "Skaftafell, Höfn, Skriðuklaustur - hours vary by season",
    "admission": "Free park entry, individual attractions may have fees",
    "key_areas": "Skaftafell, Jökulsárlón, Dettifoss, Ásbyrgi, Svartifoss",
    "unesco": "World Heritage Site since 2019"
  }
}