{
  "name": "Vesturbæjarlaug - West Reykjavík Pool Complex",
  "description": "Vesturbæjarlaug serves the vibrant Vesturbær (West Town) neighborhood of Reykjavík with a comprehensive swimming facility that combines traditional Icelandic pool culture with modern wellness amenities including infrared saunas and varied-temperature hot tubs that cater to different therapeutic preferences and tolerance levels. Located in one of Reykjavík's most desirable residential districts—known for colorful houses, proximity to the ocean, trendy cafés, and strong community identity—the pool functions as a neighborhood gathering place where local families, elderly residents, young professionals, and visitors converge for exercise, relaxation, and the quintessentially Icelandic practice of pot chat (casual conversation in hot tubs that serves as Iceland's most democratic social forum). The 25-meter outdoor pool maintains comfortable swimming temperature year-round thanks to geothermal heating, providing lanes for lap swimmers while accommodating recreational paddling and aquatic exercise. A dedicated children's pool with warmer water and shallow depth allows young swimmers to play safely while building confidence and skills that feed into Iceland's culture of universal swimming proficiency. Five hot tubs offer temperature variety ranging from 38-44°C (100-111°F), allowing bathers to select their preferred heat level—some preferring milder warmth for extended soaking and conversation, others seeking intense heat for muscle relaxation and detoxification through sweating.",
  "address": "Hofsvallagata 107, 107 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9556,
    "latitude": 64.1385,
    "altitude": 8.0
  },
  "rating": 4.6,
  "reviews_count": 1560,
  "category": "Swimming Pool",
  "website": "https://reykjavik.is/en/vesturbaejarlaug-pool",
  "phone": "+354 411 5150",
  "images": [
    "https://reykjavik.is/sites/default/files/vesturbaejarlaug-pool.jpg"
  ],
  "opening_hours": {
    "year_round": "Check official website for current hours",
    "steam_room_closed": "Fridays 1:00 PM - 3:00 PM (deep cleaning)",
    "weekend_saunas": "Saunas and infrared sauna open 10:00 AM Saturdays and Sundays",
    "reykjavik_city_card": "Free admission with Reykjavík City Card",
    "pool_size": "25m outdoor pool",
    "hot_tubs": "5 hot tubs (38-44°C / 100-111°F)",
    "cold_plunge": "6°C (43°F)",
    "saunas": "Two traditional saunas + infrared sauna (added 2025)",
    "features": "Steam room, waterslide, children's pool, gym",
    "upgrades": "2025 additions: infrared sauna, facility improvements",
    "neighborhood": "Trendy Vesturbær district, near Grotta lighthouse",
    "character": "Neighborhood pool with community atmosphere"
  }
}