{
  "name": "Vesturbæjarlaug - West Reykjavík Pool Complex",
  "description": "Vesturbæjarlaug serves the vibrant Vesturbær (West Town) neighborhood of Reykjavík with a comprehensive swimming facility that combines traditional Icelandic pool culture with modern wellness amenities including infrared saunas and varied-temperature hot tubs that cater to different therapeutic preferences and tolerance levels. Located in one of Reykjavík's most desirable residential districts—known for colorful houses, proximity to the ocean, trendy cafés, and strong community identity—the pool functions as a neighborhood gathering place where local families, elderly residents, young professionals, and visitors converge for exercise, relaxation, and the quintessentially Icelandic practice of pot chat (casual conversation in hot tubs that serves as Iceland's most democratic social forum). The 25-meter outdoor pool maintains comfortable swimming temperature year-round thanks to geothermal heating, providing lanes for lap swimmers while accommodating recreational paddling and aquatic exercise. A dedicated children's pool with warmer water and shallow depth allows young swimmers to play safely while building confidence and skills that feed into Iceland's culture of universal swimming proficiency. Five hot tubs offer temperature variety ranging from 38-44°C (100-111°F), allowing bathers to select their preferred heat level—some preferring milder warmth for extended soaking and conversation, others seeking intense heat for muscle relaxation and detoxification through sweating. The facility includes two traditional saunas plus a modern infrared sauna added in 2025, expanding therapeutic options with the penetrating warmth that infrared technology provides for deep tissue relaxation, improved circulation, and the claimed health benefits that make infrared saunas increasingly popular. A steam room offers humid heat distinct from dry sauna warmth, beneficial for respiratory health and skin hydration. The cold plunge pool maintained at bracing 6°C (43°F) provides the essential contrast bathing component that many Icelanders practice, alternating between hot and cold immersion to stimulate circulation, boost immune function, and create the invigorating sensation that devotees find addictive. A waterslide adds playful entertainment for children and adventurous adults. The facility underwent upgrades in 2025 that added the infrared sauna and improved existing amenities while maintaining the intimate scale that distinguishes neighborhood pools from mega-complexes. Holders of the Reykjavík City Card receive free admission, making the pool an excellent value-add for tourists who purchase the card for museum access and public transportation. The pool closes its steam room every Friday 1:00-3:00 PM for deep cleaning—a practical detail reflecting Icelandic emphasis on hygiene and maintenance. Weekend sauna and infrared sauna hours begin later at 10:00 AM rather than opening with the pool. Vesturbæjarlaug's location in trendy Vesturbær places it near charming cafés, vintage shops, and the seaside Grotta lighthouse walk, making it easy to combine a swim with neighborhood exploration.",
  "address": "Hofsvallagata 107, 107 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.9556,
    "latitude": 64.1385,
    "altitude": 8.0
  },
  "rating": 4.6,
  "reviews_count": 1560,
  "category": "Swimming Pool",
  "website": "https://reykjavik.is/en/vesturbaejarlaug-pool",
  "phone": "+354 411 5150",
  "images": [
    "https://reykjavik.is/sites/default/files/vesturbaejarlaug-pool.jpg"
  ],
  "opening_hours": {
    "year_round": "Check official website for current hours",
    "steam_room_closed": "Fridays 1:00 PM - 3:00 PM (deep cleaning)",
    "weekend_saunas": "Saunas and infrared sauna open 10:00 AM Saturdays and Sundays",
    "reykjavik_city_card": "Free admission with Reykjavík City Card",
    "pool_size": "25m outdoor pool",
    "hot_tubs": "5 hot tubs (38-44°C / 100-111°F)",
    "cold_plunge": "6°C (43°F)",
    "saunas": "Two traditional saunas + infrared sauna (added 2025)",
    "features": "Steam room, waterslide, children's pool, gym",
    "upgrades": "2025 additions: infrared sauna, facility improvements",
    "neighborhood": "Trendy Vesturbær district, near Grotta lighthouse",
    "character": "Neighborhood pool with community atmosphere"
  }
}
