{
  "name": "Viðey - Reykjavík's Art Island with Imagine Peace Tower",
  "description": "Viðey represents Reykjavík's cultural escape located in Kollafjörður just 15 minutes by ferry from city center, where 1.7-square-kilometer island combines Icelandic historical heritage, contemporary art installations, and Yoko Ono's Imagine Peace Tower memorial to John Lennon creating unique destination blending nature, art, and spirituality within easy reach of capital's 130,000+ residents and Iceland's tourist influx. The island's historical significance predates Reykjavík's founding, with Viðey hosting monastery from 1226 until Reformation in 1539, making it one of Iceland's earliest centers of religious, cultural, and economic power where monks cultivated learning, preserved manuscripts, and accumulated wealth through landholdings and tithes that made Viðey monastery among Iceland's richest ecclesiastical institutions. The Viðeyjarstofa (Viðey House) built 1755-1757 as residence for Skúli Magnússon (considered father of Reykjavík for establishing city's industrial enterprises) represents Iceland's oldest stone building still standing, demonstrating rare permanence in country where turf and timber construction dominated until 20th century—this beautifully restored building now houses exhibitions and provides historical anchor connecting contemporary art island to colonial-era Iceland. Yoko Ono's Imagine Peace Tower installed 2007 serves as beacon to world peace dedicated to John Lennon's memory, projecting powerful beam of light skyward from white stone monument inscribed with 'Imagine Peace' in 24 languages, with tower illuminated annually October 9 (Lennon's birthday) through December 8 (assassination anniversary) creating spectacular night sky display visible from Reykjavík on clear evenings. Additional lighting periods occur December 21-30 (6 PM-midnight), December 31 (6 PM-morning), February 18 (Yoko's birthday, 8 PM-morning), and March 20-27 (commemorating John and Yoko's honeymoon, 8 PM-midnight), transforming routine dates into pilgrimage opportunities for Beatles fans and peace advocates. Richard Serra's monumental sculpture 'Áfangar' (Milestones) consists of nine pairs of four-meter-high basalt columns positioned across island landscape creating powerful dialogue between human-made verticality and horizontal island topography, with visitors walking among columns experiencing shifting perspectives as sculptures align and separate depending on viewing position—this site-specific artwork demonstrates how contemporary art can enhance rather than dominate natural landscapes. The Reykjavík Art Museum manages Viðey's cultural programming including guided walks through artwork installations, historical tours of Viðeyjarstofa, and seasonal events celebrating island's artistic and historical character, while preserving archaeological sites and natural environments from development pressures. Ferry access operates year-round with summer service (May-September) departing from both Reykjavík Old Harbour near city center and Skarfabakki pier in Laugarnes offering multiple daily departures, while winter service (October-April) operates weekends only from Skarfabakki, with round-trip tickets costing 2,100 ISK ($15 USD) winter and 2,300 ISK ($17 USD) summer as of 2024—this affordable pricing makes Viðey accessible day trip for budget-conscious travelers seeking art and nature without expensive tours. The island's car-free environment creates peaceful atmosphere where walking trails connect artwork installations, historical buildings, bird cliffs hosting Arctic terns and other seabirds, and viewpoints overlooking Faxaflói bay toward mountains and glaciers creating 360-degree panoramas unavailable from sea-level Reykjavík. Viðey's eastern section preserves history of village and fishing company that operated during island's inhabited period when year-round population maintained community before economic consolidation emptied island leaving only seasonal activity and tourism infrastructure. The combination of easy ferry access, compact size allowing complete exploration in 2-4 hours, free admission to outdoor art installations, and proximity to Reykjavík makes Viðey ideal half-day excursion for visitors with limited time seeking nature and culture beyond city streets, while residents use island for peaceful walks, picnics, and contemplation escaping urban density.",
  "address": "Viðey, Kollafjörður, 104 Reykjavík, Iceland (15 min ferry from city)",
  "coordinates": {
    "longitude": -21.8667,
    "latitude": 64.1667,
    "altitude": 32.0
  },
  "rating": 4.6,
  "reviews_count": 3120,
  "category": "Island & Art Site",
  "website": "https://www.videy.com",
  "phone": "+354 533 5055",
  "images": [
    "https://www.imaginepeacetower.com/images/tower-light.jpg"
  ],
  "opening_hours": {
    "size": "1.7 km²",
    "ferry_summer": "May-September daily from Old Harbour & Skarfabakki",
    "ferry_winter": "October-April weekends only from Skarfabakki",
    "ferry_duration": "15 minutes from Reykjavík",
    "ferry_price": "2,100 ISK winter, 2,300 ISK summer (2024) - $15-17 USD round-trip",
    "monastery_period": "1226-1539 - one of Iceland's earliest religious centers",
    "videyarstofa": "Built 1755-1757, Iceland's oldest standing stone building",
    "skuli_magnusson": "Residence of 'Father of Reykjavík' who established industrial enterprises",
    "imagine_peace_tower": "Yoko Ono 2007, memorial to John Lennon",
    "tower_inscription": "Imagine Peace in 24 languages on white stone monument",
    "tower_main_period": "October 9 (Lennon birth) - December 8 (assassination) annually",
    "tower_additional": "Dec 21-30 (6pm-midnight), Dec 31 (6pm-morning), Feb 18 (Yoko birthday, 8pm-morning), Mar 20-27 (honeymoon, 8pm-midnight)",
    "richard_serra": "Áfangar (Milestones) - 9 pairs of 4m basalt columns, 1990",
    "site_specific": "Sculptures create shifting perspectives across island landscape",
    "reykjavik_art_museum": "Manages cultural programming, guided walks, exhibitions",
    "car_free": "Peaceful walking trails connect art, history, nature",
    "exploration_time": "2-4 hours for complete island tour",
    "free_admission": "Outdoor art installations accessible without tickets",
    "seabirds": "Arctic terns and other species nest on cliffs",
    "viewpoints": "360-degree panoramas of Faxaflói bay, mountains, glaciers",
    "historical_village": "Eastern section preserves fishing company history",
    "proximity": "Easy half-day excursion from Reykjavík",
    "local_use": "Residents escape urban density for walks and picnics"
  }
}
