{
  "name": "Vík í Mýrdal - Iceland's Southernmost Village",
  "description": "Vík establishes Iceland's southernmost mainland village where approximately 300 residents inhabit dramatic south coast positioning beneath Mýrdalsjökull glacier Katla volcano creating spectacular geological setting black sand beaches towering sea stacks establishing essential Ring Road service stop supporting travelers exploring south coast attractions providing fuel accommodations dining emergency services crucial infrastructure isolated coastal Route 1 section lacking alternative settlements comprehensive facilities demonstrating Vík's disproportionate importance relative tiny population. Reynisfjara black sand beach ranks Iceland's most visited coastal destinations where basalt columns towering Reynisdrangar sea stacks powerful Atlantic surf create dramatic seascapes attracting millions visitors annually though dangerous sneaker waves periodically injure kill tourists ignoring safety warnings creating tragic incidents requiring constant vigilance respect ocean power avoiding turning backs waves maintaining safe distances waterline preventing deadly wave surges pulling victims offshore. Víkurkirkja church commands hilltop location providing panoramic village coastal views where white structure red roof creates iconic imagery photographed countless visitors establishing architectural landmark beyond purely religious function though active parish serves local congregation maintaining community spiritual needs alongside tourism photographic appeal demonstrating dual-purpose infrastructure supporting residents visitors simultaneously.",
  "address": "Vík í Mýrdal, 870 South Iceland (Ring Road Route 1)",
  "coordinates": {
    "longitude": -19.0067,
    "latitude": 63.4182,
    "altitude": 20.0
  },
  "rating": 4.6,
  "reviews_count": 12340,
  "category": "Town - South Iceland",
  "website": "https://www.sveitarfelagidhorsmork.is",
  "phone": "+354 487 8050",
  "images": [
    "https://www.south.is/images/vik-church-reynisdrangar.jpg"
  ],
  "opening_hours": {
    "population": "~300 (Iceland's southernmost mainland village)",
    "location": "Route 1 Ring Road, beneath Mýrdalsjökull glacier",
    "reynisfjara": "Black sand beach, basalt columns, dangerous waves",
    "reynisdrangar": "66m basalt sea stacks offshore",
    "vikurkirkja": "Hilltop church, panoramic village/coast views",
    "katla_threat": "Subglacial volcano, evacuation plans required",
    "vikurprjon": "Wool gallery, traditional Icelandic sweaters",
    "character": "Essential Ring Road service stop, dramatic coastal setting"
  }
}