{
  "name": "Whales of Iceland",
  "description": "Whales of Iceland is the largest whale exhibition in Europe, located in Reykjavík's Old Harbor district at Grandi. This impressive museum features 23 life-size models of whale species found in Icelandic waters, including the enormous 25-meter-long blue whale, suspended from the ceiling in lifelike poses. Opened in 2014, the exhibition occupies a massive 1,500 square meter former fishery building, providing visitors with an intimate understanding of these magnificent marine mammals. The incredibly detailed models were created using real whale skeletons as references, with each model taking up to two years to complete. The exhibition includes interactive multimedia displays, underwater soundscapes featuring actual whale songs, and touchscreen stations providing information about whale behavior, migration patterns, and conservation efforts. Visitors can walk beneath the suspended whales, experiencing their true scale and majesty from multiple angles. The museum also features a dedicated children's corner with hands-on activities, a small cinema screening whale documentaries, and exhibits about Iceland's whaling history and the ongoing debate between tradition and conservation. Audio guides are available in 10 languages, providing detailed information about each species, their characteristics, feeding habits, and the best locations around Iceland for whale watching. The gift shop offers whale-themed products and supports marine conservation initiatives.",
  "address": "Fiskislóð 23-25, 101 Reykjavík, Iceland",
  "coordinates": {
    "longitude": -21.948056,
    "latitude": 64.154167,
    "altitude": 5.0
  },
  "rating": 4.5,
  "reviews_count": 4100,
  "category": "Museum",
  "website": "https://whalesoficeland.is",
  "phone": "+354 571 0077",
  "opening_hours": {
    "winter": "Daily 10:00-17:00 (October-March)",
    "summer": "Daily 10:00-19:00 (April-September)",
    "admission": "Adults 3,500 ISK, Children 7-15 years 1,700 ISK, Under 7 free, Family discounts available",
    "duration": "Allow 45-90 minutes for full experience"
  }
}
