{
  "name": "Ytri-Tunga",
  "description": "Ytri-Tunga is a unique golden sand beach on the southern coast of the Snæfellsnes Peninsula, distinguished as one of Iceland's most reliable seal-watching locations and a rare example of a non-black sand beach in a country dominated by volcanic black shores. Located approximately 160 kilometers northwest of Reykjavík and 50 kilometers south of Stykkishólmur, the beach lies near a farm of the same name, with parking access just 1 kilometer from Route 54. The golden hue of the sand comes from a distinctive mix of quartz, feldspar, and other minerals shaped by centuries of coastal erosion, creating a striking visual contrast against the typical black volcanic beaches found elsewhere in Iceland. The beach is renowned for its resident seal colony consisting primarily of harbor seals, characterized by their round faces and sleek bodies, which are frequently observed lounging on exposed rocks during low tide. Grey seals, larger than their harbor cousins, occasionally make appearances but are less common visitors. Ytri-Tunga has earned its reputation as perhaps the most reliable seal-watching site in all of Iceland, with seals present year-round, though summer months from May through August offer the best viewing opportunities when seals are most active and numerous. During peak season from June to July, dozens of seals can often be spotted basking on the rocks closest to shore, particularly during low tide when the rocky outcrops are fully exposed above the waterline. The beach is highly accessible, requiring only a short 400-meter walk from the parking area to the shoreline, making it suitable for visitors of all ages and mobility levels. Iceland's marine mammal protection guidelines require visitors to maintain a minimum distance of 50 meters from the nearest seal to avoid disturbing these protected animals, and if seal pups are present on the rocks, visitors should double that distance to 100 meters. This respectful distance protects both the animals from stress and visitors from potential defensive behavior, as seals can be aggressive if they feel threatened, particularly mothers with pups. The seals are wild animals that haul out on the rocks to rest, warm themselves in the sun, and care for their young during pupping season in early summer. Binoculars or telephoto camera lenses significantly enhance the viewing experience while maintaining appropriate distances. A parking fee of approximately 1,000 ISK applies, payable at the on-site kiosk or online through CheckIt.is. The beach offers not only exceptional wildlife viewing but also scenic coastal landscapes with views across the bay toward distant mountains and the occasional glimpse of Snæfellsjökull glacier on clear days.",
  "address": "Ytri-Tunga, 340 Stykkishólmur, Iceland",
  "coordinates": {
    "longitude": -23.0805,
    "latitude": 64.8029,
    "altitude": 0.0
  },
  "rating": 4.6,
  "reviews_count": 2600,
  "category": "Beach",
  "website": "https://www.west.is/en/service/seals-at-ytri-tunga",
  "phone": null,
  "images": [
    {
      "source": "West Iceland",
      "url": "https://www.west.is/en/service/seals-at-ytri-tunga"
    },
    {
      "source": "Guide to Iceland",
      "url": "https://guidetoiceland.is/travel-iceland/drive/ytri-tunga-beach"
    }
  ],
  "opening_hours": {
    "access": "Open 24/7 year-round",
    "parking_fee": "1,000 ISK per vehicle (approx. €7 / $8 USD), payable at kiosk or online at CheckIt.is",
    "parking_location": "1 km from Route 54, 400-meter walk to beach",
    "best_seal_viewing": "May to August, particularly June-July peak season",
    "optimal_tide": "Low tide when rocks are fully exposed - seals haul out to rest",
    "seal_species": "Harbor seals (most common), grey seals (occasional)",
    "viewing_distance": "Minimum 50 meters from nearest seal, 100 meters if pups present",
    "wildlife_guidelines": "Protected marine mammals - no approaching, feeding, or disturbing. Binoculars recommended.",
    "best_for": "Wildlife photography, family-friendly seal watching, golden sand beach experience",
    "nearby_facilities": "Parking kiosk only, plan restroom stops at nearby towns",
    "distance_from_reykjavik": "160 km northwest",
    "distance_from_stykkisholmur": "50 km south"
  }
}
