{
  "name": "Ásgarðslaug - Outdoor Pool in Garðabær",
  "description": "Ásgarðslaug serves Garðabær municipality—a prosperous residential community of approximately 17,000 residents located immediately south of Reykjavík along the coast—with an outdoor swimming facility emphasizing traditional Icelandic pool culture through year-round geothermally heated outdoor swimming, multiple hot tubs, and recently renovated amenities, while pioneering progressive admission policies offering free swimming to all visitors under 18 and over 67 years old. Garðabær is known as one of Iceland's wealthiest municipalities with high per-capita income, excellent schools, proximity to both Reykjavík employment centers and coastal recreation areas, and strong community investment in quality public services including swimming facilities. Ásgarðslaug exemplifies classic outdoor Icelandic pool design where swimming occurs exclusively outdoors regardless of season, creating the characteristically Icelandic experience of gliding through warm geothermally heated water while breathing cold air and watching steam rise dramatically—an atmospheric experience that many visitors initially find improbable but quickly discover to be surprisingly comfortable and oddly addictive. The outdoor pool accommodates lap swimmers maintaining fitness routines, recreational paddlers, families with children learning to swim, and elderly residents practicing gentle aquatic exercise that maintains mobility with reduced joint stress. Multiple hot tubs provide the essential soaking and pot chat experiences where Garðabær residents gather for relaxed conversations that range from local municipal affairs to national politics to family matters.",
  "address": "Dalvegur 24, 210 Garðabær, Iceland",
  "coordinates": {
    "longitude": -21.9286,
    "latitude": 64.0889,
    "altitude": 8.0
  },
  "rating": 4.5,
  "reviews_count": 980,
  "category": "Swimming Pool",
  "website": "https://www.gardabaer.is/ibuar/ithrotta-og-tomstundastarf/sundlaugar/asgardslaug/",
  "phone": "+354 565 6700",
  "images": [
    "https://www.gardabaer.is/images/asgardslaug-pool.jpg"
  ],
  "opening_hours": {
    "weekdays": "Monday-Friday 6:30 AM - 10:00 PM",
    "weekends": "Saturday-Sunday 8:00 AM - 6:00 PM",
    "admission_0_17": "Free (under 18)",
    "admission_67_plus": "Free (age 67+)",
    "admission_18_66": "Standard adult rates apply",
    "access_card": "Valid for both Ásgarðslaug and Álftaneslaug",
    "outdoor_only": "Outdoor swimming pool (year-round geothermal heating)",
    "hot_tubs": "Multiple hot tubs",
    "children_pool": "Shallow children's pool with small waterslide",
    "recent_upgrades": "Renovated outdoor showers, upgraded hot tubs, added cold plunge tub",
    "progressive_policy": "Free for ages 0-17 and 67+",
    "municipality": "Garðabær (pop. ~17,000), affluent coastal municipality south of Reykjavík",
    "character": "Traditional outdoor Icelandic pool culture, neighborhood atmosphere",
    "sister_pool": "Álftaneslaug (Garðabær's second pool with indoor facilities)"
  }
}