{
  "name": "Ölverk Pizza & Brewery - Geothermal-Powered Craft Brewing",
  "description": "Ölverk Pizza & Brewery operates from Hveragerði, the geothermal village 35 minutes from Reykjavík where steaming vents, hot springs, and geothermal energy infrastructure create landscape defined by volcanic activity, positioning the brewery to harness renewable energy for brewing operations while occupying prime Golden Circle location that guarantees steady tourist traffic exploring Iceland's most famous route. Founded in spring 2017 by owners Laufey and Elvar, Ölverk represents passionate entrepreneurial venture combining two loves—premium wood-fired pizza and fine Icelandic craft beer—into integrated food-and-drink destination where complementary products enhance each other rather than competing for attention. The unique use of geothermal energy in brewing process makes Ölverk must-stop for craft beer enthusiasts and eco-conscious visitors interested in sustainable production methods: geothermal steam and hot water directly heat brewing kettles and facilitate temperature-controlled fermentation, eliminating fossil fuel dependence that burdens conventional breweries while demonstrating how Iceland's volcanic geology provides practical advantages beyond dramatic landscapes. Brewing operations began in October 2017, producing craft beer on-site in small batches that allow experimentation and quality control impossible at industrial scale—the portfolio includes IPAs showcasing assertive hop character, sour beers featuring wild yeast fermentation creating tart, funky flavors, pilsners representing classic European lager tradition, and seasonal offerings that take advantage of ingredient availability and brewing team's creative impulses. Tours allow guests to taste four different Ölverk beers while learning about brewing processes, geothermal energy applications, and the challenges of small-batch production in Iceland's limited market where ingredient sourcing, equipment maintenance, and distribution logistics create obstacles that established breweries avoid through scale and infrastructure. The wood-fired pizza program represents equal commitment to quality and craft: proper wood fire creates high temperatures (900°F/480°C) that produce authentic Neapolitan characteristics—leopard-spotted charring on crust edges, soft interior with proper chew, toppings cooked to perfection without burning—that gas or electric ovens struggle to replicate. The pizza-beer pairing represents natural combination where malty, crisp beer cuts through pizza's richness while hoppy bitterness complements tomato sauce acidity. Beyond beer and pizza, Ölverk produces hot sauces using chilis grown in geothermally heated greenhouse nearby, creating value-added products that extend brand beyond brewing while demonstrating agricultural possibilities in Iceland's challenging climate where protected cultivation and geothermal heating allow crops impossible in open fields. The Golden Circle location provides strategic advantage: most Iceland visitors drive the Golden Circle route including Þingvellir, Geysir, and Gullfoss, with Hveragerði positioned as convenient lunch or refreshment stop breaking the circuit into manageable segments. This tourist traffic guarantees customer base that off-route locations struggle to attract, though success depends on quality and reputation rather than simply existing along popular route—numerous establishments on Golden Circle fail despite location advantages when food or service disappoints.",
  "address": "Breiðumörk 11, 810 Hveragerði, Iceland (Golden Circle, 35 min from Reykjavík)",
  "coordinates": {
    "longitude": -21.1836,
    "latitude": 64.0060,
    "altitude": 85.0
  },
  "rating": 4.7,
  "reviews_count": 3120,
  "category": "Brewery & Pizzeria",
  "website": "https://www.olverk.is",
  "phone": "+354 483 3030",
  "images": [
    "https://www.olverk.is/images/geothermal-brewing.jpg"
  ],
  "opening_hours": {
    "founded": "Spring 2017",
    "brewing_start": "October 2017",
    "owners": "Laufey and Elvar - passionate entrepreneurial venture",
    "geothermal_brewing": "Unique use of geothermal energy for heating kettles and fermentation",
    "renewable_energy": "Eliminates fossil fuel dependence, sustainable production",
    "production_scale": "Small batches allow experimentation and quality control",
    "beer_styles": "IPAs, sour beers, pilsners, seasonal offerings",
    "tours": "Taste 4 different Ölverk beers, learn about geothermal brewing",
    "wood_fired_pizza": "Authentic 900°F/480°C temperatures create Neapolitan characteristics",
    "pizza_quality": "Leopard-spotted charring, soft interior, proper chew",
    "beer_pairing": "Malty crisp beer cuts pizza richness, hoppy bitterness complements acidity",
    "hot_sauce": "Uses chilis from geothermally heated greenhouse nearby",
    "agricultural_innovation": "Protected cultivation and geothermal heating enable challenging crops",
    "hveragerði": "Geothermal village, steaming vents, hot springs, volcanic activity",
    "golden_circle": "Prime location on Iceland's most famous tourist route",
    "distance": "35 minutes from Reykjavík",
    "strategic_position": "Convenient lunch/refreshment stop between Golden Circle attractions",
    "tourist_traffic": "Route guarantees customer base, success depends on quality",
    "eco_tourism": "Appeals to sustainable-conscious visitors interested in geothermal applications",
    "dual_focus": "Premium pizza and craft beer enhance each other"
  }
}
